{
  "version": 2,
  "data": [
  {
    "mId": 1,
    "mName": "Carrot",
    "mNameIcon": "carrot.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "10",
    "mPrice_Rb": "7",
    "mSell_value": "18",
    "mObtainable_way": "Carrot seed can be obtained by the following ways:\n\n1. Has a 100% chance to be in stock in the Seed Shop. A user can purchase a seed for 10 Sheckles or 7 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvest.\n5. Able to be dug up by a Dog, Golden Lab or Shiba Inu.",
    "mTrivia": "Overview\nThe Carrot crop is a single-harvest, common crop obtainable in the Seed Shop.\n\nThe Carrot is classified as a Summer, Vegetable type crop, meaning it will be affected by items targeted at those specific crop types.\n\nAppearance\nThe Carrot produce contains a orange body, with 4 blocky leaves on top of it.\nThe Carrot crop is the same as the Produce, but sunken in the ground.\n\nThe Carrot seed is a solid orange color.\nThis is the sixteenth crop that the player can plant and buy in-game.\n\nThe Carrot takes about 7.2 seconds to fully grow, which is the second fastest in the game.\nThe The Easter Event 2025 variant of this crop is the Chocolate Carrot and the Summer Harvest Event 2025 variant of this crop is the Wild Carrot.\n\nThe Carrot can be eaten by the Bunny, Bagel bunny, Black Bunny granting double that carrot's value in Sheckles.\n\nThe player can only buy 2 carrots at the start of their game, as they are given 20 sheckles.\nThe carrot is the first single harvest plant that is available in the Seed Shop.\n\nThe Carrot is one of three crops to have more than two variations, the second being the Apple and the third being the Mango.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "5-25",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 2,
    "mName": "Strawberry",
    "mNameIcon": "strawberry.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "50",
    "mPrice_Rb": "21",
    "mSell_value": "14 - 15",
    "mObtainable_way": "Strawberry seed can be obtained by the following ways:\n\n1. Has a 100% chance to be in stock in the Seed Shop. A user can purchase a seed for 50 Sheckles or  21 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvested.\n5. Rarely dug up by a Dog, Golden Lab or Shiba Inu.",
    "mTrivia": "Overview\nThe Strawberry is a common, multi-harvest crop.\n\nThe Strawberry is classified as a Sweet, Leafy, Summer, Berry type crop, meaning it will be affected by items targeted at those specific crop types.\n\nAppearance\nThe Strawberry seed has a strong red color.\nThe Strawberry crop is a small dark green plant with a tiny green stem that produces 4 dark green leaves that form an umbrella shape.\n\nThe Strawberry produce has small, blocky, red berry that has 4 small leaves at the top of it.\nStrawberry takes 10 seconds for the crop to grow and produces its berries from 5 to 8 seconds.\n\nThe Strawberry is the second crop new players can purchase, after the Carrot.\nA Strawberry's max yield is 4.\n\nPrior to the Easter Event, buying a Strawberry seed for 21 Roblux, would instead give the player a Cherry Blossom seed. This has since been removed.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-6",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 3,
    "mName": "Pink Tulip",
    "mNameIcon": "pinktulip.webp",
    "mTier": "Common",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "10,000",
    "mPrice_Rb": "99",
    "mSell_value": "9,928",
    "mObtainable_way": "The Chocolate Carrot seed was previously obtained in the following ways\n1. Chocolate Carrot seed had a 100% chance to be in stock in Poppy's Easter Shop. A user could purchase a seed for 10,000 Sheckles or 99 Roblux.\n2. Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-6",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 4,
    "mName": "Chocolate Carrot",
    "mNameIcon": "chocolatecarrot.webp",
    "mTier": "Common",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "767",
    "mObtainable_way": "The intended method to obtain a Pink Tulip is unknown. It is currently unobtainable and requires admin-rights or testing-rights to acquire.",
    "mTrivia": "The Pink Tulip model was used as decoration in the Bizzy Bee Event area.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-6",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 5,
    "mName": "Blueberry",
    "mNameIcon": "blueberry.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "400",
    "mPrice_Rb": "49",
    "mSell_value": "18 - 20",
    "mObtainable_way": "The following ways could obtain a blueberry seed:\n\n1. Has a 100% chance to be in stock in the Seed Shop. A user can purchase a seed for 400 Sheckles or 49 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Golden Lab , or Shiba Inu",
    "mTrivia": "Overview\nThe Blueberry is a multi-harvest, uncommon crop.\n\nThe Blueberry is classified as a Leafy, Sweet, Summer, Berry type Fruit, meaning it will be affected by items targeted at those specific crop types.\n\nAppearance\nThe Blueberry seed is a solid dark blue color.\nThe Blueberry crop consists of several dark green cubes and cuboids arranged to resemble a bush.\nThe Blueberry produce is a small blue cube with a short, darker blue stem at the top, resembling a real-life blueberry.\n\nA Blueberry crop takes 105 seconds to fully grow, and one Blueberry takes approximately 22 seconds.\n\nA Blueberry's max yield is dependent on how big the player's Blueberry plant is; a larger or oversized one can carry up to 13-14 berries.\n\nThe Blueberry is one of the 5 bush crops; the other four are Raspberry, Serenity, Celestiberry , and Rose.\n\nThe Blueberry crop takes up a lot of space in the player’s garden; hence, it is recommended to remove them if possible.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 6,
    "mName": "Rose",
    "mNameIcon": "rose.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "199",
    "mSell_value": "4,512 - 5,000",
    "mObtainable_way": "The Rose seed can be obtained in the following ways:\n\n1. Flower Seed Packs 40%\n2. Opening any remaining Exotic Flower Seed Packs 39%\n3. Rainbow Sack 30%",
    "mTrivia": "Overview\nThe Rose is a multi-harvest, uncommon crop that can be obtained from the Flower Seed Pack.\n\nThe Rose is classified as a Leafy, and Flower type crop, meaning it will be affected by items targeted at those specific crop types.\n\nAppearance\nThe Rose seed is a plain dark red.\nThe Rose crop is a bush that is a recolored version of the Celestiberry bush, being colored green with brown thorns.\nThe Rose produce is a small, maroon colored flower that is comprised of numerous small and angled blocks that form the shape of a typical rose.\n\nThe model of the Rose bush is the same as the models used in the Celestiberry and Crimson Vine.\n\nThe image of the Rose bush was later remodeled in the Flower Seed Pack to a higher quality version.",
    "mShop": 3,
    "mNameShop": "Flower Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 7,
    "mName": "Orange Tulip",
    "mNameIcon": "orangetulip.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "600",
    "mPrice_Rb": "14",
    "mSell_value": "767 - 850",
    "mObtainable_way": "Orange Tulip seed can be obtained in the following ways:\n\n1. Has a 33.3% chance (1/3) to be in stock in the Seed Shop. A user can purchase an Orange Tulip seed for 600 Sheckles or 14 Roblux.\n2. Lucky Harvest\n3. Snail, yield a seed when harvest\n4. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Description\nThe Orange Tulip is an uncommon, single harvest crop. It is classified as a flower type crop, meaning it is affected by items targeted at this specific crop type.\n\nAppearance\nThe Orange Tulip is an orange cup-shaped flower with long, tall, green leaves.\nThe Orange Tulip seed is a very slightly paler Carrot seed.\nThe Orange Tulip takes about 7 seconds to be fully grown.\n\nThis means that the Orange Tulip is the tied with the carrot being fastest growing crop in the entire game.\n\nOrange Tulip is currently one of two seeds that does not have a 'seed' in its name in the Seed Shop. The reason why is unknown.\n\nThe Orange Tulip was supposed to be the first tulip in the game, the second being Pink Tulip",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 8,
    "mName": "Monoblooma",
    "mNameIcon": "monoblooma.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "19,855 - 22000",
    "mObtainable_way": "The Monoblooma can be obtained from the Zen Seed Pack or Exotic Zen Seed Pack.",
    "mTrivia": "Overview\nThe Monoblooma is a limited, single-harvest, uncommon crop, added during the Zen Event.\n\nAppearance\nThe Monoblooma appears to be a monotone-coloured flower supported with a green stem and a leaf. A white stem is protruding from the middle of the flower. The seed appears to be half pale teal and half black, split vertically. On the teal side is a smaller black rectangle extruding from it's center. On the black half, the same pale teal is a smaller rectangle and is also extruding from the center.",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 9,
    "mName": "Dezen",
    "mNameIcon": "dezen.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "26,398 - 29,250",
    "mObtainable_way": "The Dezen seed can be obtained in the following ways:\n\n1. Kitsune Chest 34.5% chance\n2. Exotic Kitsune Chest 34% chance",
    "mTrivia": "Overview\nThe Dezen is a limited, single-harvest, uncommon crop that was released in the Corrupted Zen Event.\n\nAppearance\nThe appearance of a Dezen is a light-brown stem with a brown flower that is glowing orange in the middle.\n\nThe appearance of the seed slightly resembles the Spiked Mango.",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 10,
    "mName": "Stonebite",
    "mNameIcon": "stonebite.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "31,588 - 35,000",
    "mObtainable_way": "The Stonebite seed can be obtained in the following ways:\n\n1. Opening any remaining Ancient Seed Pack 40%\n2. Opening any remaining Exotic Ancient Seed Pack 39%\n3. Rainbow Sack 30%",
    "mTrivia": "Overview\nThe Stonebite is a limited, single harvest, uncommon crop which was added in the Prehistoric Event.\n\nAppearance\nThe Stonebite has a light green stem with a leaf that bends onto the main flower part which is a light greyish blue in color & resembles a mouth.\nThe Stonebite looks like the plant Venus Fly Trap but much smaller due to the mouth and stem shape.\n\nThe Stonebite's Stem has a different stem angle for every Stonebite.",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 11,
    "mName": "Red Lollipop",
    "mNameIcon": "redlollipop.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "45,000",
    "mPrice_Rb": "199",
    "mSell_value": "45,125",
    "mObtainable_way": "Red Lollipop seed was previously obtained in the following ways:\n1. During the Easter Event 2025, a Red Lollipop seed had a 50% chance to be in stock in Poppy's Easter Shop. A user could purchase a seed for 45,000 Sheckles or 199 Roblux.",
    "mTrivia": "",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 12,
    "mName": "Nightshade",
    "mNameIcon": "nightshade.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "Seed Chance:\n- Crafters Seed Pack 40%\n- Exotic Crafters Seed Pack 39%\n-Rainbow Sack 30%\n- Flower Seed Pack + 10 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "27,075",
    "mObtainable_way": "The Nightshade seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Packs",
    "mTrivia": "The center of the Nightshade has a neon texture.",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 13,
    "mName": "Crocus",
    "mNameIcon": "crocus.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "3,159",
    "mObtainable_way": "The Nightshade seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Packs",
    "mTrivia": "The center of the Nightshade has a neon texture.",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 14,
    "mName": "Lavender",
    "mNameIcon": "lavender.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "3 Honey",
    "mPrice_Rb": "99",
    "mSell_value": "22,563",
    "mObtainable_way": "Lavender seed could have been obtained from the following ways:\n1. The Lavender seed had a 100% chance of restocking in quantities of 3 to 4. Players could have bought it from the Honey Shop for 3 Honey or 99 Roblux.",
    "mTrivia": "",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 15,
    "mName": "Manuka Flower",
    "mNameIcon": "manukaflower.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "- Orange Tulip Seed\n- Daffodil Seed\n- 10 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "22,563",
    "mObtainable_way": "The Manuka Flower was previously craftable with:\n-Orange Tulip Seed\n-Daffodil Seed\n- 10 Honey\nCraft Time: 10 minutes\nIt originally could’ve been earned from the Bizzy Bear's quest, it could’ve been obtained after making the following recipes:\n- 5 Honey, [0.33kg] [Pollinated] Carrot\n- 13 Honey, [15.4kg] [Pollinated] Dragon Fruit\n 23, [4kg] [Pollinated] Lilac\n- 33 Honey, [7.7kg] [Pollinated] Pin",
    "mTrivia": "",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 16,
    "mName": "Wild Carrot",
    "mNameIcon": "wildcarrot.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "- Summer Seed Pack 40%\n- Exotic Summer Seed Pack 39%\n- Rainbow Sack 30%",
    "mPrice_Rb": "N/A",
    "mSell_value": "22,563",
    "mObtainable_way": "The Wild Carrot seed can be obtained in the following ways:\n1. Opening any remaining Summer Seed Packs 40%\n2. Opening any remaining Exotic Summer Seed Packs 39%\n3. Rainbow Sack 30%",
    "mTrivia": "",
    "mShop": 3,
    "mNameShop": "Lucky Harvest",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 17,
    "mName": "Tomato",
    "mNameIcon": "tomato.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "800",
    "mPrice_Rb": "79",
    "mSell_value": "27 - 30",
    "mObtainable_way": "Tomato seed can be obtained by the following ways:\n\n1. Has a 100% chance to be in stock in the Seed Shop. A user can purchase a Tomato seed for 800 Sheckles or 79 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Tomato is a multi-harvest, rare crop.\n\nThe Tomato is classified as a Leafy, Vegetable and Summer type crop, meaning it will be affected by items targeted at those specific crop types.\n\nThis seed was still purchasable from the seed shop during the 2025 Summer Update.\n\nAppearance\nThe Tomato seed has a solid red color.\nThe Tomato crop has a green stem with smaller ones coming out of it.\nThe Tomato produce has a red sphere as its body, its studded and has a green stem.\n\nA Tomato crop can grow extremely tall and can reach up to an average Coconut tree or higher. When this happens, some Tomatoes may become inaccessible.\n\nThe taller the Tomato crop is, the more Tomato it can grow on a crop.\n\nIf a user sells a Tomato that weighs 7kg or greater, they will obtain the GIANT TOMATO badge. To get this badge easily, the player can use a variety of non-limited sprinklers, such as Grandmaster Sprinklers, Master Sprinklers, Godly Sprinklers, Advanced Sprinklers, or Basic Sprinklers.\n\nThe Mushroom Seed is the same as the Tomato Seed, but with added white spots.\nWhen fully grown, tomatoes produce at least two fruits at a time, depending on the crop's height.\n\nThe Tomato is the first rare seed in the Seed Shop.\n\nThe Tomato a sphere - shaped crop, while it's counterpart the Grand Tomato is cube-shaped\nThere is a secret seed which involved buying the Tomato seed with robux. That being Lemon.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 18,
    "mName": "Daffodil",
    "mNameIcon": "daffodil.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "1,000",
    "mPrice_Rb": "19",
    "mSell_value": "902 - 1000",
    "mObtainable_way": "Daffodil seed can be obtained in the following ways:\n\n1. Has a 14.29% (1 in 7) chance to be in stock in the Seed Shop. A user can purchase a seed for 1,000 Sheckles or 19 Roblux.\n2. Lucky Harvest.\n3. Snail, yield a seed when harvest.\n4. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Description\nThe Daffodil is a single-harvest, flower type, rare crop.\n\nAppearance\nThe Daffodil is characterized as having prominent, trumpet-shaped corona surrounded by six yellow petals and having green leaves that are linear and sword-like.\nThe Daffodil seed is green at the bottom, while fading to yellow at the top.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 19,
    "mName": "Cauliflower",
    "mNameIcon": "cauliflower.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "1,300",
    "mPrice_Rb": "135",
    "mSell_value": "45 - 50",
    "mObtainable_way": "Cauliflower seed was previously obtained in the following ways:\n\n1. Has a 33.3% (1 in 3) chance to be in stock in the Seed Shop. A user can purchase a seed for  1,300 Sheckles or 135 Roblux.\n\nThe Cauliflower seed can still be obtained in the following ways:\n\n1. Has a 33.3 (1 in 3) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 1,300 Sheckles or 135 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab",
    "mTrivia": "Overview\nThe Cauliflower is a multi-harvest, rare crop released during the Summer Harvest Event.\n\nAppearance\nThe Cauliflower seed is a gradient between white and green.\nThe Cauliflower crop has a randomized number (usually three to four) green leaves titled upwards and away from each other.\nThe Cauliflower produce has a spherical appearance with a thicker middle layer that is wrapped around the fruit.\n\nThe Cauliflower produce resembles that of the King Cabbage.\n\nDespite real world Cauliflower's growing in cool seasons, the Cauliflower plant is a Summer plant.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 20,
    "mName": "Raspberry",
    "mNameIcon": "raspberry.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "90 - 100",
    "mObtainable_way": "Raspberry seed can still be obtained in the following ways:\n\n1. Normal Seed Pack 14.2%\n2. Opening any remaining Basic Seed Packs 40%\n3. Rainbow Sack 40%",
    "mTrivia": "Overview\nThe Raspberry is a limited, multi-harvest, berry type, rare crop.\n\nAppearance\nThe Raspberry seed is a solid reddish-pink color.\nThe Raspberry crop is similar to the Blueberry, consisting of several dark green cubes and cuboids arranged to resemble a bush.\nThe Raspberry produce is characterized as having two reddish-pink square bodies joined with a brown stem.\nThe Raspberry is one of five bush-type crops in the game. The other ones being Blueberry, Serenity, Celestiberry and Rose, all growing 8 berries per yield.\n\nThis crop's rarity used to be mythical. It was changed to rare during the Angry Plant Event update.\n\nAfter the Angry Plant Event, the Raspberry can only be obtained in the Normal Seed Pack obtained in the Garden Guide.\n\nThe Raspberry produce shares the same model with the Celestiberry produce.\n\nIt is the only crop that has been obtainable in 2 different seed packs. (Normal Seed Pack, Basic Seed Pack)",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 21,
    "mName": "Foxglove",
    "mNameIcon": "foxglove.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "18,050 - 20,0000",
    "mObtainable_way": "The Foxglove seed can be obtained in the following ways:\n\n1. Flower Seed Packs 25%\n2. Opening any remaining Exotic Flower Seed Packs 25%\n3. Rainbow Sack 25%",
    "mTrivia": "Overview\nThe Foxglove is a limited-time, flower type, rare crop introduced during the Bizzy Bee Event in Grow a Garden.\n\nAppearance\nThe Foxglove has a green stem with tubular flowers on the top, having purple-pink hats standing out on the sides. Plant only produces one crop at a time.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 22,
    "mName": "Peace Lily",
    "mNameIcon": "peacelily.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "Craftable: \nRafflesia Seed\n+ Cauliflower Seed\n+ 3 Summer Coins",
    "mPrice_Rb": "129",
    "mSell_value": "18,050",
    "mObtainable_way": "The Peace Lily can be crafted with the following:\n1 Rafflesia Seed\n + 1 Cauliflower Seed\n+ 3 Summer Coins\nCraft time: 10 minutes\nAlternatively, it can be purchased for 129 Roblux.",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 23,
    "mName": "Paradise Petal",
    "mNameIcon": "paradisepetal.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": " 22,562 - 25,000",
    "mObtainable_way": "The Paradise Petal seed can be obtained in the following ways:\n\n1. Opening any remaining Ancient Seed Packs 25%\n2. Opening any remaining Exotic Ancient Seed Packs 25%\n3. Rainbow Sack 25%",
    "mTrivia": "Overview\nThe Paradise Petal is a rare, multi-harvest crop added in the prehistoric event Update.\n\nAppearance\nThe Paradise Petal is a medium sized plant with light pink colored leaves that point upwards. It has 5 stems, but only 4 produce their own flower. The stem looks similar to the Zenflares stem. Even though it looks like a flower, it's not typed as a flower in-game.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 24,
    "mName": "Candy Sunflower",
    "mNameIcon": "candysunflower.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "75,000",
    "mPrice_Rb": "279",
    "mSell_value": "72,200",
    "mObtainable_way": "The Candy Sunflower seed was previously obtained in the following ways:\n1. The Candy Sunflower seed could have been purchased from the 2025 Easter Event shop for 75,000 Sheckles or 279 Roblux.",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 25,
    "mName": "Corn",
    "mNameIcon": "corn.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "1,300",
    "mPrice_Rb": "135",
    "mSell_value": "36 - 40",
    "mObtainable_way": "Corn seed can be obtained in the following ways:\n\n1. Has a 17% chance to be in stock in the Seed Shop. A user can purchase a seed for 1300 Sheckles or 135 Roblux.\n2. Stolen by a Red Fox .\n3. Lucky Harvest.\n4. Snail, yield a seed when harvest.\n5. Rarely dug up by a Dog, Golden Lab or Shiba Inu.\n6. Obtained from Chris P. (Formerly)",
    "mTrivia": "Overview\nThe Corn is a multi-harvest rare crop. It produces 1 plant at a time. The Corn is classified as a Vegetable type crop, meaning it will be affected by items targeted at that specific crop type.\n\nAppearance\nThe Corn seed is a solid yellow color.\nThe Corn crop has a green stalk and a circular structure at the top where the corn grows.\nThe Corn produce has a yellow, spiked, cylinder shape.\n\nCorn was the only plant that wasn’t rereleased with the other Sam Shop seeds after the Summer Harvest Event but has since been readded.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 26,
    "mName": "Horsetail",
    "mNameIcon": "horsetail.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "199",
    "mSell_value": "27,075 - 30,000",
    "mObtainable_way": "The Horsetail Seed can be crafted with following materials:\n\n1x Daffodil Seed (Formerly, 1x Stonebite Seed)\n+ 1x Bamboo Crop\n+ 1x Corn Crop\n+ 15,000 Sheckles\nCraft Time: 15 Minutes.\n\nAlternatively, it can be purchased for 199 Roblux.",
    "mTrivia": "Overview\nThe Horsetail is a limited, single-harvest, rare crop obtainable from crafting. It is used to craft Amber Spine and Lingonberry seeds.\n\nAppearance\nThe Horsetail has a green bamboo like base with black lines. It has small green branches coming out of the base with smaller ones coming out of the branch.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 27,
    "mName": "Zenflare",
    "mNameIcon": "zenflare.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "6 Chi",
    "mPrice_Rb": "199",
    "mSell_value": "22,562",
    "mObtainable_way": "The Zenflare seed can be purchased for 6 Chi Sheckles or 199 Roblux from the Zen Shop.\nPlayers must grow the Zen Tree once to unlock it.",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\nThe Zenflare Seed image name on Roblox is Spider Lily Seed. The Zenflare Was/Is used for a method to get the Kitsune Chest from the Corrupted Zen Event",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 28,
    "mName": "Serenity",
    "mNameIcon": "serenity.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "22,562",
    "mObtainable_way": "Zen Seed Pack 25%\nExotic Zen Seed Pack 25%\nRainbow Sack 25%",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\nThe Zenflare Seed image name on Roblox is Spider Lily Seed. The Zenflare Was/Is used for a method to get the Kitsune Chest from the Corrupted Zen Event",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 29,
    "mName": "Mint",
    "mNameIcon": "mint.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "4,738",
    "mObtainable_way": "The Mint seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Packs 15%\n2. Opening any remaining Premium Night Seed Packs 22%",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 30,
    "mName": "Glowshroom",
    "mNameIcon": "glowshroom.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed Chance:\n- Night Seed Pack 20%\n- Premium Night Seed Pack 30%",
    "mPrice_Rb": "N/A",
    "mSell_value": "271",
    "mObtainable_way": "The Glowshroom seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Packs 20%\n2. Opening any remaining Premium Night Seed Packs 30%",
    "mTrivia": "- Shocked Glowshrooms do not look significantly different at all compared to a regular Mushroom.\n- The Glowshroom is very similar to Lilac, as they both have a base plant that grows their fruits around them.\n- The main Glowshroom has a small chance of growing a larger or same sized Glowshroom. These have the chance to then become its own \"parent\" Glowshroom, growing more around it.\n- The Glowshroom is considered a \"Night type fruit\" as it was obtainable in the Lunar Glow Event.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 31,
    "mName": "Dandelion",
    "mNameIcon": "dandelion.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Bamboo 2x\n + Manuka Flower Seed\n+ 20 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "45,125",
    "mObtainable_way": "The Dandelion can be obtained from Bizzy Bear's quest, it can be obtained after making the following recipes:\n- 7 Honey, [3.6kg] [Pollinated] Apple\n- 13 Honey, [17.8kg] [Pollinated] Coconut\n- 33 Honey, [24.6kg] [HoneyGlazed] Mango\nIn total, the player can obtain 11 Dandelion seeds per quest-cycle.\nThe Dandelion can be crafted with:\n2 Bamboo\n + 1 Manuka Flower Seed + 20 Honey\nCraft time: 16 minutes\n\nIt can also be obtained with Robux.",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 32,
    "mName": "Nectarshade",
    "mNameIcon": "nectarshade.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "5 Honey",
    "mPrice_Rb": "139",
    "mSell_value": "45,125",
    "mObtainable_way": "The Nectarshade seed was previously obtained in the following ways\n1. The Nectarshade seed could be bought for 5 Honey or 139 Roblux from the Queen Bee's shop.",
    "mTrivia": "- The picture of the Nectarshade seed appears green in the Event Shop, but it has a brown to orange gradient in-game.\n- The Nectarshade seed resembles the Cacao seed, having a light color scheme then the Cacao.\n- The Nectarshade initially didn't exist in the Bizzy Bee Event; this is because it was later added in the update expansion on June 7th.\n- Nectarshades are much smaller than they may look.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 33,
    "mName": "Succulent",
    "mNameIcon": "succulent.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "Seed Chance:\n- Crafters Seed Pack 25%\n- Exotic Crafters Seed Pack 25%\n- Rainbow Sack 25%\nPrice: Crafted for 1 Flower Seed Pack and 10 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "22,563",
    "mObtainable_way": "The Succulent seed can be obtained in the following ways:\n1.Opening any remaining Crafters Seed Pack 25%\n2. Opening any remaining Exotic Crafters Seed Pack 25%\n3. Rainbow Sack 25%",
    "mTrivia": "- The Succulent was an exclusive admin plant, the other being the Mega Mushroom, but it was obtainable for players in Update 1.10.0.\n- The Succulent crop takes 10 minutes to grow.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 34,
    "mName": "Bee Balm",
    "mNameIcon": "beebalm.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "1x Crocus + 1x Lavender + 10 Honey",
    "mPrice_Rb": "179",
    "mSell_value": "16,245",
    "mObtainable_way": "The Bee Balm can be crafted with\n 1 Crocus\n1 Lavender\n 10\n15 minutes\nIt can also be purchased for 179 Roblux.",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 35,
    "mName": "Pear",
    "mNameIcon": "pear.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed Chance: - Summer Seed Pack 25%\n- Exotic Summer Seed Pack 25%\n- Rainbow Sack 25%",
    "mPrice_Rb": "N/A",
    "mSell_value": "18,050",
    "mObtainable_way": "The Pear seed was previously obtained in the following ways:\n1. Normal Seed Pack\nThe Pear seed can still be obtained in the following ways:\n1. Summer Seed Pack 25%\n2. Exotic Summer Seed Pack 25%\n3. Rainbow Sack 25%",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 36,
    "mName": "Delphinium",
    "mNameIcon": "delphinium.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "2 Summer Coins",
    "mPrice_Rb": "99",
    "mSell_value": "21,660",
    "mObtainable_way": "The Delphinium seed was previously obtained in the following ways:\nPurchased for 2 Summer Coins or 99 Roblux from the Summer Harvest Shop.",
    "mTrivia": "",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 37,
    "mName": "Liberty Lily",
    "mNameIcon": "libertylily.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "650,000",
    "mPrice_Rb": "519",
    "mSell_value": "27,075",
    "mObtainable_way": "The Liberty Lily can be purchased for 650,000 Sheckles or 519 Roblux from the 4th of July Merchant that spawns next to the seed shop.",
    "mTrivia": "When a Liberty Lily finishes growing, a firework sound will go off, equivalent to the sound a firework makes.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 38,
    "mName": "Watermelon",
    "mNameIcon": "watermelon.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "2,500",
    "mPrice_Rb": "195",
    "mSell_value": "2,708 - 3,000",
    "mObtainable_way": "A Watermelon seed can be obtained by the following ways:\n\n1. Has a 13% chance to be in stock in the Seed Shop. A user can purchase a seed for 2,500 Sheckles or 195 Roblux.\n2. Normal Seed Pack\n3. Lucky Harvest\n4. Stolen by a Red Fox\n5. Snail yield a seed when harvest\n6. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nWatermelon is a single-harvest, legendary crop.\n\nThe Watermelon is categorized as a Sweet, Tropical, Leafy, Summer type Fruit.\n\nAppearance\nThe Watermelon produce is characterized as having a square body with alternating dark and light green stripes, closely resembling the Pumpkin, but green and without a stem at the top.\nThe Watermelon crop is the same as the produce, but with a stem.\nThe Watermelon seed is a solid green color.\n\nIf a user plants a total of 50 Watermelons, the user will obtain the MELON MADNESS badge.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-6",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 39,
    "mName": "Pumpkin",
    "mNameIcon": "pumpkin.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "3,000",
    "mPrice_Rb": "210",
    "mSell_value": "3,069 - 3,400",
    "mObtainable_way": "Pumpkin can be obtained in the following ways:\n\n1. Has a 10% (1 in 10) chance to be in stock in the Seed Shop. A user can purchase a seed for 3,000 Sheckles or 210 Roblux.\n2. Normal Seed Pack.\n3. Lucky Harvest.\n4. Stolen by a Red Fox.\n5. Snail, yield a seed when harvest.\n6. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Pumpkin is a single-harvest, legendary crop. It is obtainable via the Seed Shop.\n\nAppearance\nThe Pumpkin produce is characterized as an orange square body and a large green stem.\nThe Pumpkin crop is the same as its produce, but with a stem.\nThe Pumpkin seed is a solid orange-yellow color.\nThe Pumpkin seed is similar to the Loquat, Sunflower, Mango and Pineapple.\n\nFor a while, there was a glitch where Pumpkins were not coming in stock. It got to the point Jandel had to manually restock it.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 40,
    "mName": "Avocado",
    "mNameIcon": "avocado.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "5,000",
    "mPrice_Rb": "419",
    "mSell_value": "316 - 350",
    "mObtainable_way": "The Avocado seed was previously obtained in the following ways:\n\n1. Has a 2.5% (1 in 40) chance to be in stock in the Seed Shop. A user can purchase a seed for 5,000 Sheckles or 419 Roblux.\nThe Avocado seed can still be obtained in the following ways:\n\n1. Has a 2.5% (1 in 40) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 5,000 Sheckles or 419 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab",
    "mTrivia": "Overview\nThe Avocado is a multi-harvest, legendary crop added during the Summer Harvest Event.\n\nAppearance\nThe seed is a solid lime green with a brown square representing the pit.\nThe crop is a tall, slender, greenish-brown tree. It begins with a short, wide base that forks into two branches, both sparsely leafy.\nThe produce look like egg-shaped fruits with layers with darker layers at the bottom and lighter layers at the top, making a green gradient",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 41,
    "mName": "Green Apple",
    "mNameIcon": "greenapple.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "3,500",
    "mPrice_Rb": "399",
    "mSell_value": "271 - 300",
    "mObtainable_way": "The Green Apple seed was previously obtained in the following ways:\n\n1. Has a 5% (1 in 20) chance to be in stock in the Seed Shop. A user can purchase a seed for 3,500 Sheckles or 399 Roblux.\nThe Green Apple seed can still be obtained in the following ways:\n\n1. Has a 5% chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 3,000 Sheckles or 399 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Shiba Inu or Golden Lab",
    "mTrivia": "Overview\nThe Green Apple is a Legendary, multi-harvest crop.\n\nAppearance\nThe Green Apple seed is a solid lime color.\nThe Green Apple tree is similar to the Apple tree but is higher, and takes on a more bush-like feature, rather than the Pointed Leave shapeApple does.\nThe Green Apple produce is similar to the Apple but green.\n\nThe Green Apple is the third apple-like plant to be added to the game. (the others being the Apple and the Sugar Apple).\n\nWhen on it's tree, the Green Apple has the Roblox Weld texture. But when it's picked up, it has the basic Roblox Stud texture",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 42,
    "mName": "Apple",
    "mNameIcon": "apple.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "3,250",
    "mPrice_Rb": "375",
    "mSell_value": "248 - 275",
    "mObtainable_way": "The Apple seed can be obtained in the following ways:\n\n1. Has a 17% chance to be in stock in the Seed Shop. A user can purchase a seed for 3,250 Sheckles or 375 Roblux.\n2. Stolen by a Red Fox\n3. Snail, yield a seed when harvest\n4. Rarely dug up by a Dog, Golden Lab or Shiba Inu\n5. Lucky Harvest\n6. A small chance to appear in the Forever Pack.\n7. Can be bought from the Starter Pack for 99 Roblux (Was once 1,000 Roblux.) (Only obtainable for 10 minutes after playing the game for the first time.)",
    "mTrivia": "Overview\nThe Apple is a multi-harvest, legendary crop.\n\nIt can yield 5 to 8 fruits per plant.\n\nAppearance\nThe Apple seed has a bright red-green gradient, beginning with red at the base and fading to green at the top.\nThe Apple crop has a square trunk leading to a tiers of square leaves that taper upwards, each layer smaller than the one below it.\nThe Apple produce has a square-shaped, red with a brown stem and a small leaf on top.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 43,
    "mName": "Banana",
    "mNameIcon": "banana.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "7,000",
    "mPrice_Rb": "459",
    "mSell_value": "1,579 - 1,750",
    "mObtainable_way": "Banana seed was previously obtained in the following ways:\n\n1. Has a 2.5% (1/40) chance to be in stock in the Seed Shop. A user can purchase a seed for 7,000 Sheckles or 459 Roblux.\n2. 38% chance in the Exotic Seed Pack.\n\nBanana seed can still be obtained in the following ways:\n\n1. Has a 2.5% (1/40) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 7,000 Sheckles or 459 Roblux\n2. Opening any remaining Exotic Seed Packs 38%",
    "mTrivia": "Overview\nThe Banana is a legendary, multi-harvest crop.\n\nThe Banana was added during the 2025 Easter Event, as a mythical plant, obtainable through the Exotic Seed Pack. It was reintroduced in the Seed Shop, as a legendary plant, for the Summer Harvest Event.\n\nAppearance\nThe Banana seed has a yellow-brown gradient. Beginning with yellow at the base and fading upwards to brown.\nThe Banana plant has a three-tiered brown trunk, with each tier being smaller than the last. Where the trunk ends, green leaf stems sprout, flattening into broad leaves of a constant width. It produces up to five fruits per harvest.\nThe Banana produce resembles its real-life counterpart, only being square in comparison.\n\nBanana is the one of several crops to ever get a tier downgrade. The others are Raspberry, Daffodil, and Moon Mango.\n\nBanana is currently the only fruit to ever have been in a limited seed pack then becoming a seed shop item.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 44,
    "mName": "Lilac",
    "mNameIcon": "lilac.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "10 Honey",
    "mPrice_Rb": "199",
    "mSell_value": "31,588 - 35,000",
    "mObtainable_way": "The Lilac seed can be obtained in the following ways:\n\n1. Flower Seed Packs 20%\n2. Opening any remaining Exotic Flower Seed Packs 20%\n3. Rainbow Sack 20%",
    "mTrivia": "Overview\nThe Lilac is a limited, multi-harvest, flower type, legendary crop introduced during the Bizzy Bee Event.\n\nThe Lilac yields 6 fruit.\n\nAppearance\nThe Lilac has a long-green stem with pink flowers growing out of the stem.\n\nThe Lilac grows in a very similar way to a Glowshroom, with smaller off-spring growing around it.\n\nThe Lilac is a slow growing crop.\n\nThe Giant Ant gains more hunger points when fed Lilac, as opposed to other fruit.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 45,
    "mName": "Taro Flower",
    "mNameIcon": "taroflower.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "108,300 - 120,000",
    "mObtainable_way": "The Taro Flower seed can be obtained in the following ways:\n\n1. Zen Seed Pack 20%\n2. Exotic Zen Seed Pack 20%\n3. Rainbow Sack 20%",
    "mTrivia": "Overview\nThe Taro Flower is a limited, single harvest, legendary crop.\n\nAppearance\nThe Flower top is akin to a Mixture of Pink Lily & Paradise Petal with the bottom having the Horned Dinoshroom's stem color. The seed is a basic white seed with 4 of the Taro Flower's petals on the top of it. They are much noticeably smaller. Interestingly, when holding the seed, the petals are upside-down.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 46,
    "mName": "Bamboo",
    "mNameIcon": "bamboo.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "4,000",
    "mPrice_Rb": "99",
    "mSell_value": "3,610 - 4,000",
    "mObtainable_way": "1. The Bamboo has a 20% chance to be in stock in the Seed Shop. A user can purchase a seed for 4,000 Sheckles or 99 Roblux.\n2. Lucky Harvest\n3. Snail, yield a seed when harvest\n4. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nBamboo is a single-harvest, stalky, legendary crop obtainable from the Seed Shop\n\nAppearance\nThe Bamboo seed is a solid bright green.\nThe Bamboo produce is a tall, square, slender bright green plant separated into node sections with sparse small leaves.\n\nThe Bamboo is the most common legendary seed found in Sam's Shop, it's highest being 20 bamboo per stock reset.\n\nThe Bamboo is the first Bamboo-type crop to be added into the game.\n\nThe Bamboo has an invisible truss that allows the player to climb on it, making it a viable way to reach tall plants. However, overgrown Bamboo can not be climbed on as the Bamboo grows over the truss.\n\nIf mutated, there is a small chance the invisible truss becomes visible.\n\nCurrently there is a glitch with favorited Shocked Bamboo, as it does not appear shocked unless unfavorited.\n\nThe bamboos that appear in the Zen Event place does not have the invisible truss.\n\nThe Bamboo has 4 different varieties, those being the Bendboo, Boneboo, Zen Rocks, and Lucky Bamboo.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },

  {
    "mId": 47,
    "mName": "Aloe Vera",
    "mNameIcon": "aloevera.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "Craftable with\n + Peace Lily Seed\n + Prickly Pear\n+ 18 Summer Coins",
    "mPrice_Rb": "299",
    "mSell_value": "62,272",
    "mObtainable_way": "Aloe Vera can be crafted with the following:\n+ 1 Peace Lily Seed\n+ 1 Prickly Pear\n+ 18 Summer Coins\n+ Crafting Time: 10 minutes or can be purchased for 299 Roblux.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 48,
    "mName": "Rafflesia",
    "mNameIcon": "rafflesia.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "3,200",
    "mPrice_Rb": "215",
    "mSell_value": "3,159 - 3,500",
    "mObtainable_way": "Rafflesia seed was previously obtained in the following ways:\n\n1. Has a 10% (1/10) chance to be in stock in the Seed Shop. A user can purchase a seed for 3,200 Sheckles or 215 Roblux.\n\nThe Rafflesia can be obtained in the following ways:\n\n1. Has a 10% (1/10) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 3,200 Sheckles or 215 Roblux.\n2. Lucky Harvest.\n3. Snail, yield a seed when harvest.\n4. Rarely dug up by a Dog, Shiba Inu, or Golden Lab.",
    "mTrivia": "Overview\nThe Rafflesia is an obtainable, single-harvest, released legendary crop, from the Mega Harvest update.\n\nAppearance\nIt is a red/brown flower-like plant with details on the edges and a yellow interior. It has five sections, like a pentagon. The plant’s seed is the same brown-ish color as the flower, with a pale yellow stem emerging from the top.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 49,
    "mName": "Lingonberry",
    "mNameIcon": "lingonberry.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "209",
    "mSell_value": "31,588 - 35,000",
    "mObtainable_way": "The Lingonberry Seed can be crafted with following materials:\n\n3x Blueberry Seed\n+ 1x Horsetail Crop\n+ 450,000 Sheckles\nCraft Time: 15 Minutes\n\nAlternatively, it can be purchased for  209.",
    "mTrivia": "Overview\nThe Lingonberry is a limited, multi-harvest, legendary crop.\n\nAppearance\nThe appearance of a Lingonberry is similar to the grape, but it's pink instead of purple. On top of the Lingonberry, there is a large leaf.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 50,
    "mName": "Soft Sunshine",
    "mNameIcon": "softsunshine.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "20 Chi",
    "mPrice_Rb": "659",
    "mSell_value": "40,612",
    "mObtainable_way": "The Soft Sunshine seed is currently obtained by:\nPurchasing it for 20 Chi Coins or 659 Roblux in the Zen Shop.",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\nThe Soft Sunshine is the third plant that can be bought from the Zen Shop.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 51,
    "mName": "Sakura Bush",
    "mNameIcon": "sakurabush.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "14 Chi",
    "mPrice_Rb": "489",
    "mSell_value": "25,789",
    "mObtainable_way": "The Sakura Bush was previously obtainable from the Tranquil Treasures Shop for 14 Chi Coins. It was also obtainable for 489 Roblux.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 52,
    "mName": "Lucky Bamboo",
    "mNameIcon": "luckybamboo.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "58,662 - 65,000",
    "mObtainable_way": "The Lucky Bamboo crop is obtained by opening a Kitsune Chest or the Exotic Kitsune Chest both with a 14.5% chance.",
    "mTrivia": "Overview\nThe Lucky Bamboo is a limited, multi-harvest, legendary crop, added in the corrupted Zen Event.\n\nAppearance\nThe appearance of a Lucky Bamboo is a thicker version of the regular Bamboo with a leaf on-top. The crop/plant has two central stalks surrounded by big, green leaves.\n\nLucky Bamboo is one of the 4th Bamboo-type other than Bamboo, Bendboo, and Boneboo.\n\nLucky Bamboo is the first Bamboo type that is Multi-Harvest, giving 2 - 4 per yield.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 53,
    "mName": "Enkaku",
    "mNameIcon": "enkaku.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "55,955",
    "mObtainable_way": "Players can obtain the Enkaku from the Corrupted Rewards after given the requirement to the Corrupted Zen Channeler in the Corrupted Event with 4.35% chance of being dropped.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 54,
    "mName": "Horned Dinoshroom",
    "mNameIcon": "horneddinoshroom.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "62,272",
    "mObtainable_way": "The Horned Dinoshroom seed can be obtained in the following ways:\n1. Ancient Seed Pack 20%\n2. Exotic Ancient Seed Pack 20%\n3. Rainbow Sack 20%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 55,
    "mName": "Boneboo",
    "mNameIcon": "boneboo.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "141,141",
    "mObtainable_way": "The Boneboo seed can be obtained in the following ways:\n1. Ancient Seed Pack 10%\n2. Exotic Ancient Seed Pack 10%\n3. Rainbow Sack 10%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 56,
    "mName": "Cranberry",
    "mNameIcon": "cranberry.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "Seed Chance:\n- Basic Seed Pack 30%\n- Premium Seed Pack 45%\n- Rainbow Sack 30%",
    "mPrice_Rb": "N/A",
    "mSell_value": "3,159",
    "mObtainable_way": "- Cranberries are the only berry not boosted by the Berry Blusher Sprinkler\n- The cranberry shares the same model as the Loquat. The only difference is the loquat being yellow.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 57,
    "mName": "Durian",
    "mNameIcon": "durian.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed Chance:\n- Basic Seed Pack 21%\n- Premium Seed Pack 35%\n- Rainbow Sack 21%",
    "mPrice_Rb": "N/A",
    "mSell_value": "6,769",
    "mObtainable_way": "The Durian seed could be obtained in the following ways:\n1. Opening any remaining Basic Seed Packs 21%\n2. Opening any remaining Premium Seed Packs 35%\n3. Rainbow Sack 21%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 58,
    "mName": "Papaya",
    "mNameIcon": "papaya.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed Chance:\nExotic Seed Pack 40%",
    "mPrice_Rb": "N/A",
    "mSell_value": "903",
    "mObtainable_way": "The Papaya seed can be obtained from the following ways:\n1. Opening any remaining Exotic Seed Packs 40%",
    "mTrivia": "- There is currently a glitch/visual bug with the Papaya fruit being consistently the same size even if the fruit is overgrown.\n- The Papaya is boosted by the Spice Spritzer Sprinkler.\nIt is also the only plant from the Exotic Seed Pack to be boosted by one of the craftable sprinklers.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 59,
    "mName": "Moonflower",
    "mNameIcon": "moonflower.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n- Night Seed Pack 10%\n- Premium Night Seed Pack 18%",
    "mPrice_Rb": "N/A",
    "mSell_value": "8,574",
    "mObtainable_way": "The Moonflower seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Pack 10%\n2. Opening any remaining Premium Night Seed Pack 18%",
    "mTrivia": "- The Moonflower may be used as a ladder, similar to Tomato and Bamboo.\n- The Moonflower is considered a 2 trait plant (Flower/Night type fruit), which makes the plant be able to receive buffs from the Flower Froster Sprinkler",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 60,
    "mName": "Starfruit",
    "mNameIcon": "starfruit.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "13,538",
    "mObtainable_way": "The Starfruit seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Pack 9.5%\n2. Opening any remaining Premium Night Seed Pack 15.5%",
    "mTrivia": "Despite being legendary, starfruit compares with divines, like Pepper and Cacao.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 61,
    "mName": "Lumira",
    "mNameIcon": "lumira.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "2x Pumpkin + Dandelion Seed + Flower Seed Pack + 40 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "76,713",
    "mObtainable_way": "The Lumira can be crafted with:\n2 Pumpkins\n + 1 Dandelion Seed\n+ 1 Flower Seed Pack\n+ 40 Roblux\nCraft time: 20 minutes\nAlternatively, it can be purchased for Robux",
    "mTrivia": "- The top of the Lumira seed has a slight glow.\n- Lumira, Moonglow, and Firefly Fern are the only plants that feature a glow.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 62,
    "mName": "Violet Corn",
    "mNameIcon": "violetcorn.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "- Crafters Seed Pack 20%\n- Exotic Crafters Seed Pack 20%\n- Rainbow Sack 20%",
    "mPrice_Rb": "N/A",
    "mSell_value": "45,125",
    "mObtainable_way": "The Violet Corn seed can be obtained in the following ways:\n1. Crafters Seed Pack 20%\n2. Exotic Crafters Seed Pack 20%\n3. Rainbow Sack 20%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 63,
    "mName": "Nectar Thorn",
    "mNameIcon": "nectarthorn.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "2x Cactus + 1x Cactus Seed + 1x Nectarshade Seed + 20 Honey",
    "mPrice_Rb": "659",
    "mSell_value": "40,111",
    "mObtainable_way": "The Nectar Thorn can be crafted with:\n+ 2 Cactus\n+ 1 Cactus Seed\n+ 1 Nectarshade Seed\n+ 20 Honey\nCraft time: 30 minutes\n\nIt can also be purchased for 659 Roblux.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 64,
    "mName": "Nectar Thorn",
    "mNameIcon": "nectarthorn.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "2x Cactus + 1x Cactus Seed + 1x Nectarshade Seed + 20 Honey",
    "mPrice_Rb": "659",
    "mSell_value": "40,111",
    "mObtainable_way": "The Nectar Thorn can be crafted with:\n+ 2 Cactus\n+ 1 Cactus Seed\n+ 1 Nectarshade Seed\n+ 20 Honey\nCraft time: 30 minutes\n\nIt can also be purchased for 659 Roblux.",
    "mTrivia": "- This crop has a unique feature, where its fruits are hexagonal.\n- When fully grown, the plant produces up to four fruits, having two on each branch\n- Pairing with 8 Blood Hedgehog and Sprinkler Method, It can Produce over 100kg and High chance of being Gold and Rainbow Variant. Unfortunately, after the Summer Update this was patch by nerfing the Blood Hedgehog's Passive.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 65,
    "mName": "Cantaloupe",
    "mNameIcon": "cantaloupe.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n20% Summer Seed Pack\n20% Exotic Summer Seed Pack\n20% Rainbow Sack",
    "mPrice_Rb": "N/A",
    "mSell_value": "30,685",
    "mObtainable_way": "The Cantaloupe seed can be obtained in the following ways:\n1. Summer Seed Pack 20%\n2. Exotic Summer Seed Pack 20%\n3. Rainbow Sack 20%",
    "mTrivia": "- This crop has a unique feature, where its fruits are hexagonal.\n- When fully grown, the plant produces up to four fruits, having two on each branch\n- Pairing with 8 Blood Hedgehog and Sprinkler Method, It can Produce over 100kg and High chance of being Gold and Rainbow Variant. Unfortunately, after the Summer Update this was patch by nerfing the Blood Hedgehog's Passive.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 66,
    "mName": "Peach",
    "mNameIcon": "peach.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "271 - 300",
    "mObtainable_way": "A Peach seed was able to be obtained from the Normal Seed Pack from the Daily Quests at a 14.2% chance. The quests have now been removed from the Gear Shop as of the Beanstalk Event. However, the peach remains obtainable from daily quests through the garden guide.",
    "mTrivia": "Description\nThe Peach is an exclusive, multi-harvest, mythical crop.\n\nAppearance\nThe Peach seed is a solid peach color.\nThe Peach crop is a tree with a brown trunk and multiple light green cubes making up the leaves.\nThe Peach crop is also visually similar to the Mango and Moon Mango trees.\nThe Peach produce is characterized as an orange-pink, round to slightly flattened body with a leaf stem on the top of the fruit.\nThe Peach also looks like the center part of the Bone Blossom, but remodeled.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 67,
    "mName": "Pineapple",
    "mNameIcon": "pineapple.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "7,500",
    "mPrice_Rb": "475",
    "mSell_value": "1,805 - 2,000",
    "mObtainable_way": "Pineapple seeds were previously obtained in the following ways:\n\n1. Has a 2.5% (1/40) chance to be in stock in the Seed Shop. A user can purchase a seed for 7,500 Sheckles or 475 Roblux.\n\nPineapple seeds can now be obtained in the following ways:\n\n1. Has a 2.5% (1/40) chance to be in the Summer Traveling Merchant stock. A user can purchase a seed for 7,500 Sheckles or 475 Roblux.\n2. Lucky Harvest.\n3. Normal Seed Pack.\n4. Stolen by a Red Fox.\n5. Snail, yield a seed when harvest.\n6. Rarely dug up by a Dog, Shiba Inu, or Golden Lab.",
    "mTrivia": "Overview\nThe Pineapple is an exclusive, multi-harvest, mythical crop, added in the 1.01.0 update.\n\nThe Pineapple is classified as a Prickly, Tropical, Leafy, Sweet, Summer type Fruit, meaning it will be affected by items targeted at those specific crop types.\n\nAppearance\nThe Pineapple is characterized as having a yellow body with a green, leafy crown at the top of the produce.\n\nThe Pineapple, along with the Pear, was exclusive to the Normal Seed Pack but became available through the Seed Shop after the Summer Harvest update.\n\nThe Pineapple seed is visually identical to the Pumpkin, Loquat, Sunflower and Mango seeds.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 68,
    "mName": "Amber Spine",
    "mNameIcon": "amberspine.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "625",
    "mSell_value": "49,638 - 55,000",
    "mObtainable_way": "The Amber Spine Seed can be crafted with the following materials:\n\n1x Cactus Seed\n+ 1x Pumpkin Crop\n+ 1x Horsetail Crop\n+ 650,000 Sheckles\nCraft Time: 30 Minutes\n\nAlternatively, it can be purchased for 625 Roblux.",
    "mTrivia": "Overview\nThe Amber Spine is a multi-harvest, mythical crop added during the second week of the Prehistoric Event. It is obtainable by Crafting.\n\nAppearance\nThe Amber Spine seed is light beige with three peach-colored bones sticking out of its side, resembling a spine.\n\nThe produce can be described as a lighter colored cube covered in an orange amber.\n\nThe crop shares a similar design to the seed, as the crop features several long, curvy, light beige spines with several peach-colored bones sticking out of the sides. The ends of the spines are the growing point of the produce.\n\nThe Amber Spine's produce has a similar look to Lumira's produce, except it has a transparent glass material and is a darkish orange.\n\nThe Amber Spine's crop/plant represents a human's Spinal cord.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 69,
    "mName": "Guanabana",
    "mNameIcon": "guanabana.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "779",
    "mSell_value": "65,431",
    "mObtainable_way": "The Guanabana is obtainable through crafting at the Seed Crafting Table at the back of the map.\nThe Guanabana is crafted with:\n1 Aloe Vera seed\n + 1 Prickly Pear seed\n + 1 Banana\n + 30 Summer Sheckles\nCraft Time: 10 minutes\n\nThis crafting time can also be skipped with 779 Roblux.",
    "mTrivia": "- Even if there is a Guanabana smaller than 3.8kg, its price will still be 63,626 Sheckles.\n- The Guanabana seed shares the same model with the Prickly Pear seed, the only difference being the color.\n- The Guanabana is based on the soursop in real life, which is known as the guanábana in Latin America.\nEven though guanabana is considered a prickly fruit, it is not affected by hedgehogs.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 70,
    "mName": "Coconut",
    "mNameIcon": "coconut.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "6,000",
    "mPrice_Rb": "435",
    "mSell_value": "361 - 400",
    "mObtainable_way": "The Coconut seed can be obtained in the following ways:\n\n1. Has a 2% (1/50) chance to be in stock in the Seed Shop. A user can purchase a seed for 6,000 Sheckles or 597 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvested\n5. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Coconut is a multi-harvest, mythical crop. It was removed from the Seed Shop in the Summer Harvest Event, and was brought back in the the Prehistoric Event.\n\nAppearance\nThe Coconut produce is characterized as being a dark-brown colored sphere with three dark holes on it and has the studs texture on it.\nThe Coconut crop has a trunk that is thick at the bottom but goes thinner at the top. At the tip it has 5-7 light-green leaves which grow 4 coconuts each.\nThe Coconut seed is a solid white color.\n\nA Coconut crop's growth time can take 6 to 15 hours. This is the slowest plant in the game to grow, where 2nd and 3rd are Cocovine and Guanabana respectively.\n\nThere is a glitch where sometimes 2 coconuts can grow in the same space.\n\nCoconuts have a base size of roughly 10kg, making them ideal candidates for Pollination during the Bizzy Bee Event.\n\nThere is a visual bug involving the coconut crops, where if the player rejoins the game, all of their coconuts are set to one specific size. However, this does not change their size upon harvest.\n\nWhen a coconut is shocked, it loses the black spots. It also does not glow.\nIn the earlier days of Grow a Garden, the Coconut was the most valuable plant and costed 4,750 Sheckles.",
    "mShop": 2,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 71,
    "mName": "Cactus",
    "mNameIcon": "cactus.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "15,000",
    "mPrice_Rb": "497",
    "mSell_value": "3,068 - 3,400",
    "mObtainable_way": "The Cactus seed can be obtained in the following ways:\n\n1. A Cactus seed has a 3.33% chance (1/30) to be in stock in the Seed Shop. A user can purchase a seed for 15,000 Sheckles or 497 Roblux\n2. Normal Seed Pack\n3. Lucky Harvest\n4. Stolen by a Red Fox\n5. Snail, yield a seed when harvested\n6. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Cactus is a multi-harvest, mythical crop.\n\nCactus is classified as Prickly Fruit, so they gain the buff from the Hedgehog and Blood Hedgehog pet.\n\nAppearance\nThe Cactus seed is a solid green color similar to the Venus Fly Trap seed.\nThe Cactus crop is in a green cylindrical shape with other segments coming out of the base. It has spines along the crop.\nThe Cactus produce is a square green body with black spikes and a red flower on its top.\nThe Cactus crops are all different, each having more or less limbs/segments than the other, some can have 2, and others can have up to 4 or more.\nBecause each limb carries one fruit, the more limbs a cactus has, the more fruit the whole crop can yield.\n\nThe Cactus crop generally grows taller than a user's avatar.\n\nFeeding equation: 7572.12 * 1.035WEIGHT (KG) (points: 24.83kg/17 830 HGR and 112.36kg/364 990 HGR)\nThe spikes on the Cactus don't scale with KG, they are merely cosmetic. Nevertheless, the flower on its top scales with KG.\n\nThe Cactus is the first and only Mythical Seed in the seed shop to come in multiple amounts when it is in stock despite being a multi harvest instead of a single harvest seed.",
    "mShop": 3,
    "mNameShop": "Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 72,
    "mName": "Dragon Fruit",
    "mNameIcon": "dragonfruit.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "50,000",
    "mPrice_Rb": "597",
    "mSell_value": "4,287 - 4,750",
    "mObtainable_way": "Dragon Fruit seed can be obtained in the following ways:\n\n1. Has a 2% (1/50) chance to be in stock in the Seed Shop. A user can purchase a Dragon Fruit seed for 50,000 Sheckles or 597 Roblux.\n2. Normal Seed Pack\n3. Lucky Harvest\n4. Stolen by a Red Fox\n5. Snail, yield a seed when harvest\n6. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Dragon Fruit is a multi-harvest, mythical crop in Grow a Garden.\n\nThe Dragon Fruit is classified as a Prickly, Tropical type Fruit.\n\nAppearance\nThe Dragon Fruit seed is a gradient from pink to green.\nThe Dragon Fruit crop is a tree with a brown cylinder base and leaves in an upside down cup shape around the base.\nThe Dragon Fruit produce is characterized as a pink, square body with spiky leaves sticking out on each side. It has a green stem up top with the same color as the leaves.\n\nThe Dragon Fruit tree is climbable, similar to the Bamboo.",
    "mShop": 3,
    "mNameShop": "Normal Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 73,
    "mName": "Mango",
    "mNameIcon": "mango.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "100,000",
    "mPrice_Rb": "580",
    "mSell_value": "5,866 - 6,500",
    "mObtainable_way": "The Mango seed can be obtained in the following ways:\n\n1. Has a 1% (1/100) chance to be in stock in Seed Shop. Players can purchase a seed for 100,000 Sheckles or 580 Roblux.\n2. Lucky Harvest.\n3. Normal Seed Pack.\n4. Stolen by a Red Fox.\n5. Snail, yield a seed when harvested.\n6. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "General\nThe Mango is a multi-harvest, mythical crop. It is obtainable, due to the Prehistoric Event reverting changes to the Seed Shop.\n\nAppearance\nA Mango produce is characterized as a red-yellow gradient object with a stick connected to a green leaf covering the upper part of the produce.\nThe Mango crop has a trunk with multiple branches, all of them a brownish color. It also features cubes of leaves which range in color from red to yellow and orange.\n\nThe Mango seed is a solid orange-yellow color.\nA Mango crop takes about eight minutes to fully grow and produces a mango every two minutes.\n\nThe Mango is one of few plants to have counter parts, being the Moon Mango, and Spiked Mango.\n\nMango's tree is not static, being the only crop with this feature. It can be due to a mistake.\nThe Mango seed is extremely similar to the Loquat seed. It is also similar to the Sunflower, Pumpkin, Pineapple and Hive Fruit seeds.\n\nThe Mango was restocked 4 times during the Travis Kelce admin abuse and is the 4th mythical crop in the seed shop.\n\nThe Mango has a lower robux price than the Dragon Fruit, although having a higher sheckle price.\n\nDuring the initial release of the first version of Grow a Garden on March 26, 2025, the Mango seed was the rarest seed to buy in the Seed Shop.\n\nWhen the Mango is still in it's growth stage. It can have solid leaves although when fully grown it loses it's solidity.",
    "mShop": 1,
    "mNameShop": "Summer Harvest",
    "mStock": "1-25",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 74,
    "mName": "Kiwi",
    "mNameIcon": "kiwi.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "10,000",
    "mPrice_Rb": "529",
    "mSell_value": "2,482 - 2,750",
    "mObtainable_way": "The Kiwi seed was previously obtained in the following ways:\n\n1. Has a 2.5% (1 in 40) chance to be in stock in the Seed Shop. A user can purchase a seed for 10,000 Sheckes or 529 Roblux.\n\nThe Kiwi seed can still be obtained in the following ways:\n\n1. Has a 2.5% (1 in 40) to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 10,000 Sheckles or 529 Roblux.",
    "mTrivia": "Overview\nThe Kiwi is a multi-harvest, mythical crop added during the Summer Harvest Event. It is obtainable through the Summer Seed Merchant.\n\nThe Kiwi is classified as a Woody, Summer, Sour and a Fruit type crop.\n\nAppearance\nThe Kiwi resembles a lighter version of the Cacao with a lime leaf on top.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-4",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 75,
    "mName": "Bell Pepper",
    "mNameIcon": "bellpepper.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "55,000",
    "mPrice_Rb": "589",
    "mSell_value": "4,964 - 5,500",
    "mObtainable_way": "The Bell Pepper seed was previously obtained in the following ways:\n\n1. Has a 2.5% (1 in 40) chance to be in stock in the Seed Shop. A user can purchase a seed for 55,000 Sheckles or 589 Roblux.\n\nThe Bell Pepper seed can still be obtained in the following ways:\n\n1. Has a 2.5% to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 55,000 Sheckles or 589 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvest.\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab.",
    "mTrivia": "Overview\nThe Bell Pepper is a multi-harvest, mythical crop added during the Summer Harvest Event.\n\nIt is classified as a Vegetable and Summer crop\n\nAppearance\nThe Bell Pepper seed is divided into 4 sections, from top-to-bottom: Red, orange, yellow, green.\nThe Bell Pepper plant is structured similar to the Pepper with a large green stem that forks into multiple smaller branches.\n\nThe Bell Pepper produce resembles its real-life counterpart and consists of 4 variations: red, orange, yellow and green.\n\nThe Bell Pepper is one of 3 plants to have colored produce variants (the other being the Rosy Delight and the Sugar Apple).\n\nThe Bell Pepper is the third pepper-like plant to be added in the game.\n\nWhen holding the Bell Pepper seed it is slightly held lower than the other seeds.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-3",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 76,
    "mName": "Prickly Pear",
    "mNameIcon": "pricklypear.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "555,000",
    "mPrice_Rb": "599",
    "mSell_value": "6,318 - 7,000",
    "mObtainable_way": "The Prickly Pear seed was previously obtained in the following ways:\n\n1. Has a 0.75% (1 in 133) chance to be in stock in the Seed Shop. A user can purchase a seed for 555,000 Sheckles or 599 Roblux.\n\nThe Prickly Pear seed can still be obtained in the following ways:\n\n1. Has a 0.75% (1 in 133) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 555,555 Shekcles or 599 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab",
    "mTrivia": "Overview\nThe Prickly Pear is a multi-harvest, prickly type, mythical crop added during the Summer Harvest Event.\n\nAppearance\nThe Prickly Pear resembles the real-life opuntia cactus. The base of the plant grows up and curves slightly before splitting into a few branches/segments. The segments are paddle-shaped and covered with spines. The fruit grows along the edge of the segments.\nThe fruit is red with white spines dispersed along the surface.\n\nThe produce of the Prickly Pear looks so much alike from its seed.\n\nThe Prickly Pear has a bug where the thorns on the seed have collision, this trait is shared with the Guanabana, which uses the same model.\n\nThe Prickly Pear's produce icon has been changed to prevent confusion of the produce and the seed when crafting.\n\nThe Prickly Pear is one of three known seeds in the game with collision enabled, the 2nd being the Guanabana and the 3rd being the Jalapeno.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 77,
    "mName": "Pink Lily",
    "mNameIcon": "pinklily.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "10 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "58,663 - 65,000",
    "mObtainable_way": "The Pink Lily seed can be obtained in the following ways:\n\n1. Flower Seed Pack 10%\n2. Opening any remaining Exotic Flower Seed Pack 10%\n3. Rainbow Sack 10%",
    "mTrivia": "Overview\nThe Pink Lily is a limited, multi-harvest, mythical crop added during the Bizzy Bee Event. It produces one crop at a time.\n\nAppearance\nThe Pink Lily is a tall, green plant with a pink flower along with petals of differing shades of pink growing on top. The stem looks similar to the Corn, but a darker green.\n\nThe Pink Lily flower's colors can be different types of pink.\n\nIt's base value used to be ridiculously high, but was quickly changed to a lower value.\n\nIts seed along with the Purple Dahlia was used to craft the Honeysuckle seed back when it was still craftable.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 78,
    "mName": "Purple Dahlia",
    "mNameIcon": "purpledahlia.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "10 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "???",
    "mObtainable_way": "The Purple Dahlia seed can be obtained in the following ways:\n\n1. Flower Seed Packs 4.5%\n2. Opening any remaining Exotic Flower Seed Packs 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "Description\nThe Purple Dahlia is a multi-harvest, limited, mythical crop, introduced during the Bizzy Bee Event in Grow a Garden.\n\nAppearance\nThe Purple Dahlia features rich, deep purple petals arranged in a full, layered bloom atop a tall, elegant green stem. Its Mythical rarity is reflected in a faint shimmer or glow, making it stand out vividly among other flowers.\n\nThe Purple Dahlia’s appearance and name are inspired by the real-world dahlia flower.\n\nThe Purple Dahlia's flower closely resembles the Lotus flower in appearance.\n\nThe Purple Dahlia seed chance is broken.\n\nThe Purple Dahlia seed is used when crafting the Honeysuckle seed.\n\nThe render of the seed in the flower seed pack is a darker purple than the seed seen in game. \n\nThe studs on the render are also facing inwards instead of outwards.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 79,
    "mName": "Hinomai",
    "mNameIcon": "hinomai.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "72,200 - 80,000",
    "mObtainable_way": "The Hinomai seed can be obtained in the following ways:\n\n1. Zen Seed Pack 4.5%\n2. Exotic Zen Seed Pack 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "Overview\nThe Hinomai is a mythical, multi-harvest crop added in the Zen Event.\n\nAppearance\nThe stem shares a close resemblance with the Boneboo and Amber Spine having white spine-like sticks. The produce is a four leaf pink flower. Some may also compare the visual appearance of the Hinomai to the Honeysuckle. The non-collectible petals that sprout out also closely resemble a Loquat tree's leaves.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 79,
    "mName": "Zen Rocks",
    "mNameIcon": "zenrocks.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "72,200",
    "mObtainable_way": "Zen Seed Pack 10%\nExotic Zen Seed Pack 10%\nRainbow Sack 10%",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\n\nAlthough the Zen Rocks are classified as a crop, they are not actually a plant or fungus, but rather a pile of stones, making them the first crop of its kind.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 80,
    "mName": "Spiked Mango",
    "mNameIcon": "spikedmango.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "No",
    "mPrice": "75 Chi Coins",
    "mPrice_Rb": "759",
    "mSell_value": "60,919",
    "mObtainable_way": "The Spiked Mango becomes available for purchase in the Zen Event for 75 Chi Coins, once the player has reached Stage 6 of the Channeller's Tree\n\nThe Seed can also be purchased with 759 Roblux.",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\n\nAlthough the Zen Rocks are classified as a crop, they are not actually a plant or fungus, but rather a pile of stones, making them the first crop of its kind.",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 81,
    "mName": "Firefly Fern",
    "mNameIcon": "fireflyfern.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n- Ancient Seed Pack 4.5%\n- Exotic Ancient Seed Pack 4.5%\n- Rainbow Sack 8%\n",
    "mPrice_Rb": "N/A",
    "mSell_value": "64,980",
    "mObtainable_way": "The Firefly Fern can be obtained in the following ways:\n1. Ancient Seed Pack 4.5%\n2. Exotic Ancient Seed Pack 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "",
    "mShop": 4,
    "mNameShop": "Queen Bee Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 82,
    "mName": "Easter Egg",
    "mNameIcon": "easteregg.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "500,000",
    "mPrice_Rb": "699",
    "mSell_value": "2,256",
    "mObtainable_way": "The Easter Egg seed was previously obtained in the following ways:\n1. The Easter Egg could be bought in the Easter Event 2025 shop for 500,000 Sheckles or 699 Roblux.\nThe Easter Egg seed can still be obtained in the following ways:\n1.Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Summer Event",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 83,
    "mName": "Eggplant",
    "mNameIcon": "eggplant.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "500,000",
    "mPrice_Rb": "Seed chance:\n- Basic Seed Pack 8.735%\n- Premium Seed Pack 16%\n- Rainbow Sack 8.735%",
    "mSell_value": "10,830",
    "mObtainable_way": "The Eggplant seed can be obtained in the following ways:\n1. Opening any remaining Basic Seed Packs 8.735%\n2. Opening any remaining Premium Seed Packs 16%\n3. Rainbow Sack 8.735%",
    "mTrivia": "The Eggplant Seed is Visually similar to Easter Egg Seed.\nIt appeared in the Seed Shop as an Apple.\nPossibly, it was an error or a mistake.",
    "mShop": 1,
    "mNameShop": "Summer Event",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 84,
    "mName": "Passionfruit",
    "mNameIcon": "passionfruit.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n Exotic Seed Pack 20%",
    "mPrice_Rb": "199",
    "mSell_value": "10,830",
    "mObtainable_way": "The Passion Fruit seed can be obtained in the following ways:\n1. Opening any remaining Exotic Seed Packs 20%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Summer Event",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 85,
    "mName": "Lemon",
    "mNameIcon": "lemon.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "316",
    "mObtainable_way": "The Lemon seed was obtainable through purchasing a Tomato for Robux instead of Sheckles. This was a developers' joke that lasted two days. The Lemon seed is currently unobtainable.",
    "mTrivia": "The Lemon shares its unique obtainability method with the Cherry Blossom, which was also obtainable by buying a crop for Robux, and not receiving the actual advertised crop.",
    "mShop": 1,
    "mNameShop": "Summer Event",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 86,
    "mName": "Moonglow",
    "mNameIcon": "moonglow.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n- Night Seed Pack 5%\n- Premium Night Seed Pack 12%",
    "mPrice_Rb": "N/A",
    "mSell_value": "22,563",
    "mObtainable_way": "The Moonglow had a 5% chance to be obtained from the Night Seed Pack, and a 12% chance to be obtained from the Premium Night Seed Pack.",
    "mTrivia": "- Formerly, the Moonglow's seed was shorter than other seeds, while it was missing its neon section. It has since been fixed.\n- The Moonglow is similar to the Pineapple, being short crops with a crown of leaves that produce one fruit at a time.\n- If a player touches the Moonglow, it will temporarily light up.\n- Golden and Chocolate Moonglows have a studded texture that removes the fruit’s neon glow. These are the only mutations that change the texture of the Moonglow.\n- The Frozen Mutation removes the transparent coating around a Moonglow, resulting in the fruit losing its glow.\n- The Moonglow is one of the only crops that emit light along with the Lumira and Firefly Fern.",
    "mShop": 1,
    "mNameShop": "Summer Event",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 87,
    "mName": "Moon Melon",
    "mNameIcon": "moonmelon.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "500,000",
    "mPrice_Rb": "729",
    "mSell_value": "16,245",
    "mObtainable_way": "The Moon Melon seed was previously obtained in the following ways:\n1. Purchased during the Blood Moon in the Blood Moon Shop for  500,000 or 729.\nThe Moon Melon seed can still be obtained in the following ways:\n1. Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "- Moon Melons are often used as substitutes for Candy Blossoms.\n- There is currently a strategy involving spamming sprinklers around the Moon Melon crop and leaving the game for about an hour, and returning to massive fruits — around 30-50kg in size — resulting in sell prices rivaling Candy Blossoms after applying certain mutations. Hence, it is considered one of the best fruits for grinding sheckles.\n- Moon Melons are considered a \"Night type\" fruit.\n- Moon Melons (along with Watermelon and Pumpkin) are affected by the Sweet Soaker Sprinkler.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 88,
    "mName": "Blood Banana",
    "mNameIcon": "bloodnanana.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "200,000",
    "mPrice_Rb": "599",
    "mSell_value": "5,415",
    "mObtainable_way": "The Blood Banana seed was previously obtained in the following ways:\n1. Purchased during the Blood Moon in the Blood Moon Shop for 200,000 Sheckles or 599 Roblux.\n2. Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "The Blood Banana is considered a \"Night Type Fruit\".\nIt is inspired by the Banana from the Exotic Seed Pack.\nOnce fully grown, players can harvest from 2 to 4 Blood Bananas per yield, with a similar concept of the Banana.\nBlood Bananas were inspired by fruits, named Banana Yucca.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 89,
    "mName": "Celestiberry",
    "mNameIcon": "celestiberry.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "15,000,000",
    "mPrice_Rb": "599",
    "mSell_value": "9,025",
    "mObtainable_way": "The Celestiberry was previously obtained in the following ways:\n1. Purchased during the Night event after Update 1.07.1 in the Twilight Shop for 15,000,000 Sheckles or 599 Roblux.\nThe Celestiberry can still be obtained from the following ways:\n1. Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "The Celestiberry was added as part of an apology for the poorly-received Update 1.07.0.\nThe fruit of the Celestiberry share the same model with the fruit of the Raspberry, and the plant shares the same model with the scrapped Crimson Vine Blood Moon Event crop. The only difference is that the Celestiberry models all use shades of blue.\nThe plant is the remastered version of the Crimson Vine.\nThe Celestiberry seed has the 3rd highest price, tied with Ember Lily and behind Moon Mango and Sugar Apple.\nThe Celestiberry is considered a \"Night type\" fruit.\nWhen the Berry Blusher Sprinkler first released, The Celestiberry was not boosted by it along with the Raspberry. This was fixed in a patch.\nThe word \"Celestiberry\" is a compound name, where there are 2 words are combined/mixed into one, those words that are combined into Celestiberry are \"Celestial\" and \"Berry\"",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 90,
    "mName": "Nectarine",
    "mNameIcon": "nectarine.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Pink Lily\n + Purple Dahlia\n + 80 Honey",
    "mPrice_Rb": "N/A",
    "mSell_value": "90,250",
    "mObtainable_way": "The Nectarine seed was previously obtained in the following ways:\n1. The Nectarine seed could be obtained from the Honey Shop for 25 Honey or 399 Roblux.\nThe Nectarine seed can still be obtained from the following ways:\n1. Gaining enough points during the Summer Harvest Event.",
    "mTrivia": "The Nectarine tree is quite small, however it produces up to 10 fruits.\nThe Nectarine fruit has the same model as the Peach, but more orange and with a wider middle part.\nThe Nectarine fruit can also be used for the sprinkler method bypassing Moon Melon.\nThe Nectarine is also called as Prunus persica var. nucipersica",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 91,
    "mName": "Honeysuckle",
    "mNameIcon": "honeysuckle.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "25 Hone",
    "mPrice_Rb": "399",
    "mSell_value": "48,000",
    "mObtainable_way": "The Honeysuckle was formerly obtained after completing all 30 recipes for Bizzy Bear's quest, only one seed could be obtained per quest-cycle.\n\nThe Honeysuckle was later made available to craft at the Seed Crafting Table but later on it was moved to the cosmetics shop. As of June 28 2025, it has been made unobtainable upon the release of the second week of the Summer Harvest Event.\nThe Honeysuckle was crafted with:\n1 Pink Lily seed\n + 1 Purple Dahlia seed\n + 80 Honey\nCraft time: 24 minutes\nIt was also purchased with Robux",
    "mTrivia": "The Honeysuckle's design originates from a giant Honeysuckle concept made by \"JAYE!!!!!! ★ CINNAMON BOY\" on Discord. [1]\nThe Honeysuckle’s minimum value and the base price is the same as the Candy Blossom.\nIt was a tropical plant before the Prehistoric Event and affected by Toucan. Players obtained Honeysuckles worth quadrillions (with mutations). The biggest Honeysuckle recorded weighed 42,000kg.\nHoneysuckle was at risk of being nerfed but players voted for it to stay the same",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 92,
    "mName": "Suncoil",
    "mNameIcon": "suncoil.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Crocus, Daffodil + Pink Lily + Dandelion + 40 Honey via Bizzy Bear Crafting",
    "mPrice_Rb": "749",
    "mSell_value": "72,200",
    "mObtainable_way": "The Suncoil can be crafted with:\n1 Crocus\n + 1 Daffodil\n + 1 Pink Lily\n + 1 Dandelion\n + 40 Honey\nCraft time: 45 minutes\nAlternatively, Suncoil can also be purchased for 749 Roblux.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 93,
    "mName": "Bendboo",
    "mNameIcon": "bendboo.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "- Crafters Seed Pack 10%\n- Exotic Crafters Seed Pack 10%\n- Rainbow Sack 10%",
    "mPrice_Rb": "N/A",
    "mSell_value": " 139,888",
    "mObtainable_way": "The Bendboo seed can be obtained in the following ways:\n1. Opening any remaining Crafters Seed Packs 4.5%\n2. Opening any remaining Exotic Flower Seed Packs 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 94,
    "mName": "Cocovine",
    "mNameIcon": "cocovine.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "- Crafters Seed Pack 4.5%\n- Exotic Crafters Seed Pack 4.5%\n- Rainbow Sack 8%",
    "mPrice_Rb": "N/A",
    "mSell_value": "60,166",
    "mObtainable_way": "The Cocovine seed can be obtained in the following ways:\n1. Opening any remaining Crafters Seed Packs 4.5%\n2. Opening any remaining Exotic Crafters Seed Packs 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "The Cocovine is made of 2 different plants, which are Coconut and Grape.\nEvery Cocovine has a red block (Similar to an apple) in the middle that a user can see if the camera is zoomed in enough. The reason is unknown, probably because of testing.\nCocovine plants produce from one to six crops per yield, scattering around the vines.\nCocovine has the same minimum value as Moon Blossom and Ember Lily with 60,166 Sheckles.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 95,
    "mName": "Parasol Flower",
    "mNameIcon": "parasolflower.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "10% Normal, Exotic, and Rainbow Sack",
    "mPrice_Rb": "N/A",
    "mSell_value": "180,500",
    "mObtainable_way": "The Parasol Flower seed can be obtained in the following ways:\n1. Opening any remaining Summer Seed Packs 10%\n2. Opening any remaining Exotic Summer Seed Packs 10%\n3. Rainbow Sack 10%",
    "mTrivia": "Parasol flower belongs to the Tropical Type plants.\nThe Parasol flower does resemble a Japanese Parasol.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1-5",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 96,
    "mName": "Lily Of The Valley",
    "mNameIcon": "lilyofthevalley.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "12 Summer Coins",
    "mPrice_Rb": "639",
    "mSell_value": "44,331",
    "mObtainable_way": "The intended method of obtainment is by purchasing it from the Summer Shop for 12 Summer Coins.",
    "mTrivia": "Once fully grown, a player can collect up to 5 fruits at a time.",
    "mShop": 3,
    "mNameShop": "Seed Pack",
    "mStock": "N/A",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 97,
    "mName": "Grape",
    "mNameIcon": "grape.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "850,000",
    "mPrice_Rb": "599",
    "mSell_value": "7,085 - 7,850",
    "mObtainable_way": "Grape seed can be obtained in the following ways:\n\n1. Has a 1% (1 in 100) chance to be in stock in the Seed Shop. A user can purchase a seed for 850,000 Sheckles or 599 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Grape is a multi-harvest, berry type, divine crop. The grape seed wasn’t purchasable from the seed shop as of the Summer Harvest Event but was later re-added in the Prehistoric Event.\n\nAppearance\nThe Grape produce is characterized as clusters of round bodies joined together. The old model of the Grape used to have studs on the clumps of grapes.\n\nThere was once a bug where the Grape could not mutate as shocked. This was patched in an update.\n\nAn overgrown Grape vine can enter another player's garden.\n\nGrape is the first Divine Seed in the Seed Shop and was introduced in the first update in the game along with the Easter Event 2025.\n\nIf a grape is above (presumably 4.00kg+) it will enter a different holding animation.\n\nThere is a glitch associated with the Grape called the \"Dead Grape Vine\". This is a rare glitch where a fully-grown Grape Vine doesn't produce Grapes. The Harvest Tool doesn't work with these. If this happens, its best to reclaim the vine and plant it again.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 98,
    "mName": "Loquat",
    "mNameIcon": "loquat.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "900,000",
    "mPrice_Rb": "629",
    "mSell_value": "7,220 - 8,000",
    "mObtainable_way": "The Loquat seed was previously obtained in the following ways:\n\n1. Had a 0.75% (1 in 133) chance to be in stock in the Seed Shop. A user can purchase a seed for 900,000 Sheckles or 629 Roblux.\n\nThe Loquat seed can still be obtained in the following ways:\n\n1. Has a 0.75% (1 in 133) chance to be in stock in the Summer Merchant. A user can purchase a seed for 900,000 Sheckles or 629 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvest.\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab.",
    "mTrivia": "Overview\nThe Loquat is a multi-harvest, Divine crop released on Update 1.11.0 (Summer Harvest Update).\n\nAppearance\nA Loquat's produce resembles 2 yellow berries with shadows on the bottom connected by a brown stem, similar to a Cranberry.\n\nIts crop/plant features a thick brown trunk, with 3 branches going north, west and east, each branch has a few green leaves that look like a plus sign, with each end decreasing in size. Its seed is gold colored. But if the Loquat gets the moonlit mutation, it will have a similar appearance to the Celestiberry.\nThe model of the Loquat fruit is nearly identical to the model of the Cranberry.\n\nThe Loquat seed is one for one the same color as the Mango seed and is almost the same color as the Pumpkin and Sunflower seeds.\n\nThe Loquat's leaves are very similar to the non-collectable Hinomai petals that grow on the side.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 99,
    "mName": "Mushroom",
    "mNameIcon": "mushroom.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "150,000",
    "mPrice_Rb": "249",
    "mSell_value": "136,278 - 151,000",
    "mObtainable_way": "Mushroom seed can be obtained in the following ways:\n\n1. Has a 0.83%(1/120) chance to be in stock in the Seed Shop. A user can purchase a seed for 150,000 Sheckles or 249 Roblux.\n2. Lucky Harvest\n3. Snail, yield a seed when harvest\n4. Very rarely dug up by a Dog, Golden Lab or Shiba Inu\n5. 36% chance from the Silver Seed Pack",
    "mTrivia": "Overview\nThe Mushroom is a single-harvest, stalky, divine crop, added during the Angry Plant Update.\n\nAppearance\nA Mushroom is characterized as having a central stalk as the supporting structure and a blocky dome-shaped cap with spots. A Mushroom can vary in size, including height and width. There are various color variants for Mushroom, including but not limited to its cap, stalk, and spots on the cap.\nThe various colors of the Mushroom do not affect the Mushroom's sell value in any way.\nAll colors of the Mushroom are equally common, meaning that there are no \"rare\" Mushroom colors.\n\nMushroom, when it's in stock, comes with 16 or more seeds to buy, compensation to the fact it is a single harvest crop making it the most common Divine seed in the game.\n\nMushroom has the sixth highest base price in the game, before the Bendboo, Parasol Flower, Sunflower, Bone Blossom and Golden Egg\nWhen the Mushroom was first added, it was unable to gain the Shocked Mutation. This was fixed the following update.\n\nMushroom and Bamboo are the only single harvest crops that have a lower minimum value than the seed price.\n\nThe spots on the seed looks like its saying “S”.\nThis was supposed to be the first mushroom type in the game, the second being the Mega Mushroom, and the third being the Merica Mushroom.\n\nThe Mushroom is the first seed to not be a solid color or gradient, having spots instead.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 100,
    "mName": "Pepper",
    "mNameIcon": "pepper.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "1,000,000",
    "mPrice_Rb": "629",
    "mSell_value": "7,220 - 8,000",
    "mObtainable_way": "The Pepper Seed was previously obtained in the following ways:\n\n1. Gained enough points during the Summer Harvest Event.\n\nPepper seed can be obtained in the following ways:\n\n1. Has a 0.75% (1/133) chance to be in stock in the Seed Shop. A user can purchase a seed for 1,000,000 Sheckles or 629 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvest.\n5. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nPepper is a multi-harvest, divine crop, added in Update 1.04.0\n\nAppearance\nThe Pepper produce is characterized by a red banana-like shaped body that curves upward at the tip with a green stem. The produce also procures a unique physical effect that resembles flames.\n\nThe Pepper crop has a light green base that divides into 2-3 large branches, each with multiple light green leaves with dark green centers that curve downward.\nThe Pepper is the first fruit that has special physical effects without Crop Mutations.\n\nThe Pepper has appeared in one of the thumbnails of the game with a raised value of 9,643,734,647 sheckles.\n\nPepper crops can produce up to 6 fruits once they are fully grown, having three on each of their vines. This applies to the Dragon Pepper as well.\n\nThe Pepper appears to be based on the real life Cayenne Chili Pepper, and is the first crop added that resemble a chili pepper.\n\nPepper crops have a sizzling sound effect when equipped.\n\nOn August 22, 2025, Cacao and Pepper stocked simultaneously.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 101,
    "mName": "Cacao",
    "mNameIcon": "cacao.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "2,500,000",
    "mPrice_Rb": "679",
    "mSell_value": "10,830 - 12,000",
    "mObtainable_way": "The Cacao seed was previously obtained in the following ways:\n\n1. Could be obtained by gaining enough points during the Summer Harvest Event.\n\nThe Cacao seed is obtained in the following ways:\n\n1. Has a 0.666% (1 in 150)chance to be in stock in the Seed Shop. A user can purchase a seed for 2,500,000 Sheckles or 679 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Very rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Description\nThe Cacao crop is a multi-harvest, Divine crop, that was added in the Lunar Glow Event.\n\nAppearance\nThe Cacao is characterized as a large, oblong pod body with a stem.\n\nWhen fully grown, a player can collect up to 5 cacao fruits per yield, having 2 on one side and three on the other.\n\nThe Cacao is used to make Choc Sprays.\nThe Cacao shares a similar tree design to Candy Blossom.\n\nThe Cacao tree used to be the same shape and branches before changing to a random pattern similar to grape seed. this also affected the spots where Cacao pods grow.\n\nOn August 22, 2025, Cacao and Pepper stocked simultaneously.",
    "mShop": 1,
    "mNameShop": "Sam's Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 102,
    "mName": "Feijoa",
    "mNameIcon": "feijoa.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "2,750,000",
    "mPrice_Rb": "679",
    "mSell_value": "11,733 - 13,000",
    "mObtainable_way": "The Feijoa seed was previously obtainable in the following ways:\n\n1. Had a 0.6% (1 in 160) chance to be in stock in the Seed Shop. A user can purchase a seed for 2,750,000 Sheckles or 679 Roblux.\n\nIt can currently be obtained through the following ways:\n\n1. Has a 0.6% (1 in 160) chance to be in stock in the Summer Traveling Merchant. A user can purchase a seed for 2,750,000 Sheckles or 679 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Shiba Inu, or Golden Lab",
    "mTrivia": "Overview\nThe Feijoa is a multi-harvest Divine crop, added during the Summer Harvest Event.\n\nAppearance\nThe Feijoa is a forest-green fruit with a gradient that transitions from dark green to light green. It has a brown stem on top, and the fruit itself is shaped like a thicker Cacao.\n\nThe Feijoa is Jandel's favorite fruit mentioned before the release of the Friendship Update. (Also before Zen Update.)\n\nThe Feijoa seed looks like the Ember Lily seed upside down. The only difference being the shade of green.\n\nThis is also observed on the Candy Blossom seed, which looks like the Lotus seed upside-down.\n\n\"Feijoa\"'s Name Is Similar to the Brazilian Famous Food Called \"Feijão\", Which is a Bean.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 103,
    "mName": "Pitcher Plant",
    "mNameIcon": "pitcherplant.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "7,500,000",
    "mPrice_Rb": "715",
    "mSell_value": "46,930 - 52,000",
    "mObtainable_way": "The Pitcher Plant seed was previously obtained in the following ways:\n\n1. Has a 0.45% (1 in 222) chance to be in stock in the Seed Shop. A user can purchase a seed for 7,500,000 Sheckles or 715 Roblux.\n\nThe Pitcher Plant seed can still be obtained in the following ways:\n\n1. Has a 0.45% (1 in 450) to be in stock in the Summer Seed Merchant. A user can purchase the seed for 7,500,000 Sheckles or 715 Roblux.\n2. Lucky Harvest\n3. Stolen by a Red Fox\n4. Snail, yield a seed when harvest\n5. Rarely dug up by a Dog, Golden Lab or Shiba Inu",
    "mTrivia": "Overview\nThe Pitcher Plant is a multi-harvest, Tropical, divine crop. It was added into the Seed Shop in the Mega Harvest Update alongside the Rafflesia.\n\nAppearance\nThe produce's appearance is a yellowish-green tubular-shaped base resembling a pitcher, just like a real-life Pitcher Plant. It has a dark red ridge, or peristome, on the side of the pitcher with a drip of liquid on the side. The lid of the pitcher which hangs above the pitcher is about the same color as the peristome.\n\nThe crop is a single stem with a few sharp leaves facing upwards. On the top of the crop, the stem curls downward towards where the produce grows.\n\nThe seed is a color gradient, starting as a yellowish-green at the bottom and ending as a bright orange at the top. At the top of the seed is a orange stem that connects to a dark reddish-orange lid. It resembles the Feijoa seed, but with a slight gradient change.\n\nThe Pitcher Plant seed is collidable.\n\nIf the Pitcher Plant is big, it can trap people if the owner blocks the exit with a cosmetic\nThe Pitcher Plant is based off a real plant, also called pitcher plant.\n\nThe Pitcher Plant seed is the same as the Feijoa seed, the only difference being the orange stem on the top and the red leaf coming from it.\n\nThe Pitcher Plant is currently the rarest obtainable item in the game, with the only 20% chance of the Summer Seed Merchant arriving on top of the 0.45% chance of being in stock, the actual chance of getting the Pitcher Plant is 0.09%, .01 percent more common than the Kitsune. (this is false, as the odds of the Pitcher Plant being on stock at the Summer Seed Merchant is considerably much, much higher than the odds listed.)",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 104,
    "mName": "Grand Volcania",
    "mNameIcon": "grandvolcania.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "819",
    "mSell_value": "63,676",
    "mObtainable_way": "The Grand Volcania Seed can be crafted with following materials:\n2x Ember Lily\n1x Dinosaur Egg\n1x Ancient Seed Pack\n900,000 Sheckle\nCraft Time: 45 Minutes\nAlternatively, it can be purchased for  819 Robux.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 105,
    "mName": "Sunflower",
    "mNameIcon": "sunflower.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\n- Flower Seed Pack 0.5%\n- Exotic Flower Seed Pack 0.5%\n- Rainbow Sack 7%",
    "mPrice_Rb": "N/A",
    "mSell_value": "144,400 - 160,000",
    "mObtainable_way": "The Sunflower seed can be obtained in the following ways:\n\n1. Flower Seed Packs 0.5%\n2. Opening any remaining Exotic Flower Seed Packs 0.5%\n3. Rainbow Sack 7%",
    "mTrivia": "Overview\nThe Sunflower is a limited, multi-harvest, divine crop introduced during the Bizzy Bee Event.\n\nIt grows one plant at a time. It is the rarest obtainable seed from the Flower Seed Pack.\n\nAppearance\nThe Sunflower resembles its real life counterpart. The Sunflower seed is visually very similar to both the Pumpkin, Mango, Loquat, Pineapple and Hive Fruit seeds.\nThe Sunflower is the second type of sunflower in the game, the first one being Candy Sunflower.\n\nThe Sunflower plant takes approximately 30 minutes to fully grow.\n\nUpon release, the Sunflower had the highest base price in the game at the time, 200,000 Sheckles (similar to Parasol Flower), but was later reduced down to 135,000 and then raised back up to 144,000 Sheckles, before being buffed again to 160,000 Sheckles.\n\nThe Sunflower has the sixth highest base price in the game, only surpassed by the Amberheart, Parasol Flower, Romanesco, Bone Blossom and Golden Egg.\n\nIf a Sunflower gets the Gold and Shocked Mutations, the Sunflower will look like the Dawnbound Mutation.\nThere is a glitch where sometimes a Sunflower will produce 2 crops.\n\nThe Sunflower is the first multi-harvest sunflower type plant in the game.\n\nThere's a single Sunflower petal below the Sunflower plant that's hidden underground.\nThe Sunflower is one of the 14 plants that surpass the Candy Blossom in base value (the others being Princess Thorn, King Cabbage, Honeysuckle (exact value), Tall Asparagus (also exact value), Romanesco, Giant Pinecone (pre nerf only and also exact value), Amberheart, Bone Blossom, Parasol Flower, Golden Egg, Mushroom, Bendboo, Zen Rocks, and Boneboo.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 106,
    "mName": "Maple Apple",
    "mNameIcon": "mapleapple.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "",
    "mPrice_Rb": "N/A",
    "mSell_value": "70,194",
    "mObtainable_way": "The Maple Apple can be obtained from the Zen Seed Pack or Exotic Zen Seed Pack, with a 0.5% of being obtained.",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 107,
    "mName": "Fossilight",
    "mNameIcon": "fossilight.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "79,420",
    "mObtainable_way": "The Fossilight Seed can be obtained in the following ways:\n1. Ancient Seed Pack 0.5%\n2. Exotic Ancient Seed Pack 0.5%\n3. Rainbow Sack 7%",
    "mTrivia": "The purple color on the back of the Fossilight does not match the color of the image representing it in the shop, where the back is more maroon.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 108,
    "mName": "Cherry Blossom",
    "mNameIcon": "cherryblossom.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "451",
    "mPrice_Rb": "N/A",
    "mSell_value": "500",
    "mObtainable_way": "Before April 21st, 2025, players could purchase a Strawberry from the Seed Shop for 21 Robux to obtain the Cherry Blossom seed. The Cherry Blossom seed has not returned and is currently unobtainable.",
    "mTrivia": "The Cherry Blossom is one of four blossoms other than Candy Blossom, Moon Blossom and Bone Blossom.\nThe Cherry Blossom crop is based on the blossoms of the Cherry Tree, often referred to as “Sakura” in Japan, originating from China.\nThe Cherry Blossom may have inspired the Petal Bee's color scheme.\nThe produce is similar to the Moon Blossom.\nThis is likely because both are blossoms.\nThis is considered the cheapest high-tier fruit in the game, being only 500 sheckles at least. Many dislike it.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 109,
    "mName": "Crimson Vine",
    "mNameIcon": "crimsonvine.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "1,128",
    "mObtainable_way": "The Crimson Vine was replaced by the Celestiberry making it permanently unobtainable.",
    "mTrivia": "The Celestiberry is modelled after the Crimson Vine, the only difference being the former is blue.\nThe Crimson Vine bush shares the same model as the Rose and the Celestiberry.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 110,
    "mName": "Candy Blossom",
    "mNameIcon": "candyblossom.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "10,000,000 Sheckles with seed chance: 4%",
    "mPrice_Rb": "N/A",
    "mSell_value": "90,250",
    "mObtainable_way": "The Candy Blossom seed was previously obtained in the following ways:\n1. The Candy Blossom seed could be purchased for 10,000,000 Sheckles from the Easter Event Shop with a chance of 4% every restock",
    "mTrivia": "he Candy Blossom is one of four blossoms. The other three are the Moon Blossom, Cherry Blossom and Bone Blossom.\nIts seed is visually similar to Lotus' seed upside down, although the blue gradient is a little brighter.\nOnce fully grown, Candy Blossom gives up to 12 fruits per yield - six on each of its bushes.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 111,
    "mName": "Lotus",
    "mNameIcon": "lotus.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\nBasic Seed Pack 0.25%\nPremium Seed Pack 2.5%\nRainbow Sack 0.25%",
    "mPrice_Rb": "N/A",
    "mSell_value": "31,588",
    "mObtainable_way": "The Lotus seed can be obtained in the following ways:\n1. Opening any remaining Basic Seed Packs 0.25%\n2. Opening any remaining Premium Seed Packs 2.5%\n3. Rainbow Sack 0.25%",
    "mTrivia": "The Lotus share's similarities with the Moonglow as they both grow only one plant and have a similar base price\nThe Lotus seed is similar to the Candy Blossom.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 112,
    "mName": "Venus Fly Trap",
    "mNameIcon": "venusflytrap.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\nBasic Seed Pack 0.01%\nPremium Seed Pack 1%\nRainbow Sack 0.01%",
    "mPrice_Rb": "N/A",
    "mSell_value": "76,713",
    "mObtainable_way": "The Venus Fly Trap seed can be obtained in the following ways:\n1. Basic Seed Packs 0.01%\n2. Premium Seed Packs 1%\n3. Rainbow Sack 0.01%",
    "mTrivia": "The Venus Fly Trap’s produce has multiple variations.\nThis plant is based off of the NPC Jim the Angry Plant.\nThe Venus Fly Trap is currently the only plant that moves.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 113,
    "mName": "Cursed Fruit",
    "mNameIcon": "cursedfruit.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Exotic Seed Pack 0.5%",
    "mPrice_Rb": "N/A",
    "mSell_value": " 23,239",
    "mObtainable_way": "The Cursed Fruit can be obtained in the following ways:\n1. Opening any remaining Exotic Seed Packs 0.5%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 114,
    "mName": "Soul Fruit",
    "mNameIcon": "soulfruit.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Exotic Seed Pack 1.5%",
    "mPrice_Rb": "N/A",
    "mSell_value": "6,994",
    "mObtainable_way": "The Soul Fruit seed can be obtained in the following ways:\n1. Opening any remaining Exotic Seed Packs 1.5%",
    "mTrivia": "",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 115,
    "mName": "Mega Mushroom",
    "mNameIcon": "megamushroom.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Exotic Seed Pack 1.5%",
    "mPrice_Rb": "N/A",
    "mSell_value": "451",
    "mObtainable_way": "The way the player can obtain the Mega Mushroom is through, and currently only through, an admin.",
    "mTrivia": "The Mega Mushroom is not the only admin-exclusive plant, another being the Purple Cabbage.\nThe Mega Mushroom can not be harvested.\nThe Mega Mushroom cannot be affected by mutation.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 116,
    "mName": "Moon Blossom",
    "mNameIcon": "moonblossom.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\nPremium Night Seed Pack 2.5%\nNight Seed Pack 0.5%",
    "mPrice_Rb": "N/A",
    "mSell_value": "60,166",
    "mObtainable_way": "The Moon Blossom seed can be obtained in the following ways:\n1. Opening any remaining Night Seed Packs 0.5%\n2. Opening any remaining Premium Night Seed Packs 2.5%",
    "mTrivia": "The Moon Blossom is one of four blossoms other than Candy Blossom, Cherry Blossom and Bone Blossom.\nThere are two possible colors of the Moon Blossom tree: purple and blue.\nTwo plants within the blossom plant variety contain biologically accurate details, such as containing stamens & anther, both used for reproduction. These two plants are the Moon Blossom and Cherry Blossom.\nThe Moon Blossom had gotten a fix to its size, as a bug made it, so it was covering the majority of the map a day into the update release.\nThe Moon Blossom got a buff from a minimum value of 55,000 Sheckles to a minimum value of 60,166 Sheckles.\nEach Moon Blossom crop has a randomized number and rotation of antennae.\nMoon Blossom is one of the very few crops to return to the game during the Summer Harvest Event.\nMoon Blossom is considered the weakest of all current seed pack's highest rarity fruit due to its low size variation and minimum value.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 117,
    "mName": "Moon Mango",
    "mNameIcon": "moonmango.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "1,000,000,000",
    "mPrice_Rb": "999",
    "mSell_value": "45,125",
    "mObtainable_way": "The Moon Mango seed was previously obtained in the following ways:\n1. Purchased during the Night Event in the Twilight Shop for 1,000,000,000 Sheckles or 999 Roblux.\n2. Achieving 7000 points in the Summer Harvest Event.",
    "mTrivia": "The Moon Mango was added as part of an apology for the poorly-received Update 1.07.0.\nThe Moon Mango is the most expensive crop in the game.\nAlthough the rarity of the Moon Mango is Divine (Orange), it will show Mythical (Purple) whenever a player hover to the Moon Mango plant. It is unsure whether they changed the rarity of the Moon Mango or if this a visual bug.\nThe Moon Mango is similar to the normal Mango, while being significantly smaller than a typical Mango tree and having a dark purple color scheme.\nThe Moon Mango is a slow growing crop.\nDuring night events, Moon Mangos will grow faster.\nWhen shoveling a Moon Mango, the text to confirm shows it's mythical, although it is originally divine.\nUpon release, the Moon Mango had a minimum value of 22,563 Sheckles and got increased to 45,125 Sheckles.\nThe Moon Mango seed icon in the Twilight Shop and the actual in-game model have different textures.\nThe Moon Mango Seed got a buff due to backlash caused by it having a high seed price with a low sell price.\nThe Moon Mango is known in the GAG community as a 'scam' and a 'meme fruit'\nThe Moon Mango is considered a \"Night type\" fruit.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 118,
    "mName": "Hive Fruit",
    "mNameIcon": "hivefruit.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "40 Honey",
    "mPrice_Rb": "599",
    "mSell_value": "55,955",
    "mObtainable_way": "The Hive Fruit seed was previously obtained in the following ways:\n\nThe Hive Fruit seed could be bought from the Honey Shop for 40 Honey or 599 Roblux.",
    "mTrivia": "Its unique tree structure requires strategic garden planning to maximize yield.\nThe Hive Fruit grows differently than other plants. As the Hive Fruit grows, it starts off small, then its size gradually increases as it grows. This is different because most fruit extend or add more parts as it grows.\nSometimes the Hive Fruit can stay extremely small while growing, this makes it very difficult to harvest without the use of a harvest tool.\nHive Fruit is currently the plant with the most changes in base value. Starting off at 6,400 Sheckles and then 2 days after the Bizzy Bees Update it got changed to 23,145 Sheckles. A few days later it got buffed to 45,125 Sheckles. As of the Working Bees Update the base value of Hive Fruit has once again changed, this time to 55,955 Sheckles.\nAs of Update 1.10.0 the Hive Fruit's unique ability to release bees when it has the Pollinated mutation has been properly implemented, as it was broken in prior versions.\nAfter being fully grown, Hive Fruit can produce from one to four crops, randomly distributing by its branches.\nThe Hive Fruit seed is visually very similar to both the Pumpkin, Mango, Loquat and Pineapple seeds.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 119,
    "mName": "Dragon Pepper",
    "mNameIcon": "dragonpepper.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Seed chance:\nCrafters Seed Pack 0.5%\nExotic Crafters Seed Pack 0.5%\nRainbow Sack 7%",
    "mPrice_Rb": "N/A",
    "mSell_value": "80,221",
    "mObtainable_way": "The Dragon Pepper seed can be obtained in the following ways:\n1. Opening any remaining Crafters Seed Pack 0.5%\n2. Opening any remaining Exotic Crafters Seed Pack 0.5%\n3. Rainbow Sack 7%",
    "mTrivia": "The Dragon Pepper is the second Pepper-typе plant to be added.\nBoth the plant's name and design is a combination of 2 different plants, which are Dragon Fruit and Pepper.\nWhen fully grown, the Dragon Pepper can produce 4-6 crops per yield.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 120,
    "mName": "Rosy Delight",
    "mNameIcon": "rosydelight.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "62,273",
    "mObtainable_way": "The Rosy Delight seed can be obtained in the following ways:\n1. Summer Seed Pack 4.5%\n2. Exotic Summer Seed Pack 4.5%\n3. Rainbow Sack 8%",
    "mTrivia": "The Rosy Delight is one of the few crops to have multiple colors for its produce, that being purple, red, pink, green, yellow, and blue.",
    "mShop": 4,
    "mNameShop": "Sumer pack",
    "mStock": "1",
    "mCoin": "yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 121,
    "mName": "Traveler Fruit",
    "mNameIcon": "travelerfruit.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "32 Summer Coins",
    "mPrice_Rb": "749",
    "mSell_value": "53,248",
    "mObtainable_way": "The obtainment method of a Traveler's Fruit is from the Summer Shop. It is purchasable for 32 Summer Coins.",
    "mTrivia": "This fruit is based on the Ravenala madagascariensis in real life, which has been given the name \"Traveler's Tree\", thus the name of the in-game fruit.\nTraveler's Fruit plant was first seen at the Week 3 of Bizzy Bee Event leak image.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 122,
    "mName": "Beanstalk",
    "mNameIcon": "beanstalk.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "10,000,000",
    "mPrice_Rb": "715",
    "mSell_value": "25,270 - 28,000",
    "mObtainable_way": "The Beanstalk seed is obtained in the following ways:\n\n1. Has a 0.48% (1/210) chance of being in stock in the Seed Shop. A user can purchase it for 10,000,000 Sheckles or 715 Roblux in the Seed Shop.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yields a seed when harvested.\n5. Super rarely dug up by a Dog, Golden Lab or Shiba Inu.\n6. While climbing the Magic Beanstalk, Players can find green orbs that can give the player who found them one.\n7. Selling a Dairy Cow, with a low chance.\n8. Silver Prismatic Seed Pack\n9. Joining Admin Abuse War",
    "mTrivia": "Overview\nThe Beanstalk is a multi-harvest, stalky, prismatic crop. Added during update 1.06.0 in Grow a Garden.\n\nThe Beanstalk was the first prismatic plant to be added to the game. Currently available at the Seed Shop.\n\nThe Beanstalk has 14 crops on the average size Beanstalk.\n\nAppearance\nBeanstalk seeds range in color from dark green to light green. Starting dark green at the base, they fade to light green.\n\nThe Beanstalk plant is naturally tall, growing in a twisted, vine-like fashion. Its color is a gradient of dark green to light green. Its shape resembles the beanstalk from the story of \"Jack and the Beanstalk\".\n\nIts produce consists of a container box containing several spheres. The number of spheres will depend on the size of the production, with the spheres also growing large along with the box.\nThe Beanstalk was the first Prismatic crop to be released in-game.\n\nThis plant was inspired by a fairy tale named \"Jack And The Beanstalk\".\nThere was a bug when the Beanstalk was first released, where if a player purchased it with Robux, it would instead give them a Dragon Fruit seed.\n\nThe in-game Beanstalk is very similar in appearance to the titular beanstalk from Jack and The Beanstalk, being large, spiraling plants that sprout podded beans.\n\nThe beanstalk is the biggest showable crop (if it and the other plants are on normal size)\nThe fruits on a beanstalk can swap locations with other beanstalks on the same plant, making it more difficult to find a specific beanstalk the player wants to harvest.\nOnce fully grown, The Beanstalk produces at least 4 fruits per yield, which depends on the crop's height.\n\nThe Beanstalk is one of the very few plants that scale their fruit production with overgrowth creating more fruits the larger the Beanstalk.\nThe Beanstalk gives 7 Zen/Chi during the Zen Event.\n\nThe Beanstalk is the first crop that's centered around an event, being the Beanstalk Event.",
    "mShop": 1,
    "mNameShop": "Seed Shop",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 123,
    "mName": "Ember Lily",
    "mNameIcon": "emberlily.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "15,000,000",
    "mPrice_Rb": "779",
    "mSell_value": "60,166 - 66,666",
    "mObtainable_way": "The Ember Lily seed was previously obtained in the following ways:\n\n1. Gaining enough points during the Summer Harvest Event.\n\nThe Ember Lily seed can be obtained in the following ways:\n\n1. Has a 0.42% (1/240) chance to be in the Seed Shop. A user can purchase a seed for 15,000,000 Sheckles or 779 Roblux.\n2. Lucky Harvest\n3. Snail, yield a seed when harvest\n4. Very rarely dug up by a Dog, Golden Lab or Shiba Inu\n5. Silver Prismatic Seed Pack",
    "mTrivia": "Description\nThe Ember Lily is a multi-harvest Prismatic crop. It is considered as a flower, spicy type crops. It was added during Update 1.09.0 also known as the Friendship update.\n\nAppearance\nThe Ember Lily produces fiery orange and red petals resembling glowing embers. The crop features a sturdy green stem supporting the vibrant blossom.\n\nThe Ember Lily is one of the seven Prismatic crops in the game.\n\nThe Ember Lily seed has the 7th highest cost to purchase, Priced at  15,000,000, behind Sugar Apple, Burning Bud, Giant Pinecone, Elder Strawberry, Romanesco and Moon Mango, also tied with Celestiberry.\n\nThe Ember Lily is based on the real-life Ember Lily flower, which is just a variant of the Lily.\nThere is a bug where the Red Fox cannot steal an Ember Lily Seed.\n\nEmber Lilies in real life can vary in color.\nAn Ember Lily that's a single color via the Molten mutations are tied as the rarest thing in the game, having a 1/3^67 chance of ever being seen.\n\nThere is a bug where it displays as a divine in the shovel warning.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 124,
    "mName": "Sugar Apple",
    "mNameIcon": "sugarapple.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "25,000,000",
    "mPrice_Rb": "819",
    "mSell_value": "43,320 - 48,000",
    "mObtainable_way": "Sugar Apple seed can be obtained in the following ways:\n\n1. Has a 0.34% chance to be in stock in the Seed Shop. A user can purchase a Sugar Apple seed for 25,000,000 Sheckles or 819 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. SnaiI, rarely yielding a seed when harvesting.\n5. Very rarely dug up by a Dog, Golden Lab or Shiba Inu\n6. Silver Prismatic Seed Pack",
    "mTrivia": "Overview\nThe Sugar Apple is a multi-harvest prismatic crop introduced in the Bizzy Bees Update.\n\nAppearance\nThe appearance of the tree is slim & vine-like, akin to Grapes or Peppers. The ends of the stems that hold the fruit have a lamp-like shape, where the Sugar Apple fruit grows. The appearance of the fruit is a partly elongated oval shape, with a gradient from a green bottom to a yellow top, along with a bumpy surface akin to a pinecone. It has a brown stem and a leaf, resembling that of a \"Teachers Apple\". The Sugar Apple also uses the Weld surface, while most other crops use the Stud surface. The Average Sugar Apple has 8 crops when normal size.\nThe Sugar Apple is one of the four Apple-Type plants added to the game.\n\nBecause of this, if the player collects a golden Sugar Apple, it will award the \"God apple!\" badge.\nThe Sugar Apple is based off Annona Squamosa.\n\nThe Sugar Apple also has a 1% chance to become ripe, which makes it turn a purplish color cosmetically does not change seed price\nThe Sugar Apple is the 6th most expensive crop at 25,000,000 Sheckles, below Burning Bud, Giant Pinecone, Elder Strawberry, Romanesco and Moon Mango.\n\nWith most mutations, it adds a gradient to the apple.\n\nThe Sugar Apple is the only fruit that can turn ripe.\n\nThe Sugar Apple is the first prismatic fruit to be used on the Roblox thumbnails of Grow A Garden.\n\nThe Sugar Apple is one of the 9 prismatic seeds along with Beanstalk, Ember Lily, Burning Bud, Giant Pinecone, Romanesco ,Elder Strawberry, Elephant Ears, and Tranquil Bloom.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 125,
    "mName": "Burning Bud",
    "mNameIcon": "burningbud.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "40,000,000",
    "mPrice_Rb": "915",
    "mSell_value": "63,175",
    "mObtainable_way": "The Burning Bud seed can be obtained in the following ways:\n1. Has a 0.29% (1/340) chance to be in stock in the Seed Shop and can be purchased for 40,000,000 Sheckles or 915 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvest.\n5. Rarely dug up by a Dog or Golden Lab.",
    "mTrivia": "\"Burning Bud\" has a chance to grow more than one branch during the growth stage. Each branch can grow into a flower independently. The experiment can be repeated through repeated planting. The current highest record is that one plant has grown four branches.\n\"Burning Bud\" is one of the few plants that can grow quite large from a low kilo, even if the final price is not ideal.\nIn the first few moments of the Burning Bud's release, players discovered that the Toucan method worked on it, but it got patched after an hour.\nPrior to its official release, the Burning Bud only grew 1 flower but had twice the price it currently has.\nThe Burning Bud was originally intended to be released earlier than the Prehistoric Update, but its release was stalled due to Roblox UK's moderation flagging the plant name as \"inappropriate\". This has since been resolved.\nThere is currently a bug where if the player has a growing/fully grown Burning Bud fruit before joining a server, it might appear invisible.\nThere is a small feature where the bottom flower is consistently much larger than the top flower.\nOn July 8th, Burning Bud came on stock for the first time and came in twice, only 10 minutes apart from each other. The chances of this occurring (based on the 0.29% chance of an appearance) would be 0.000863% (1/115900).\nThere were also 2 Sugar Apples and 1 Ember Lily in stock on the same day.\nThis and July 7th also could be the record for the most Prismatic tiers in the shop in a day, without any admin restocks.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 126,
    "mName": "Giant Pinecone",
    "mNameIcon": "giantpinecone.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "55,000,000",
    "mPrice_Rb": "929",
    "mSell_value": "64,980 - 72,000",
    "mObtainable_way": "The Giant Pinecone seed can be obtained for the first time in the following ways:\n\n1. Has a 0.29% (1/324) chance to be in stock in the Seed Shop and can be purchased for 55,000,000 Sheckles or 929 robux.\n2. Stolen by a Red Fox\n3. Very rarely dug up by a Dog, Golden Lab or Shiba Inu\n4. Snail yield when harvest\n5. Lucky Harvest\n6. Silver Prismatic Seed Pack",
    "mTrivia": "Overview\nThe Giant Pinecone is a multi-harvest, prismatic crop, obtainable via the Seed Shop.\n\nAppearance\nThe seed is a twisted shape built by layers of alternating brown and darker brown.\nThe crop is tall and has a light brown trunk with many branches coming out the sides. Additionally, it has two types of \"foliage\"; one being blocky and the other having a fern-like appearance.\nThe produce resembles a somewhat-twisted pinecone. The Giant Pinecone's color scheme is striped with a lighter brown and a darker brown.\n\nGiant Pinecone is the 3rd highest/most expensive seed from the Seed Shop, just behind the Elder Strawberry and Romanesco.\nThe Giant Pinecone’s first stock was on the 13th of July 2025.\n\nThere is currently a bug that prevents players from using items (Magnifying Glass or Special Sprays) on Giant Pinecone produces unless the item is aimed at the top of the Giant pinecone.\n\nGiant Pinecone base value was nerfed from  100,000 Sheckles to  72,577 Sheckles which means a reduction of 27.42%.\n\nIf the player gets a Lucky Harvest on a Giant Pinecone, the seed will spin down to the ground.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 127,
    "mName": "Elder Strawberry",
    "mNameIcon": "elderstrawberry.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "70,000,000",
    "mPrice_Rb": "957",
    "mSell_value": "81,225 - 90,000",
    "mObtainable_way": "1. Has a 0.25% (1/405) chance to be in stock in the Seed Shop. A user can purchase a seed for 70,000,000 Sheckles or 957 Roblux.\n2. Lucky Harvest.\n3. Stolen by a Red Fox.\n4. Snail, yield a seed when harvested.\n5. Very rarely dug up by a Dog, Golden Lab or Shiba Inu.\n6. Silver Prismatic Seed Pack",
    "mTrivia": "Overview\nThe Elder Strawberry is a multi-harvest, prismatic crop. It was added in the second part of the Zen Event, also known as the Corrupted Event.\n\nThe Elder Strawberry is classified as a Berry type crop, meaning it will be affected by items targeted at those specific crop types, such as the Berry Blusher Sprinkler.\n\nAppearance\nThe appearance of the Elder Strawberry produce is that of a real life strawberry, but with a red to dark pinkish color from top to bottom, with white dots resembling seeds, at the top there are leaves pointing diagonally upwards with flat parts at the top of the leaves.\nThe seed has a slight dark pinkish to a red gradient.\nThe seed's appearance is similar to that of a Mushroom seed.\nThe Elder Strawberry plant looks similar to a Strawberry plant, but taller and with a thicker stem, and less (or the same amount of) leaves, but can have multiple sets of leaves above the other leaves, the Elder Strawberry grows one strawberry on each leaf, the leaves of the plant are similar to the leaves of the produce.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 128,
    "mName": "Tranquil Bloom",
    "mNameIcon": "tranquilbloom.webp",
    "mTier": "Prismatic",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "84,233 - 93,333",
    "mObtainable_way": "The Tranquil Bloom can be obtained by the following ways:\n\n1. Opening any remaining Kitsune Chests 1%\n2. Opening any remaining Exotic Kitsune Chests 1%\n3. Rainbow Sack 7%",
    "mTrivia": "Overview\nThe Tranquil Bloom is a limited, multi-harvest, prismatic crop released during the Corrupted Zen Event.\n\nAppearance\nThe produce has eight leaves, each misty blue in color. The inner ring, shaped like an octagon, is a darker shade than the leaves beneath it. At the center is a star-shaped core, colored in deep navy-blue.\nThe crop can appear similar to the Zen Channeler Tree. It's white with different shades of blue on its leaves. It can also appear similar to the Corrupt Zen Channeler tree, akin to its normal version, but red.\nThe seed is a white gradient turning faintly blue, along with 8 thorn-like parts, 2 protruding out from each of its sides.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 129,
    "mName": "Elephant Ears",
    "mNameIcon": "elephantears.webp",
    "mTier": "Prismatic",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "Summer Seed Pack",
    "mPrice_Rb": "199",
    "mSell_value": "69,493",
    "mObtainable_way": "Elephant Ears seed can be obtained in the following ways:\n1. Summer Seed Pack 0.5%\n2. Exotic Summer Seed Pack 0.5%\n3. Rainbow Pack 7%",
    "mTrivia": "This is the first Prismatic crop that can be obtained from a seed pack.\n- Elephant Ears in real life are poisonous.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "No",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 130,
    "mName": "Bone Blossom",
    "mNameIcon": "boneblossom.webp",
    "mTier": "Transcendent",
    "mObtainable": "No",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "157,938",
    "mObtainable_way": "The Bone Blossom can be obtained by completing 21 Dino Quests. Quests can be skipped with  Robux, however, skipping quests does not skip the timer. Quests refresh every 12 hours, with 3 randomly generated quests every time, meaning players can obtain the bone blossom in 3.5 days if they are consistent.",
    "mTrivia": "The Bone Blossom is one of the four blossoms, other than Candy Blossom, Moon Blossom and Cherry Blossom.\nThe center part of the Bone Blossom fruit looks similar to a Peach and Nectarine.\nPrior to its release, Jandel hinted toward a new Blossom-type seed that is supposed to be better than Candy Blossom, known to be the best seed in the game. This seed is confirmed to be it, as stated by Jandel after its release.\nIt is currently the first \"Transcendent\" rarity crop introduced in the game.\nThe Bone Blossom is a slow growing crop.\nThe Bone Blossom was unobtainable without admin or tester permissions for 3 and a half days after the release of the prehistoric event, which is 84 hours.\nIt produce 4 crops at the time.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 131,
    "mName": "Artichoke",
    "mNameIcon": "artichoke.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "27,075 - 30,000",
    "mObtainable_way": "The Artichoke can be obtained during the Cooking Event as Cooking Rewards from Chris P.",
    "mTrivia": "Overview\nThe Artichoke is a limited, single harvest uncommon crop obtainable through Chris P's rewards.\n\nAppearance\nThe Artichoke is a small flower-like plant with green leaves protruding from the stem. It has a spiky purple flower on the top surrounded by jagged leaves. The stem is a tall pole like structure supporting the flower.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 132,
    "mName": "Onion",
    "mNameIcon": "onion.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "9,025 - 10,000",
    "mObtainable_way": "The Onion can be obtained in the following ways:\n\n1. Gourmet Seed Pack 40%\n2. Exotic Gourmet Seed Pack 39%\n3. Rainbow Sack 30%",
    "mTrivia": "Overview\nThe Onion is a limited, single-harvest, Uncommon crop added in the Cooking Event Update.\n\nAppearance\nIt appears to be an elongated blocky sphere with a tall green stem protruding from the top and a small leaf. The seed looks like a Coconut seed but it has the inverted stud texture. The crop looks like the Carrot in appearance.\n\nThere is a rare chance a Onion can be a reddish purple color.\n\nThe Onion is the first Onion-type fruit, with the second being the Spring Onion.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 133,
    "mName": "Twisted Tangle",
    "mNameIcon": "twistedtangle.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "239",
    "mSell_value": "22,562 - 25,000",
    "mObtainable_way": "The Twisten Tangle can be obtained by the following crafting recipe:\n\n1 Cactus Seed\n+ 1 Bamboo Seed\n+ 1 Cactus\n+ 1 Mango\n+ 50,000 Sheckles.",
    "mTrivia": "Overview\nThe Twisted Tangle is a rare, obtainable, Prickly crop that was added in the Update 1.17.0, also known as the Cooking & Trading Update.\n\nAppearance\nThe plant itself appears similarly to a Cocovine, but with a Purple and Maroon colour scheme and thorns trailing the stem.\n\nThe fruit of a Twisted Tangle appears to be a spiky version of the Lingonberry, with a dark-yellow body with a leaf on top.\n\nThe Twisted Tangle currently has a bug where only the thorns cast a shadow, rather than the entire plant and fruit.\n\nThe Twisted Tangle has the same crop model as the Cocovine.\n\nThe thorns of the Twisted Tangle tree will sometimes glow",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  }
,
  {
    "mId": 134,
    "mName": "Jalapeno",
    "mNameIcon": "jalapeno.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mMultiharvest": "No",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "27,075 - 30,000",
    "mObtainable_way": "The Jalapeno seed can be obtained in the following ways:\n\n1. Gourmet Seed Pack 25%\n2. Exotic Gourmet Seed Pack 25%\n3. Rainbow Sack 25%",
    "mTrivia": "Overview\nThe Jalapeno is a rare, multi-harvest, limited crop added in the Cooking Event.\n\nAppearance\nThe produce of the Jalapeno resembles the produce of the Pepper, but is instead lime green, lacks the fire visual effects, and does not curve upward at the tip.\n\nThe Jalapeno crop has a thin, light green stem that branches into multiple branches with dark green trapezoid-shaped leaves.\n\nJalapeno is based off Jalapeño in real life.\nThe crop takes 7 hours to grow without watering cans, making it one of the slowest-growing crops in the game.\n\nThe Jalapeno is the 4th \"Chili Pepper” type plant added into the game, after the Pepper, Dragon Pepper and Bell Pepper.\n\nThe Jalapeno Seed is the 3rd seed in the game to have collision, after the Prickly Pear and Guanabana.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 135,
    "mName": "Veinpetal",
    "mNameIcon": "veinpetal.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "459",
    "mSell_value": "22,562 - 25,000",
    "mObtainable_way": "The Veinpetal can be obtained by the following crafting recipe:\n\n1 Orange Tulip Seed\n+ 1 Daffodil Seed\n+ 1 Beanstalk\n+ 1 Burning Bud\n+ 650,000 Sheckles",
    "mTrivia": "Overview\nThe Veinpetal is a legendary crop that was added in the Update 1.17.0, also known as the Cooking & Trading Update.\n\nAppearance\nThe Veinpetal is a starfish-looking plant with a slight resemblance to a Honeysuckle, but slightly deformed & red all over, resembling a alienlike appearance.\n\nThe Veinpetal's crop is a green stem, with a chance to grow branches.\n\nThe concept for this plant originated from \"Spider Lily\" concept, a suggestion made by LetuChiyMbIsh (lvngplay) in Grow A Garden Official Discord Server.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  }
,
  {
    "mId": 136,
    "mName": "Crown Melon",
    "mNameIcon": "crownmelon.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "45,125",
    "mObtainable_way": "The Crown Melon can be obtained from the Gourmet Seed Pack or Exotic Gourmet Seed Pack.",
    "mTrivia": "The Crown Melon takes an appearance similar to a Cantaloupe. It is a white spherical melon shape, with a green stem going two ways shortly.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 137,
    "mName": "Tall Asparagus",
    "mNameIcon": "tallasparagus.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "90,250",
    "mObtainable_way": "The Tall Asparagus can be obtained from the Gourmet Seed Pack or Exotic Gourmet Seed Pack with a 4.5% chance of getting it.",
    "mTrivia": "The Tall Asparagus is a limited, multi-harvest, mythical crop obtainable in the Gourmet Seed Pack.\nIt appears to be a long, stalky-like crop that has many small spherical objects protruding from it.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 138,
    "mName": "Sugarglaze",
    "mNameIcon": "sugarglaze.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "63,175",
    "mObtainable_way": "The Sugarglaze can be obtained from the Gourmet Seed Pack or Exotic Gourmet Seed Pack with seed chance: 10%",
    "mTrivia": "The Sugarglaze takes appearance to a blocky donut-shaped body, with what appears to be chocolate icing spread on top.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 139,
    "mName": "Grand Tomato",
    "mNameIcon": "grandtomato.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "79,420",
    "mObtainable_way": "The Grand Tomato can be obtained from the Gourmet Seed Pack or Exotic Gourmet Seed Pack\nSeed chance: Gourmet Seed Pack 0.5% (1 in 200)\nRainbow Sack 7% (1 in 14)",
    "mTrivia": "It appears to be a Tomato but significantly larger (About 10x). It resembles a cubic shape & is similar to an Apple, although having a green stem & a red ImageLabel gradient.\n\nThe seed is red (With the same red ImageLabel gradient as its produce) and has the same texture as the Sugar Apple. The seed also resembles a stem-like top, showing similarities to its predecessor, the Tomato.\n\nThe crop has a varying green appearance. The crop has an Inset Stud texture, and the stem has large, green leaves growing off of it.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  },
  {
    "mId": 140,
    "mName": "Taco Fern",
    "mNameIcon": "tacofern.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mMultiharvest": "Yes",
    "mPrice": "N/A",
    "mPrice_Rb": "N/A",
    "mSell_value": "67,688",
    "mObtainable_way": "Taco Fern seed can be obtained by the following ways:\nPrismatic Cooking Rewards with a 3% chance",
    "mTrivia": "The Taco Fern is based off of the Taco, which is also the theme of the music \"It's Raining Tacos\" by ParryGripp that appeared a lot on the game's background music while Admin events ran.\nThe Taco Fern shares the same seed picture with the Sugarglaze in the Chris P.'s Cooking Rewards tab. This was likely an oversight from the developers.\nThe Seed looks like the Bone Blossom's one.",
    "mShop": 1,
    "mNameShop": "Lucky Harvest",
    "mStock": "1",
    "mCoin": "Yes",
    "mRb": "Yes",
    "mValue": "0"
  }
]
}
