{
  "version": 2,
  "data": 
  [
  {
    "mId": 1,
    "mName": "Starfish",
    "mNameIcon": "starfish.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Summer Egg",
    "mHatch_chance": "50%",
    "mPassive": "You're a Star: Gains additional XP per second",
    "mGeneral": "The Starfish is a common pet released in the Summer Update. It has a 50% chance to be obtained from the Common Summer Egg. It has 1,500 Hunger.",
    "mTrivia": "Appearance\nThe Starfish has five arms coming off of its body. It has a feminine face in the center which resembles a smile. It is mostly a coral-pink color with a lighter-colored vertical stripe down each of its arms.\n\nTrait\nYou're a Star: Gains an additional ~6 xp per second!\nDoes not grant additional exp to other pets.\nStarfish gains experience even when its hunger is 0.\nIt outranks Brown and Grey Mouse as a sacrificial pet for leveling up fast and getting extra pet slots / egg slots / pet inventory space.\n\nIt is currently the best pet to age up and exchange for the extra slots.\n\nDepends on graphic quality settings, its face can changed from a joyful style look to a neutral like look when zooming out the camera.\nThis is one of the fastest growing Pets in the game.\n\nStarfish is one of the slowest pets in the entire game. This can be seen in game when the starfish is compared to other pets.",
    "mValue": "300000000"
  },
  {
    "mId": 2,
    "mName": "Crab",
    "mNameIcon": "crab.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Summer Egg",
    "mHatch_chance": "25%",
    "mPassive": "Pinch Pocket: Occasionally goes to another player and pinches them and grants you a small amount of sheckles",
    "mGeneral": "The Crab is a Common pet released in the Summer Update. It can be obtained from the Common Summer Egg. It has 3,000 Hunger.",
    "mTrivia": "Appearance\nThe Crab resembles a stereotypical cartoonish crab, having oversized claws and two eyes sticking out above its head. It's a vibrant red color and keeps this color all around. It also has three pairs of legs as well as a smile on the front of its face.\n\nTrait\nPinch Pocket: Occasionally goes to another player and pinches them, granting sheckles. Pinched players do not lose their sheckles. Crab does not seem to have a run time limit.\nThe Crab will still pinch the player from below if the player is high up. (on a plant, cosmetic, etc.)\nThe Crab cannot fall down of the map.\n\nThe Crab is one of the few pets that can interact directly with players. The other pets are the Raccoon, the Fennec Fox, the Kitsune and the Red Fox.\n\nThe Crab is the only pet that interacts with other players, and not with its owner.",
    "mValue": "15000000"
  },
  {
    "mId": 3,
    "mName": "Seagull",
    "mNameIcon": "seagull.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Summer Egg",
    "mHatch_chance": "25%",
    "mPassive": "When the player get a Lucky Harvest: There is a 4 percent chance to get a extra seed!",
    "mGeneral": "The Seagull is a Common pet released in the Summer Update. It can be obtained from the Common Summer Egg for   1,000,000 or  29. It has 3,500 Hunger.",
    "mTrivia": "Appearance\nThe Seagull resembles that of a real bird having a pair of wings and feet as well as a long beak. It is mostly white with tuft of feathers on its head as well as a beak which fades from burnt orange to amber in color. It has two small feet that are a candy-pink. It also has two large black eyes on the front of its face.\n\nTrait\nWhen the player get a Lucky Harvest: There is a 4 percent chance to get a extra seed!\n\n(Formerly) Scavenger: Shoveling plants have a percent chance to drop the equivalent seed. Does not work on fruits.\nThe Seagull flies slightly crooked.\n\nThe Seagull was the first pet to modify the Shovel.\n\nThe Seagull ability is lost like the Squirrel, due to an exploit people abused.",
    "mValue": "87000000"
  },
  {
    "mId": 4,
    "mName": "Bunny",
    "mNameIcon": "bunny.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
    "mPassive": "Every 40s, eats a carrot at a 1.5x value bonus.",
    "mGeneral": "The Bunny is a Common Pet added in the Animal Update. It can be obtained by hatching the Common Egg with a chance of 33.33%. The Bunny has 1,100 hunger.",
    "mTrivia": "Appearance\nThe Bunny is a white bunny with pink inner-ears, black facial features, and white ears, head, body, limbs, and tail.\n\nTrait\nEvery ~40 seconds, the Bunny searches for a Carrot, Chocolate Carrot or Wild Carrot on the garden and eats it, automatically selling it at a marked up price of 1.5x value. The sell value multiplier increases as the Bunny ages.\n\nIf no Carrots are planted in the garden or the only ones available have been favorited, Bunnies will wander around aimlessly.\nThe Bunny's passive is similar to the Black Bunny and the Bagel Bunny.\n\nIt is also similar to the Panda. Instead of eating Carrots, the Panda eats Bamboo.\n\nThis pet doesn’t give money upon eating a carrot similar to the Panda.",
    "mValue": "10000000"
  },
  {
    "mId": 5,
    "mName": "Dog",
    "mNameIcon": "dog.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
    "mPassive": "Every 60s, 5% chance to dig up a random seed.",
    "mGeneral": "The Dog is one of the 23 pets added in the Grow a Garden Update 1.04.0. It can be obtained by hatching a Common Egg with a 33.33% chance. The Dog has 1,000 hunger. Its ability is identical to the Golden Lab but with a ~5% chance instead of a ~10% chance like the Golden Lab.",
    "mTrivia": "Appearance\nThe Dog is a predominantly white dog with brown ears and a brown spot over its left eye with black facial features. It shares the same model as the Golden Lab.\n\nTrait\nEvery ~60 seconds, the Dog will attempt to dig up a random seed (only Seed Shop plants), with a ~5% chance to succeed.\nThe Dog and the Frog are the only pets that have another variant from the same egg with an increased ability chance/cooldown.\n\nThe probability of a Dog actually triggering its trait is half that of the Golden Lab, even though they perform the same function.\n\nThe Dog, Golden Lab, and Shiba Inu all have similar abilities, which is digging.",
    "mValue": "10000000"
  },
  {
    "mId": 6,
    "mName": "Golden Lab",
    "mNameIcon": "golden_lab.webp",
    "mTier": "Common",
    "mObtainable": "Yes",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
    "mPassive": "Digging friend: ~10% chance to dig up a random Seed Shop seed every 60 seconds.",
    "mGeneral": "The Golden Lab is a common pet added in Update 1.04.0. It can be obtained by hatching the Common Egg with a chance of 33.33%. The Golden Lab has 1,200 hunger.",
    "mTrivia": "Appearance\nThe Golden Lab is a recolor of the Dog, having brown ears and a beige body, and lacks spots on its body & face. It also has a stud-like texture on its entire body.\n\nTrait\nEvery 60 seconds, the Golden Lab will attempt to dig up, with a 10% chance to succeed, a random seed that can be found in the Seed Shop, regardless of if it's on stock or not. Higher rarity seeds have a lower chance of being dug up.\nThe Golden Lab is based off the Labrador Retriever in real life.\n\nThe Golden Lab's trait has a 2x higher chance of succeeding than the Dog's, even though they are from the same egg with the same chances.",
    "mValue": "10000000"
  },
  {
    "mId": 7,
    "mName": "Bee",
    "mNameIcon": "bee.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "65%",
    "mPassive": "Every ~25m, flies to a nearby fruit and pollinates it, applying the Pollinated mutation.",
    "mGeneral": "The Bee is an Uncommon Pet introduced in the Bizzy Bee Event update. There is a 65% chance of hatching it from the Bee Egg, which could be previously purchased for  30,000,000 Sheckles or 129 Roblux, until it was added in the Honey Merchant for 18 Honey. The Bee has 25,000 hunger.",
    "mTrivia": "Appearance\nThe Bee's model resembles the Honey Bee and Disco Bee, but features a mostly yellow body with black stripes, black antennae, and light gray wings.\n\nTrait\nEvery ~25 minutes, the Bee flies to a nearby fruit and pollinates it, applying the Pollinated Mutation. When pollination occurs, the following message appears: Bee applied Pollinated mutation to [Fruit].\nFavorite Foods\nThe following foods fill Bee's hunger by large increase. The Bee prefers flowers type foods. Mutated food versions increase the amount of hunger points.\n\nRose (Around 10%)\nPink Lily (Around 60%)\nLilac (Around 80%)\n\nThe Bee is one of the pets with the highest cooldown in the game.",
    "mValue": "1000000000000"
  },
  {
    "mId": 8,
    "mName": "Black Bunny",
    "mNameIcon": "black_bunny.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
    "mPassive": "Every 40 seconds, the Black Bunny searches for a Carrot on the garden and eats it, automatically selling it at a marked up price of 1.5x value.",
    "mGeneral": "The Black Bunny is an Uncommon pet added in the Animal Update. It can be obtained from hatching the Uncommon Egg with a chance of 25%, and is a variant of the Bunny. The Black Bunny has 1,300 hunger.",
    "mTrivia": "Appearance\nThe Black Bunny is a recolor of the Bunny, having a black body, pink inner ears, and a pink nose.\n\nTrait\nEvery ~40 seconds, the Black Bunny searches for a Carrot, Chocolate Carrot or Wild Carrot on the garden and eats it, automatically selling it at a marked up price of ~1.5x value.\n\nThe Black Bunny's passive is similar to the Bunny and the Bagel Bunny.\nIt is also similar to the Panda. Instead of eating Carrots, the Panda eats Bamboo.\n\nAlthough Black Bunny is ranked as uncommon, its passive is worse than the Bagel Bunnys, which is ranked as Common.",
    "mValue": "35000000"
  },
  {
    "mId": 9,
    "mName": "Cat",
    "mNameIcon": "cat.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
    "mPassive": "Every 80 seconds, the Cat will nap for 10 seconds. New fruit within 10 studs will be 1.25x larger.",
    "mGeneral": "The Cat is an Uncommon pet added in the Animal Update. It has a 25% chance of hatching from an Uncommon Egg.",
    "mTrivia": "Appearance\nThe Cat has a gray body, with dark gray whiskers and markings. The inner ears and nose are both pink, and the eyes and mouth are both black. It shares the same model with the Orange Tabby and the Moon Cat.\n\nTrait\nEvery 80 seconds, the Cat naps for 10 seconds. Nearby plants within 10 studs will have their new fruit grow 1.25x larger.",
    "mValue": "200000000"
  },
  {
    "mId": 10,
    "mName": "Chicken",
    "mNameIcon": "chicken.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
    "mPassive": "Increases egg hatch speed by 10%.",
    "mGeneral": "The Chicken is an Uncommon pet added in the Animal Update. It can be obtained from hatching the Uncommon Egg with a chance of 25%. Its maximum hunger is 3,400.",
    "mTrivia": "Appearance\nThe Chicken has a yellow body, orange feet and beak, and a red comb.\n\nTrait\nThe Chicken passively increases egg hatch speed by approximately 10%. This boost can stack with other pets as well as the Rooster, Kiwi and the Blood Kiwi.",
    "mValue": "25000000"
  },
  {
    "mId": 11,
    "mName": "Deer",
    "mNameIcon": "deer.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
    "mPassive": "Gives a 3% chance for berry plants to stay when harvested.",
    "mGeneral": "The Deer is an Uncommon Pet added in the Animal Update. It can be obtained by hatching the Uncommon Egg with a chance of 25%. The Deer has 2,500 hunger.",
    "mTrivia": "Appearance\nThe Deer is a brown deer with beige antlers and black eyes. It has dark hooves, a beige patch below its mouth, and a beige underside. It shares its model with the Spotted Deer.\n\nTrait\nThe Deer has a passive trait which gives a 3% chance for berry plants to replant themselves when harvested.",
	"mValue": "10000000"
  },
  {
    "mId": 12,
    "mName": "Jackalope",
    "mNameIcon": "jackalope.webp",
    "mTier": "Uncommon",
    "mObtainable": "Yes",
    "mObtaining_method": "Sprout Egg",
    "mHatch_chance": "31%",
    "mPassive": "Every 100 seconds, thumps its feet and has a ~15% chance to mutate a nearby fruit, applying the Sandy mutation!",
    "mGeneral": "The Jackalope is an obtainable, limited time pet, that was released on the Beanstalk Event Update.",
    "mTrivia": "Appearance\nThe appearance of the Jackalope is similar to the mythical animal which goes by the same name, it features a full light brownish body with a pink nose and dark brown antelope horns.\n\nTrait\nEvery 100 seconds, thumps its feet and has a 15% chance to mutate a nearby fruit, applying the Sandy mutation.",
	"mValue": "400000000"
  },
  {
    "mId": 13,
    "mName": "Maneki-neko",
    "mNameIcon": "manekineko.webp",
    "mTier": "Uncommon",
    "mObtainable": "No",
    "mObtaining_method": "Zen Egg",
    "mHatch_chance": "40%",
    "mPassive": "Fortune Cat: Every 2 minutes, waves and invites good fortune that grants 8% chance to refund fruit back to player’s inventory for 10s! Rarer fruit have rarer chance to refund.",
    "mGeneral": "The Maneki-neko is an uncommon pet, obtained from the Kitsune Chest (during the Zen Event) or from the Exotic Kitsune Chest.\nThe Maneki-neko is a pure white cat with a red collar and gold bell. Its left paw is raised in a beckoning manner and has a Gold (Koban) coin on its forehead.",
    "mTrivia": "Every 2 minutes, waves and invites good fortune that grants 8% chance to refund fruit back to player’s inventory for 10s! Rarer fruit have rarer chance to refund.",
	"mValue": "75000000000"
  },

  {
    "mId": 14,
    "mName": "Monkey",
    "mNameIcon": "monkey.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "8.33%",
    "mPassive": "~2.5% to refund fruit back to your inventory. Rarer plants have a lower chance to refund.",
    "mGeneral": "The Monkey is a rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 8.33%.",
    "mTrivia": "Appearance\nThe Monkey closely resembles that of a real monkey, having two large ears, two arms and legs, and a long, curly tail. It is mostly a dark, chocolaty brown with a bright and paler brown color for its inner ears, face, underbelly, hands, and feet. It has rectangular black eyes and a dark brown smile.\n\nTrait\nThe Monkey has a passive trait that gives a ~2.5% chance of refunding a plant back to the player when selling. Rarer plants have a lower refund chance.",
	"mValue": "15000000"
  },
  {
    "mId": 15,
    "mName": "Orange Tabby",
    "mNameIcon": "orange_tabby.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "33.33%",
    "mPassive": "Every 90 seconds, naps for 15 seconds and causes new fruit within 15 studs to grow 1.5x larger.",
    "mGeneral": "The Orange Tabby is a Rare pet added in the Animal Update. It can be obtained from hatching the Rare Egg with a chance of 33.33%. The Orange Tabby has 1,500 hunger.",
    "mTrivia": "Appearance\nThe Orange Tabby is a recolor of the Cat, having an orange body and pink inner ears & nose.\n\nTrait\nEvery 90 seconds, the Orange Tabby takes a 15 second nap. After the nap, any new fruit within 15 studs will grow 1.5x larger.\n\nThis pet shares a similar ability with Moon Cat and Cat.\n",
	"mValue": "150000000000"
  },
  {
    "mId": 14,
    "mName": "Pig",
    "mNameIcon": "pig.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "16.67%",
    "mPassive": "Every 118 seconds, the pig emits a 15 second aura that grants a 2x chance for plants within 15 studs to grow variant fruits.",
    "mGeneral": "The Pig is a Rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 16.67%.",
    "mTrivia": "Appearance\nThe Pig has a pink body, ears, and snout, and brown hooves. The Pig's face is on one end of the body rather than a head.\n\nTrait\nEvery 118 seconds, emits an aura for 15 seconds granting 2x chance for new fruit to grow as variants within 15 studs! (Rainbow and Gold)",
	"mValue": "60000000000"
  },
  {
    "mId": 15,
    "mName": "Rooster",
    "mNameIcon": "rooster.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "16.67%",
    "mPassive": "Increases egg hatch speed by ~20%.",
    "mGeneral": "The Rooster is a rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 16.67%.",
    "mTrivia": "Appearance\nThe Rooster has a blue base with an orange head along with orange feet, a red beak, and a red comb. It shares most of its model with the Chicken.\n\nTrait\nThe Rooster has a passive trait that increases egg hatch speed by ~20%.\nIf the user holds 8 roosters, eggs hatch in 16.77% of the time they would normally need (example: Bug Egg: Base time = 8 hours -> 1.34 hours, which is roughly 1 hour 20 minutes.",
	"mValue": "75000000000"
  },
  {
    "mId": 16,
    "mName": "Spotted Deer",
    "mNameIcon": "spotteddeer.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "25%",
    "mPassive": "Gives a 5% chance for berry plants to stay when harvested.",
    "mGeneral": "The Spotted Deer is a Rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 25%. The Spotted Deer has 2,500 hunger.",
    "mTrivia": "Appearance\nThe Spotted Deer is a recolor of the Deer, with white spots on its snout and forehead.\n\nTrait\nGives a 5% chance for berry plants to stay when harvested.",
	"mValue": "50000000000"
  },
  {
    "mId": 17,
    "mName": "Tsuchinoko",
    "mNameIcon": "tsuchinoko.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mObtaining_method": "Corrupted Zen Egg",
    "mHatch_chance": "Unknown",
    "mPassive": "Fat Snake: Increased lucky harvest chance!",
    "mGeneral": "Tsuchinoko is a Rare pet, obtained in the Corrupted Zen Egg.",
    "mTrivia": "The Tsuchinoko's appearance is characterized by its stocky, mallet-like body resembling of a snake, sharing it's similarities to the Tsuchinoko from Japanese Folklore.",
	"mValue": "0"
  },
  {
    "mId": 18,
    "mName": "Flamingo",
    "mNameIcon": "flamingo.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Summer Egg",
    "mHatch_chance": "30%",
    "mPassive": "Flamboyance: Occasionally stands on one legs and all nearby plants will grow incredibly fast",
    "mGeneral": "The Flamingo is an obtainable, rare pet released in the Summer Update and is obtainable in the Rare Summer Egg with a 17% of being in the egg shop.",
    "mTrivia": "Appearance\nThe Flamingo resembles a stereotypical cartoonish flamingo. It has a long neck, legs, and beak. It is mostly a bubblegum pink, having its entire body the same color, as well as most of its beak and pair of wings. Its long, curved legs are more of a salmon pink color and its beak has a black tip on the end of it. Its face consists of two large eyes with a white sclera and black pupils.\n\nTrait\nFlamboyance: Every ~4 minutes, stands on one leg for ~15 seconds. All crops and produces within ~13 studs grow ~15x faster.\n\nMoving plants using Trowel close to Flamingo works.",
	"mValue": "1500000000000"
  },
  {
    "mId": 19,
    "mName": "Toucan",
    "mNameIcon": "toucan.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Summer Egg",
    "mHatch_chance": "25%",
    "mPassive": "Tropical Lover: Makes all nearby Tropical type plants have increased variant chance and grow bigger",
    "mGeneral": "The Toucan is a rare pet released in the Summer Update.",
    "mTrivia": "Appearance\nThe appearance of the Toucan is similar to that of the Seagull's, being a bird. It is mostly black with an overall stubby appearance. It has small wings and feet, but a large beak. Its feet are cerulean, and its beak is a scarlet color on top that fades into a sunset orange. It also has two white circles around its light brown and black eyes.\n\nTrait\nTropical Lover: Grants all tropical plants within ~25 studs, a ~1.2x size bonus and a ~1.18x variant chance bonus!\n\nMoving plants closer to Toucan with Trowel does not work. The plant must be existing already.\n\nThe Toucan makes a chirping sound occasionally.",
	"mValue": "650000000000"
  },
  {
    "mId": 20,
    "mName": "Sea Turtle",
    "mNameIcon": "seaturtle.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Summer Egg",
    "mHatch_chance": "20%",
    "mPassive": "Every ~11minutes, shares its wisdom with a random pet, granting 1k bonus experience!\nEvery 150seconds, splashes water at a nearby fruit and it has some chance to get Wet mutation!",
    "mGeneral": "The Sea Turtle is an obtainable, rare pet released in the Summer Update",
    "mTrivia": "Appearance\nThe Sea Turtle has a simple shape. It is flat with four flippers, a large head and a dome-shaped shell. Its body is a grassy green, and its shell is a dark, foresty green. It has one black eye on either side of its face and doesn't appear to have a mouth.\n\nTrait\nShell Share: Every ~12 minutes, shares its wisdom with a random pet, granting ~1000 bonus experience!\n\nWater Splash: Every ~118 seconds, water splashes at a nearby fruit and it has a 10% chance to become Wet!\n\nThe splashed water does not make the growing plants and growing fruits/crops grow bigger nor faster. It can only affect fully grown Fruits/Crops nearby.\n\nSea turtle can try to apply wet mutation to fruits with drenched or frozen mutation, the fruits however wont get it even if applied successfully\n\nIf players want to make crops become Frozen from Sea Turtle and Polar Bear/Sushi Bear, it's recommended to put down Sea Turtle first, then Polar Bear/Sushi Bear after player's crop got the Wet mutation. It prevent player's fruits from being splash by Sea Turtle after gotten Frozen on a fruit",
	"mValue": "200000000000"
  },
  {
    "mId": 21,
    "mName": "Orangutan",
    "mNameIcon": "orangutan.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Summer Egg",
    "mHatch_chance": "15%",
    "mPassive": "Helping Hands: When crafting, each material has a chance for it not to be consumed",
    "mGeneral": "The Orangutan is a rare pet released in the Summer Update.",
    "mTrivia": "Appearance\nThe Orangutan has a more complex build than many pets. It has a round face, two large muscular arms, and two legs behind it. It also has noticeable hands and feet with them being smaller in diameter than its arms and legs. Its back is a subtle orange color, and the rest of its \"fur\" is a burnt orange color. Its face, ears, and paws are an ashy gray. Its face has two black eyes, two large ears, and a snout with two nostrils and a smile, noticeably, the orangutan has flanges, meaning all Orangutans in grow a garden are exclusively male.\n\nTrait\nHelping Hands: When crafting, each material has a ~3.49% chance for it not to be consumed.",
	"mValue": "20000000000000"
  },
  {
    "mId": 22,
    "mName": "Seal",
    "mNameIcon": "seal.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Summer Egg",
    "mHatch_chance": "10%",
    "mPassive": "Seal the Deal: When selling pets, has a (0.22 * Weight + 2.5)% chance to get the pet back as its egg equivalent!",
    "mGeneral": "The Seal is an obtainable, rare pet released in the Summer Update.",
    "mTrivia": "Appearance\nThe Seal has a fairly simple appearance. Its entire body is one color, being a slightly brownish gray. It has its head picked up by its neck, two flippers, on either side of it towards the front of its body, and a tail. On its face, it has a black eye on each side of its face and a snout that pops out the front that has a small brown nose.\n\nTrait\nSeal the Deal: When selling pets, has a (0.22 * Weight + 2.5)% chance to get the pet back as its egg equivalent ( cap at 8% ). Cannot refund rainbow/exotic/premium eggs.\n\nMedium Toy boosts the passive by 0.5 %\n\nSmall Toy boosts the passive by 0.25 %\nThe Seal has percentage cap of 8% max, meaning the best possible egg return outcome with maxed seals and all unlocked pet slots is 64% .\n\nThe seal can't recover exotic/premium/rainbow eggs because of a bug people found.\n\nPreviously, Nihonzaru has a maximum buff of 1.32 % on this pet before it was nerfed,",
	"mValue": "18000000000"
  },
  {
    "mId": 23,
    "mName": "Honey Bee",
    "mNameIcon": "honey_bee.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "25%",
    "mPassive": "Every ~20 minutes flies to a nearby fruit and pollinates it, giving it a pollinated mutation",
    "mGeneral": "The Honey Bee is a rare Pet introduced in the Bizzy Bee Event update.\n\nThe Honey Bee can be obtained in the Bee Egg, which can be bought for 18 Honey or 129 Roblux.\n\nThe Honey Bee has 25,000 hunger.",
    "mTrivia": "Appearance\nSharing the same model as a Bee, but with an overall honey glazed appearance. The Honey Bee features yellow-gold wings, a more orange-tinted look and falling honey particles.\n\nTrait\nEvery ~20m, flies to a nearby fruit and pollinates it, applying the Pollinated mutation. This trait is exactly same with Bee, but with shorter cooldown.\nThe Honey Bee is sometimes confused with the Golden Bee, because of its similar appearance.\n\nThis pet is an upgrade of the Bee.",
	"mValue": "200000000000"
  },
  {
     "mId": 24,
    "mName": "Wasp",
    "mNameIcon": "wasp.webp",
    "mTier": "Rare",
    "mObtainable": "Yes",
    "mObtaining_method": "Anti Bee Egg",
    "mHatch_chance": "55%",
    "mPassive": "Every 30m, the Wasp flies to a nearby fruit and pollinates it, applying the Pollinated mutation.\nEvery 10m, the Wasp stings a random pet and advances its ability cooldown by 60s.",
    "mGeneral": "The Wasp is a rare pet introduced in the Friendship Update. The Wasp has 28,000 hunger. It can be obtained from the Anti Bee Egg with a 55% chance, which could be bought from the Limited Time Shop for 149 Roblux, or crafted with 1 Bee Egg and 25 Honey.",
    "mTrivia": "Appearance\nThe Wasp has a curved figure, with a darkened yellow body and a brighter yellow-black striped abdomen, sporting two pairs of dark yellow wings and an aggressive face.\n\nTrait\nEvery 30 minutes, the Wasp flies to a nearby fruit and pollinates it, applying the Pollinated mutation. When pollination occurs, the following message appears: Wasp applied Pollinated mutation to the Plant.\nEvery 10 minutes, the Wasp stings a random pet and advances its ability cooldown by 60 seconds.",
	"mValue": "150000000000"
  },
  {
    "mId": 25,
    "mName": "Hedgehog",
    "mNameIcon": "hedgehog.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mObtaining_method": "Night Egg or 10 Lunar Points",
    "mHatch_chance": "49%",
    "mPassive": "Grants prickly fruit in a 30 studs radius a <1.50x size bonus!",
    "mGeneral": "The Hedgehog has a stubby appearance. It has four small feet, two ears, and a chubby face. Its face has noticable cheeks and a snout with a nose that comes off the top. It has a neutral expression, having two black eyes and a neutral mouth. On its back, it has spikes resembling quills. Its body is a cream color, and its quills, nose, and inner ears are a softer brown.\nOccasionally grants Cactus, Durian, Pineapple, Celestiberry, Nectar Thorn, Prickly Pear and Dragon Fruit a 1.51x size bonus. This trait is stackable, meaning that the more Hedgehogs a player has equipped on their farm, the bigger size will bonus they will get for their prickly fruits.",
    "mTrivia": "Hedgehogs are primarily nocturnal, which make them more active at night.\nThe Hedgehog's trait is stackable.",
	"mValue": "1000000000000"
  },
  {
    "mId": 26,
    "mName": "Kiwi",
    "mNameIcon": "kiwi.webp",
    "mTier": "Rare",
    "mObtainable": "No",
    "mObtaining_method": "160 Lunar Points",
    "mHatch_chance": "49%",
    "mPassive": "Every 60 seconds, decreases hatch time of egg with the highest remaining hatch time by 25 seconds.",
    "mGeneral": "The Kiwi is a bird with a brown body and head, that has a yellow beak and feet along with black eyes.",
    "mTrivia": "he Kiwi's' passive is to go to the egg with the highest remaining hatch time and sing above it, making it decrease the egg's time by 25 seconds every minute.\nHowever, the Kiwi will not do anything if there are no eggs on the player's plot or the eggs have no remaining time left, rendering it useless.",
	"mValue": "500000000"
  },
  {
    "mId": 27,
    "mName": "Grey Mouse",
    "mNameIcon": "grey_mouse.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "35.71%",
    "mPassive": "Whisker Wisdom - Gains 500 bonus experience every 10 minutes. Increases the player's movement speed by 10% (Slightly increases as the player's pet(s) get(s) older).",
    "mGeneral": "The Grey Mouse is a Legendary pet added in the Blood Moon Event Update. It can be obtained with a 35.71% chance from hatching the Mythical Egg. It has 15,000 hunger.",
    "mTrivia": "Appearance\nThe Grey Mouse has gray fur, pink inner ears, and black facial features.\n\nTrait\nThe Grey Mouse's passive trait allows it to gain ~500 bonus experience every ~10 minutes and increase the player's movement speed by ~10%.\n\nNote: The ~500 bonus XP only applies to itself and does not affect other pets.\n\nThe Grey Mouse, Brown Mouse, Starfish, Mochi Mouse and Tanuki (when it rolls for experience) are the only pets that gain bonus experience.",
	"mValue": "2000000000"
  },
  {
    "mId": 28,
    "mName": "Tarantula Hawk",
    "mNameIcon": "tarantulahawk.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Anti Bee Egg - Premium Anti Bee Egg",
    "mHatch_chance": "30%",
    "mPassive": "Wasp Pollinator - Every 25m, the Tarantula Hawk flies to a nearby fruit and pollinates it, applying the Pollinated mutation.\nTarantula Stinger - Every 5m, the Tarantula Hawk stings a random pet and advances its ability cooldown by ~ 80s.",
    "mGeneral": "The Tarantula Hawk is a legendary Pet introduced in the Friendship Update.\n\nThe Tarantula Hawk has 28,000 hunger.\n\nThe Tarantula Hawk can be obtained from the Anti Bee Egg, which can be bought from the Limited Time Shop for  149 or crafted at the Cosmetics Shop for:\n1 Bee egg\n 25 Honey",
    "mTrivia": "Appearance\nThe Tarantula Hawk resembles the Wasp, but has a different texture with a blue body and red-yellow wings. It's based off of its real-life counterpart, being the tarantula hawk.\n\nTrait\nRarer than the Wasp, the Tarantula Hawk shares its traits but is better, with a 25-minute pollination cooldown (vs. 30), a 5-minute sting cooldown (vs. 10), and an ability cooldown reduced by 80 seconds (vs. 60).\n\nThe ability \"Tarantula Stinger\" can reduce the cooldown of pet mutation abilities, if the pet already doesn't have an active ability.\n\nWhen the Tarantula Hawk first released, the ability \"Tarantula Stinger\" used to target pets without an active ability. This was later patched.",
	"mValue": "400000000000"
  },
  {
    "mId": 29,
    "mName": "Raptor",
    "mNameIcon": "raptor.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "35%",
    "mPassive": "Clever Claws: 2% - 2.5% chance fruit gets Amber mutation after collecting! Rarer plants have a lesser chance to mutate.\nRaptor Dance: Grants additional 14% - 14.5% increase to player movement speed!",
    "mGeneral": "The Raptor is a Legendary pet added in the Prehistoric Event and is obtainable from the Dinosaur Egg with a 35% chance, or from the DNA Converter.\nThe Raptor seems to look like the Jurassic Park Raptors, but with green skin, and a long tail. (Not to be confused with the T-Rex's appearance)",
    "mTrivia": "Clever Claws: 2% - 2.5% chance fruit gets Amber mutation after collecting! Rarer plants have a lesser chance to mutate. (+0.0475% mutation chance per level up.)\nRaptor Dance: Grants additional 14% - 14.5% increase to player movement speed! (+0.0475% player movement speed per level up.)\nThe holding style of this pet is very unique, as instead of holding the pet in one hand, the player carries it in two hands and hold it above their head.",
	"mValue": "100000000000"
  },
  {
    "mId": 30,
    "mName": "Triceratops",
    "mNameIcon": "triceratops.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "32.5%",
    "mPassive": "Tri-Horn: Every 3:33m, rams into 3 random plants and advances their growth by 33:33m. Has a 15.18% chance to do it again each time.",
    "mGeneral": "The Triceratops is a Legendary pet obtainable from the Dinosaur Egg with a 32.5% chance or through the DNA Converter during the Prehistoric Event. It is known for its powerful passive ability that speeds up plant growth, making it ideal for passive farming strategies.\nThe Triceratops has a red body with a rugged texture, complemented by three prominent grey horns on its face. It walks with a lumbering gait and has a spiked tail. Its design is a homage to the Triceratops from Dinosaur Simulator.",
    "mTrivia": "Tri-Horn: Every 3 minutes and 33 seconds, the Triceratops charges into 3 random plants and advances each of their growth stages by 33 minutes and 33 seconds. Each time this activates, there is a 15.18% chance for the ability to trigger again, stacking multiple times.\nThis ability can significantly speed up the growth of slow-yield crops, especially when the player is offline or managing large gardens.\nThe Triceratops is one of only a few pets with a repeating-trigger passive ability.\nIts ability references the number 3 repeatedly: 3 plants, 3:33 minute cooldown, and 33:33 growth advancement, referring to the Triceratop's 3 horns\nIt shares color themes with its appearance in the game Dinosaur Simulator.",
	"mValue": "200000000000"
  },
  {
    "mId": 31,
    "mName": "Stegosaurus",
    "mNameIcon": "stegosaurus.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "32.5%",
    "mPassive": "Prehistoric Doubling: Small chance to duplicate harvested fruit\nPrehistoric Harvester: Increased chance to duplicate harvested prehistoric type plant",
    "mGeneral": "The Stegosaurus is a Legendary pet added in the Prehistoric Event and is obtainable from the Dinosaur Egg or from the DNA Converter.\nThe Stegosaurus is formed as a real-life Stegosaurus, featuring a green body with red scales protruding outward on top.",
    "mTrivia": "Prehistoric Doubling: ~8% chance to duplicate harvested fruit (Rarer crops have a lower chance of being duplicated).\nPrehistoric Harvester: ~5% extra chance to duplicate harvested prehistoric-type fruits.",
	"mValue": "200000000000"
  },
  {
    "mId": 32,
    "mName": "Pterodactyl",
    "mNameIcon": "pterodactyl.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "Unknow",
    "mPassive": "Sky Reptile: Occasionally applies Windstruck mutation to multiple nearby fruits with a chance of Twisted!\nAir Time: Grants additional 14,39% increase to player jump height!",
    "mGeneral": "The Pterodactyl is a Legendary pet obtainable from the Dinosaur Egg or from the DNA Converter.\nThe Pterodactyl has a blue body, featuring a yellow sting and a light-blue beak. It has a pair of light blue legs.",
    "mTrivia": "Sky Reptile: Occasionally applies Windstruck mutation to multiple nearby fruits with a chance of replacing with Twisted!\nAir Time: Grants additional 14.39% increase to player's jump height.",
	"mValue": "1500000000"
  },
  {
    "mId": 33,
    "mName": "Turtle",
    "mNameIcon": "turtle.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "2.13%",
    "mPassive": "All sprinklers last ~20% longer.",
    "mGeneral": "The Silver Monkey is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. It has 8,000 hunger.",
    "mTrivia": "The Silver Monkey gives an 8% chance to refund crops back to a player's inventory. Rarer crops have a lower chance of receiving these refunds. For example, a Carrot has a higher chance of being refunded than a Beanstalk. This chance stacks with other Silver Monkeys, as well as Monkeys.",
	"mValue": "200000000000"
  },
  {
    "mId": 34,
    "mName": "Caterpillar",
    "mNameIcon": "caterpillar.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Bug Egg 40%\nExotic Bug Egg 25%",
    "mHatch_chance": "40%",
    "mPassive": "Leaf lover passive : Leafy Plants grow 1.5x-2.5x faster.",
    "mGeneral": "The Caterpillar is a legendary Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a chance of 40%.",
    "mTrivia": "Appearance\nThe Caterpillar is a short, green insect with 6 dark green legs and 2 light green ones. Its body is made up of two large black eyes and several small segments with mainly light and dark green body parts.\n\nTrait\nThe Caterpillar has a passive trait which makes all leafy plants grow 1.5x-2.5x faster. This only applies to plants directly from seeds.",
	"mValue": "250000000000"
  },
  {
    "mId": 35,
    "mName": "Snail",
    "mNameIcon": "snail.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Bug Egg 30%\nExotic Bug Egg 40%",
    "mHatch_chance": "40%",
    "mPassive": "Extra 5.08% chance harvested plants drop seeds. Rarer plants have a lower chance to drop seeds",
    "mGeneral": "The Snail is a legendary pet added in the Animal Update. It has a 30% chance of being hatched from a Bug Egg. The Snail has 12,000 hunger.",
    "mTrivia": "Appearance\nThe Snail has a beige body and eye stalks, as well as a brown shell with a swirl pattern. Its eyes and mouth are both black.\n\nTrait\nThe Snail provides an additional 5.08% chance for a harvested plant to yield a \nHistory\nUpdate 1.04.0 - The Snail was released.\nUpdate 1.14.0 - The Snail's tier was changed from Mythical to Legendary.",
	"mValue": "8000000000"
  },
  {
    "mId": 36,
    "mName": "Petal Bee",
    "mNameIcon": "petal_bee.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "4%",
    "mPassive": "Every ~25 minutes, it flies to a nearby fruit and pollinates it, applying Pollinated mutation. ~1% chance Flower type fruit stays after harvest.",
    "mGeneral": "in: Pages with broken file links, Pets, Legendary, Mutation-Applying Pets\nPetal Bee\nView source\n\nPetal Bee\n\nThe Petal Bee\nInfo\nTier\n\nObtaining method\nBee Egg\nHatch Chance\n4%\nPassive\nEvery ~25 minutes, it flies to a nearby fruit and pollinates it, applying Pollinated mutation. ~1% chance Flower type fruit stays after harvest.\nObtainable?\nYes\nDate Added\nMay 31, 2025\n\n\n\nContents\n1\tOverview\n2\tAppearance\n3\tTrait\n4\tGallery\n\nUnmute\n\nAdvanced Settings\n\nFullscreen\n\nPause\n\nRewind 10 Seconds\n\nUp Next\n\n\nOverview\nThe Petal Bee is a Legendary Pet added in the Bizzy Bee Event update.\n\nThe Petal Bee can be obtained from the Bee Egg with a 4% hatch chance, which can be purchased for 18 Honey or 129 Roblux (From the Honey Merchant).\n\nThe Petal Bee has 25,000 hunger.",
    "mTrivia": "Appearance\nThe Petal Bee resembles the Bee, but it's recolored as white with pink stripes and antennae. It also has a pink flower trail.\n\nTrait\nEvery ~25 minutes, flies to a nearby fruit and pollinates it, applying Pollinated mutation.\n\n~1% chance Flower type fruit stays after harvest.",
	"mValue": "700000000000"
  },
  {
    "mId": 37,
    "mName": "Moth",
    "mNameIcon": "moth.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Anti Bee Egg\nPremium Anti Bee Egg",
    "mHatch_chance": "13,75%",
    "mPassive": "Silk song:\nEvery ~13 minutes, restores 100% hunger of a random pet by singing to it",
    "mGeneral": "The Moth is a legendary Pet introduced in the Friendship Update.\n\nThe Moth has 25.000 hunger.\n\nObtainment\nThe Moth can be obtained from the Anti Bee Egg, which can be bought from the Limited Time Shop for 149 Roblux or crafted at the Bizzy Bear for:\n\n 25 Honey + 1x Bee Egg = 1x Anti Bee Egg",
    "mTrivia": "Appearance\nIt is a light blue color with large black square eyes and a small smiling mouth. It has two short black antennae on top of its head, six stubby legs, and a pair of long translucent wings. Looks something like a honeybee just a grey variant and a smaller body.\n\nTrait\nEvery ~13 minutes, restores 100% hunger of a random pet by singing to it.\nHaving two active moths can totally restore the entire pets' hunger so they don't have to be fed anymore.",
	"mValue": "2000000000000"
  },
  {
    "mId": 38,
    "mName": "Scarlet Macaw",
    "mNameIcon": "scarletmacaw.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Paradise Egg",
    "mHatch_chance": "8%",
    "mPassive": "Verdant Bird: Every 8:00m, 16% chance to mutate a nearby fruit, applying the Verdant mutation.",
    "mGeneral": "The Scarlet Macaw is an obtainable Legendary pet from the Summer Update.",
    "mTrivia": "Appearance\nThe appearance of the Scarlet Macaw closely resembles the Toucan in terms of proportions and build. It has a pair of wings, two feet, and a small beak. It has a vibrant red body that covers most of it. It has a bright yellow stripe on its wings, followed by a blue tip on the rest of its wings. It has pale yellow feet, white circles around its eyes and a black beak.\n\nIts shape is identical to the Hyacinth Macaw pet, but the colors are much different.\n\nTrait\nVerdant Bird: Every ~8:00m, 16.00% chance to mutate a nearby fruit (chance can vary by age), applying the Verdant mutation.\n\nWhen performing this, the Scarlet Macaw will have a rainbow aura with feathers surrounding it.\n\nWhen there are no nearby fruits, the Scarlet Macaw skips its ability and the cooldown starts again.\nThe Scarlet Macaw has another variant, called Hyacinth Macaw, that instead of giving the Verdant Mutation, gives the Cloudtouched Mutation.\n\nIn the new updated Pet Menu, the Scarlet Macaw appears to have two cooldowns. One is ~8 seconds and appears to do nothing, and the second one is its normal ability.",
	"mValue": "25000000000000"
  },
  {
    "mId": 39,
    "mName": "Ostrich",
    "mNameIcon": "ostrich.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Paradise Egg",
    "mHatch_chance": "40%",
    "mPassive": "Eggsperience: Grants pets hatched from eggs an age bonus",
    "mGeneral": "The Ostrich is an obtainable legendary pet released in the Summer Update.",
    "mTrivia": "Appearance\nThe appearance of the Ostrich is unique to most other pets. It has a long neck and slightly long legs. It also has two wings and a puffy tail in the back. Its body is black as well as most of its wings and tail, but its wings and tail are tipped white. Its face, neck, and feet are of a neutral beige color. Its face has two black eyes, a large, pale orange beak, and pink cheeks.\n\nTrait\nEggsperience: Grants pets hatched from eggs an age bonus.\n\nThis trait can be stacked with other active ostriches.\n\nThere was a bug where Ostrich does not increase pet weight according to their level. This is a massive nerf because usually, when pets levels up, their weight increases too.\n\nPet Stats (Ability Cooldown, Ability Chance, etc) actually depends on pet weight, not level (although there are Pet Stats which stays the same no matter the level and weight, such as Triceratops).\n\nThis bug was patched after a while.\n\nThe Ostrich's maximum age bonus per hatch is capped at 10, beyond this point, weight nor age affects the ability further. This makes it ill advised to continue leveling the Ostrich or hatching a Giant variant once the cap is reached.\n\nAlthough the Ostrich's maximum age bonus is limited, stacking multiple ostriches together can increase the pet's age beyond 10, making it possible to instantly hatch a pet with up to level 80 (8 maxed age bonus ostriches at once.\n\nDespite being the most common pet in the Paradise Egg, it can be considered to be immensely useful under certain conditions due to its unique ability.",
	"mValue": "500000000000"
  },
  {
    "mId": 40,
    "mName": "Peacock",
    "mNameIcon": "peacock.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Paradise Egg",
    "mHatch_chance": "30%",
    "mPassive": "Utter Beauty: Occasionally fans its feathers and all nearby pets will advance ability cooldowns",
    "mGeneral": "The Peacock is a legendary pet released in the Summer Update. It can be obtained with a 30% chance by hatching a Paradise Egg.",
    "mTrivia": "Appearance\nThe Peacock is a very colorful pet like its real-life counterpart. It is built very uniquely with a long neck, a crest on its head, a long beak, two wings, two legs, and a feathery tail. Its body and most of its crest are a royal blue, and its wings, tail, and crest tips are a vibrant green. Its beak is a sandy tan color as well as some specks on the top and bottom of each feather on its tail. Its legs are a sunny yellow as well as the spots around its eyes. It has a feminine pupil shape with eyelashes on each eye.\n\nTrait\nUtter Beauty: Occasionally fans its feathers every ~10 minutes and all nearby pets will advance ability cooldowns by ~60 seconds.\n\nMax buff can gain from a Nihonzaru are:\n\nCooldown : -36 seconds.\nRange : +1.2 studs.\nTime Advanced : +3.6 seconds.\nMedium Toy buff are:\n\nCooldown: -121 seconds.\nRange: +4 studs.\nTime Advanced : +13 seconds.\nSmall Toy is the same as Medium toy but equal 1/2 it.\n\nAs of v1747, Minimum cooldown is now 15 seconds.",
	"mValue": "330000000000"
  },
  {
    "mId": 41,
    "mName": "Capybara",
    "mNameIcon": "capybara.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Paradise Egg",
    "mHatch_chance": "21%",
    "mPassive": "Chill Zone: All pets within 15.48 studs won`t lose hunger and will gain 3.48xp every second.",
    "mGeneral": "The Capybara is an obtainable legendary pet released in the Summer Update.",
    "mTrivia": "Appearance\nThe appearance of the Capybara is quite simple. It has a large head and snout as well as a chubby body. It has little feet as well as small ears on the top of its head. It's a cocoa-colored brown with darker brown ears, front of its snout, and bottom of its feet. Each of its feet have three small toes on it. The front of its snout also has a smile.\n\nTrait\nChill Zone: All pets within ~15.5 studs won't lose hunger and will gain ~3XP every second before aging. The boost increases as the Capybara ages.\nAbility is always active. Once another pet gets close to the Capybara, they will immediately gain extra XP per second, and they will not lose hunger.\n\nUnlike how Owls work, the Capybara's ability affects pets with no hunger remaining.\n\nCapybara's ability will stack with other capybaras if they are in the same area of effect.\n\nBefore zen update part 2. Capybara's ability stop from time to time when either having multiple players. or when unequipping and equipping pets. As of now it has been fixed.",
	"mValue": "1500000000000"
  },
  {
    "mId": 42,
    "mName": "Sand Snake",
    "mNameIcon": "sandsnake.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Oasis Egg\nPremium Oasis Egg With 149 Roblux",
    "mHatch_chance": "34,5%",
    "mPassive": "Has a 1.31% - 3% to duplicate an item or seed when purchasing from the gear or seed shop.",
    "mGeneral": "The Sand Snake closely resembles its real-life counterpart, except for the fact it is made of cuboids. It is a tan color, with a darker back. It has 2 fangs and a red tongue visible.",
    "mTrivia": "Buying from the seed/gear shop has a 1.45% to duplicate the bought item.",
	"mValue": "700000000000"
  },
  {
    "mId": 43,
    "mName": "Meerkat",
    "mNameIcon": "meerkat.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Oasis Egg\nPremium Oasis Egg With 149 Roblux",
    "mHatch_chance": "45%",
    "mPassive": "Every 7:14m goes to another pet and does a lookout. That pet advanced cooldown by 21.06s! Has a 15.53% chance to do it again after each lookout.",
    "mGeneral": "The meerkat has a small, upright body with a tan-colored face and chest. Its back, legs, and head are a darker brown, with a mane-like shape around the top of its head. It has short legs, a stubby tail, and a small black nose. Its eyes are square and shiny.\nEvery 7:14m goes to another pet and does a lookout. That pet advanced cooldown by 21.06s! Has a 15.53% chance to do it again after each lookout.",
    "mTrivia": "Despite being less than 1 kilogram in real-life, the meerkat in-game weighs less or more than 1 kilogram.\nMeerkats aren't really friendly towards humans but, they are kept as pets in-game.",
	"mValue": "350000000000"
  },
  {
    "mId": 44,
    "mName": "Cow",
    "mNameIcon": "cow.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "42,55%",
    "mPassive": "Causes all plants within 8 studs to grow 1.12x faster.",
    "mGeneral": "The Cow is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. The Cow has 9,500 hunger.\nThe Cow is white with orange horns and black eyes. It has dark hooves, a pink muzzle, and a patch of orange hair on its left eye.",
    "mTrivia": "The Cow has a passive trait which causes all plants within 8 studs to grow 1.12x faster.",
	"mValue": "3000000000"
  },
  {
    "mId": 45,
    "mName": "Polar Bear",
    "mNameIcon": "polarbear.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "2.13%",
    "mPassive": "Every ~90s, ~10% chance to turn a nearby crop chilled or frozen.",
    "mGeneral": "The Polar Bear is a Legendary pet added in the Animal Update. It can be obtained by hatching a Legendary Egg with a 2.13% chance.\nThe Polar bear has a white body and ears, and a slightly yellow-tinted snout. Its paws and facial features are black.",
    "mTrivia": "Every ~90 seconds, ~10% chance a nearby fruit becomes Chilled or Frozen.",
	"mValue": "4000000000000"
  },
  {
    "mId": 46,
    "mName": "Sea Otter",
    "mNameIcon": "seaotter.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "10.64%",
    "mPassive": "Every ~24.70 seconds, sprays water on a nearby plant!",
    "mGeneral": "The Sea Otter is a Legendary pet added in the Animal Update.\n\nIt can be obtained by hatching the Legendary Egg with a chance of 10.64%. It has 30,000 hunger.",
    "mTrivia": "Appearance\nThe Sea Otter has dark grey fur, white lower body, black facial features, and brown paws.\n\nTrait\nEvery ~24.70 seconds, the Sea Otter sprays water on the nearest plant within ~15 studs.\n\nThe Sea Otter does not apply any Crop Mutations to the affected plant — it only speeds up growth, similar to the Watering Can. The ability is completely random; there are no higher or lower chances for specific rarities.",
	"mValue": "800000000"
  },
  {
    "mId": 47,
    "mName": "Silver Monkey",
    "mNameIcon": "silvermonkey.webp",
    "mTier": "Legendary",
    "mObtainable": "Yes",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "42.55%",
    "mPassive": "8% chance to refund crops.",
    "mGeneral": "The Silver Monkey is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. It has about 8,000 hunger.",
    "mTrivia": "Appearance\nThe Silver Monkey is a recolor of the Monkey with light and dark gray fur.\n\nTrait\nThe Silver Monkey gives an 8% chance to refund crops back to a player's inventory. Rarer crops have a lower chance of receiving these refunds. For example, a Carrot has a higher chance of being refunded than a Candy Blossom.\n\nThis chance stacks with other Silver Monkeys, as well as Monkeys.\nWhen in the Pet Mutator, the Silver Monkey will appear as a regular Monkey. This is most likely a bug.\n\nIf a Silver Monkey that is actively placed in the player's garden has the Inverted mutation, only the eyes invert color. The rest of the model stays the same. This is most likely a bug, as the pet icon for the Inverted Silver Monkey shows the entire pet model with inverted colors.\n\nSame with the Golden mutation. The Silver Monkey will only have golden rays radiating from it instead of the golden color.",
	"mValue": "600000000000"
  },
  {
    "mId": 48,
    "mName": "Panda",
    "mNameIcon": "panda.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Be present for the first hour of the Animal Update",
    "mHatch_chance": "",
    "mPassive": "8% chance to refund crops.",
    "mGeneral": "Every ~3 minutes, the Panda will eat bamboo off the players' plot and sell it for ~1.5x value boost.",
    "mTrivia": "Every ~3 minutes, the Panda goes to a bamboo in the garden and eats it, immediately selling it for a ~1.5x value increase. The player still receives the money after the Panda eats the bamboo. If there's no bamboo in the garden, the Panda will walk around the garden aimlessly.\nThe Panda is currently the rarest pet.\nThe Panda gives 0 Coins when sold, similar to Cooked Owl and Bald Eagle.\nIt cannot recognize mutations, so it will sell bamboo with mutations for the same price as a normal bamboo.\nThe Panda was the first pet that couldn't be obtained from an egg.",
	"mValue": "15000000000000"
  },
  {
    "mId": 49,
    "mName": "Blood Hedgehog",
    "mNameIcon": "bloodhedgehog.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "23,000,000 Coins in Blood Moon Shop",
    "mHatch_chance": "",
    "mPassive": "Sanguine Spike - Makes prickly fruits grow bigger, higher prickly fruit variant chance",
    "mGeneral": "The Blood Hedgehog is a Legendary pet added in the Blood Moon Event update.\nThe Blood Hedgehog has 30,000 hunger.\n\nAppearance\nThe Blood Hedgehog shares the same model as the Hedgehog, however is now a deep red, and has neon red pupils.",
    "mTrivia": "The Blood Hedgehog's trait is Sanguine Spike, which grants a ~2x size within ~25 studs and ~1.17x variant bonus with in ~20 studs of a prickly fruit. The ability can stack with other hedgehog abilities:\n\nNew fruit weight = Base weight * (1 + 1 for each Blood Hedgehog + 0.5 for each normal Hedgehog)\nThe Blood Hedgehog always applied its abilities only in a specific range of a plant, but this was only recently specified in the ability description, (as confirmed by a developer) causing some to believe it was nerfed.",
	"mValue": "1000000000000"
  },
  {
    "mId": 50,
    "mName": "Frog",
    "mNameIcon": "frog.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Night Egg 17.63%\nPremium Night Egg 14%",
    "mHatch_chance": "N/A",
    "mPassive": "Every >20 minutes, croaks and a random nearby Plant will advance growth by 24 hours.",
    "mGeneral": "The Frog is a Legendary pet added in the Lunar Glow Event 2025. It can be obtained by hatching the Night Egg with a chance of 14%. There is a different variant of the Frog called the Echo Frog.\nThe Frog has a lime green and dark green body. The nose and the mouth are dark green, and the eyes are black. It shares the same model with the Echo Frog.",
    "mTrivia": "Every ~20 minutes, croaks and a random nearby plant will advance growth by 24 hours.",
	"mValue": "250000000000"
  },
  {
    "mId": 51,
    "mName": "Mole",
    "mNameIcon": "mole.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "Yes (Via Summer Harvest Event Rewards)\nNight Egg 23.5%\nPremium Night Egg 22%",
    "mHatch_chance": "N/A",
    "mPassive": "Every ~80 seconds, digs down underground to find treasure. Can dig up gear or sheckles.",
    "mGeneral": "The Mole is a Legendary pet added in the Lunar Glow Event. It can be obtained by hatching the Night Egg with a chance of 22%.\n\nThe mole has a hunger of 50,000.",
    "mTrivia": "Every <80 seconds, digs into the ground and finds Sheckles or Gears.\nMoonlit status of either type on crops does not currently seem to boost much hunger, aside from celestial crops from Meteor Showers.\nHere are the list of all items that the Mole could find:\n1. 900-10,800 Coins\n2. Watering Can\n3. 1-3 Trowel(s)\n4. Recall Wrench\n5. Sprinklers:\n  Basic Sprinkler\n  Advanced Sprinkler\n  Godly Sprinkler\n  Master Sprinkler\n6. Lightning Rod",
	"mValue": "250000000000"
  },
  {
    "mId": 52,
    "mName": "Moon Cat",
    "mNameIcon": "mooncat.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": " 100,000,000 Coins\n439 Roblux\nSummer Harvest\n",
    "mHatch_chance": "N/A",
    "mPassive": "Moon Nap: Cat naps in a random spot in your farm, emitting an aura that boosts nearby fruit size.\nMoon Harvest: Grants a 6.06% chance for Night type plants to replant when harvested.",
    "mGeneral": "The Moon Cat has a lavender body, with neon lavender whiskers, mouth and markings. The inner ears and nose are both pink, and the eyes are black.\nIt shares the same model with the Cat and the Orange Tabby.",
    "mTrivia": "Every ≈70 seconds, naps for ≈20 seconds. New fruit within ≈20 studs will be ≈1.5x larger. ≈6% chance moon type fruits stays after harvest.",
	"mValue": "35000000000000"
  },
  {
    "mId": 53,
    "mName": "Bald Eagle",
    "mNameIcon": "baldeagle.webp",
    "mTier": "Legendary",
    "mObtainable": "No",
    "mObtaining_method": "7,400,000 Coins or 899 Roblux",
    "mHatch_chance": "N/A",
    "mPassive": "Wings of Freedom: Every ~7m, takes flight and spreads its wings. All eggs advance their hatch time by ~70s! ~70% chance for the time to be multiplied by ~2x.",
    "mGeneral": "The Bald Eagle is a Legendary pet obtainable by purchasing from the 4th July Event 2025.\nThe Bald Eagle appears as a standard eagle, with a red-white striped hat ringed with white stars on a blue ring- which resembles the American flag. The Bald Eagle is also the mascot for the 4th July Event 2025, as it is seen on top of the red, white and blue striped stand.",
    "mTrivia": "Wings of Freedom: Every ~7m, takes flight and spreads its wings. All eggs advanced their hatch time by -70s! ~70% chance for the time advanced to be multiplied by ~2x.\n\nWhen performing it's ability, the Bald Eagle will jump in the air and spin once before spreading it's wings, firing fireworks for every egg on the garden if successful.\nLike the Cooked Owl and the Panda, the Bald Eagle sells for 0 sheckles.",
	"mValue": "6000000000000"
  },
  {
    "mId": 54,
    "mName": "Brown Mouse",
    "mNameIcon": "brown_mouse.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "26.79%",
    "mPassive": "Gains 750 bonus experience every 8 minutes. Increases the player's jump height by 12%.",
    "mGeneral": "The Brown Mouse is a Mythical Pet added in the Blood Moon Event Update. It can be obtained with a 26.79% chance from hatching the Mythical Egg. It has 15,000 hunger.",
    "mTrivia": "Appearance\nThe Brown Mouse is a recolor of the Grey Mouse with brown fur.\n\nTrait\nThe Brown Mouse's passive trait allows it to gain ~750 bonus experience every ~8 minutes and increases the player's jump height by ~12%.\n\nNote: The ~750 bonus XP only applies to itself and does not affect other pets.\n\nThe Brown Mouse, Grey Mouse, Starfish, Mochi Mouse, and Tanuki (when it rolls for experience) are the only pets that grant bonus experience for themselves.\n\nThe Brown Mouse’s ability stops when they reach zero hunger.\n\nThe Brown Mouse used to be the fastest aging pet with its passive trait, but the Starfish has taken its role as the best pet to use for pet/egg/pet-storage upgrades.",
	"mValue": "6000000000"
  },
  {
    "mId": 55,
    "mName": "Giant Ant",
    "mNameIcon": "giant_ant.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Bug Egg 25%\nExotic Bug Egg 30%",
    "mHatch_chance": "Bug Egg 25%\nExotic Bug Egg 30%",
    "mPassive": "~10% chance for harvested crops to duplicate. Rarer fruits duplicate less often. ~5% extra chance for Candy type fruit to duplicate!",
    "mGeneral": "The Giant Ant is a Mythical Pet added in the Animal Update. The Giant Ant can be obtained by hatching the Bug Egg with a chance of 25% to hatch. The Giant Ant has 18,000 hunger.",
    "mTrivia": "Appearance\nThe Giant Ant has a blue body and head, as well as 6 dark blue legs and an antennae. It has two body segments: a torso and an abdomen.\n\nTraits\nThe Giant Ant's first passive trait gives a ~10% chance to duplicate a fruit being harvested (If the crop is mutated, then all the mutations will also be copied and transferred to the crop duplicated by the Giant Ant). The rarer a fruit is, the less likely the fruit is to duplicate.\n\nThe Giant Ant's second passive trait gives an extra ~5% chance for candy type plants to be duplicated when harvested.\n\nUpon testing, The Giant Ant gains more hunger points when fed Lilac or Candy Blossom,as opposed to other fruit. -(A base Candy Blossom will usually give about 90-100% hunger.)",
	"mValue": "450000000000"
  },
  {
    "mId": 56,
    "mName": "Praying Mantis",
    "mNameIcon": "praying_mantis.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Bug Egg 4%\nExotic Bug Egg 4%",
    "mHatch_chance": "Bug Egg 4%\nExotic Bug Egg 4%",
    "mPassive": "The Praying Mantis is a Mythical Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a 4% chance and has a hunger bar of 55,000.",
    "mGeneral": "The Praying Mantis is a Mythical Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a 4% chance and have 55,000 hunger bar.",
    "mTrivia": "Appearance\nIt has 4 small green legs and 2 big green claws. On its head, there are 2 black square eyes, big dark green mouth, and 2 antennas with light neon dots on it.\n\nTrait\nEvery ~80 seconds, prays for ~10 seconds, granting ~1.5x variant chance within ~10 studs! (Rainbow, Gold and Silver)\nThe Praying Mantis increases variant chance of a growing fruit/crop in an already existing plant. This means using Trowel to move plants will not work.\n\nIncreased Variant Chance means increased chance of getting Growth Mutations (Gold or Rainbow).\n\nThe Praying Mantis does not magically give growth mutations to fully grown fruits/crops unlike Butterfly and Dragonfly.",
	"mValue": "450000000000"
  },
  {
    "mId": 57,
    "mName": "Red Giant Ant",
    "mNameIcon": "red_giant_ant.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "8.93%",
    "mPassive": "5% chance harvested crops duplicate! Rarer crops have lower chance to duplicate. 5% extra chance for Fruit type crops to duplicate!",
    "mGeneral": "The Red Giant Ant is a Mythical pet added in the Blood Moon Event Update. It can be obtained from hatching the Mythical Egg with a chance of 8.93%. It has 15,000 hunger.",
    "mTrivia": "Appearance\nThe Red Giant Ant is a recolor of the Giant Ant with a red integument.\n\nTrait\nThe Red Giant Ant's passive trait grants a 5% chance to duplicate crops when harvesting, with lower odds for rarer crops. Fruit-type crops have an extra 5% chance to duplicate.",
	"mValue": "450000000000"
  },
  {
    "mId": 58,
    "mName": "Squirrel",
    "mNameIcon": "squirrel.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "26.79%",
    "mPassive": "Seed Stash: Small chance to not consume a use when using the Reclaimer. Gains additional XP per second.",
    "mGeneral": "The Squirrel is a Mythical Pet added in the Blood Moon Event Update. It can be obtained by hatching the Mythical Egg, with a chance of 26.79%. It has 15,000 hunger.",
    "mTrivia": "Appearance\nThe Squirrel has brown fur, a beige underside, short ears, black eyes, and a black nose, closely resembling a real-life squirrel.\n\nTrait\nThe Squirrel's trait grants a small chance for a use to not be consumed when using the Reclaimer tool. Also gains additional XP per second.\n\nThis section is a trivia section. Please relocate any relevant information into other sections of the article.\n\nIn versions 1385 and earlier, squirrels gave players a 2.5% chance to keep a seed after planting. People exploited this to duplicate exclusive seeds. This is an intentional feature and still works, just not for exclusive seeds anymore.\n\nThe Squirrel lost its ability to duplicate seeds and was given the replacement ability which now save Reclaimed uses- presumably due to seed duplication exploiting.\nThe Squirrel is one of the 5 pets that can gain additional XP. (The 5 pets are, Starfish, Grey Mouse, Brown Mouse, Mochi Mouse, and Squirrel)",
	"mValue": "275000000000"
  },
  {
    "mId": 59,
    "mName": "Bear Bee",
    "mNameIcon": "bearbee.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "5%",
    "mPassive": "Wanna-bee:\nEvery 25 minutes applies the HoneyGlazed mutation to a random fruit",
    "mGeneral": "The Bear Bee is a mythical Pet added in the Bizzy Bee Event update. It can be obtained in the Bee Egg for 30,000,000 Sheckles or 129 Roblux.\n\nThe Bear Bee has 45,000 hunger.",
    "mTrivia": "Appearance\nThe Bear Bee resembles a brown bear, wearing a bee costume.\n\nTrait\nWanna-Bee: Every 25:00 minutes, goes to a nearby fruit and applies the HoneyGlazed mutation on that said fruit. Every level decreases the cooldown by ~3 seconds.\n\nIt is a reference to the Bear Bee from Bee Swarm Simulator.\n\nThis is the only pet in the game that gives the mutation HoneyGlazed.",
	"mValue": "16000000000000"
  },
  {
    "mId": 60,
    "mName": "Butterfly",
    "mNameIcon": "butterfly.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Anti Bee Egg\nPremium Anti Bee Egg",
    "mHatch_chance": "1%",
    "mPassive": "Rainbow Flutter:\nEvery ~30m, flies to a nearby fruit with 5+ mutations, removes 5 mutations from it and turns it rainbow! Ignores favorited fruit.",
    "mGeneral": "The Butterfly is a Mythical Pet introduced in the Friendship Update.\n\nThe Butterfly has 26,000 hunger.",
    "mTrivia": "Obtainment\nThe Butterfly can be obtained from the Anti Bee Egg, which can be crafted at the Cosmetics Shop in 2 hours for:\n\n1 Bee Egg + 25 = 1 Anti Bee Egg\nBee Egg is still obtainable by the Honey Merchant. So players cannot get it until they have more honey or buy it with Robux.\nAlternatively, the butterfly used to be obtainable by purchasing the Premium Anti Bee Egg for  149\n\nAppearance\nThe Butterfly has a long, narrow purple body with a slightly rounded head and several small, evenly spaced black legs underneath. Its wings are large and angular, extending outward in a symmetrical \"V\" shape. Each wing is light purple and decorated with two vertical black rectangles near the center and four orange circular markings closer to the tips. The wings are flat and wide, with sharp corners and a stepped, block-like shape. The entire model has a clean, geometric design that emphasizes symmetry and stylized detail.\n\nTrait\nEvery ~30m, flies to a nearby fruit with 5+ mutations, removes all Crop Mutations from it and turns it Rainbow! (Ignores favorited fruit).\n\nGold and Silver are Variants, not an Environmental Mutation so it won't work if it has only 4 Environmental Mutation and 1 Variant.\nThe Butterfly is one of the only three pets that can apply growth-variant mutations to plants. The second one being the Dragonfly and the third one being the Golden Bee.\n\nDespite having an \"only\" 50x multiplier, Rainbow is the best mutation in the game. All Environmental Mutations are multiplied by Variants, meaning that the the 50x Rainbow value of the fruit acts as it's base value, and all other Mutations therefore become 50x more valuable as well.",
	"mValue": "950000000000000"
  },
  {
    "mId": 61,
    "mName": "Brontosaurus",
    "mNameIcon": "brontosaurus.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "1%",
    "mPassive": "Giant Incubator: Pets hatched from eggs have higher base weight",
    "mGeneral": "The Brontosaurus is a Mythical pet added in the Prehistoric Event and is obtainable from the Dinosaur Egg with a 1% chance or from the DNA Converter.\nThe Brontosaurus features a long-brown neck, with a light-brown body and brown feet.",
    "mTrivia": "Giant Incubator: Pets hatched from eggs have a 5.2% increase in base size and weight! This size bonus is capped at 30% per egg and does not apply to Brontsauruses.",
	"mValue": "55000000000000"
  },
  {
    "mId": 62,
    "mName": "Pack Bee",
    "mNameIcon": "packbee.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": " Crafted by adding an Anti Bee Egg, Sunflower, Purple Dahlia, and  250 Honey",
    "mHatch_chance": "Crafted",
    "mPassive": "Increases backpack size by ~25 and pollinates a plant every ~25 minutes",
    "mGeneral": "The Pack Bee is a Mythical pet, which can be purchased for 799 Roblux or crafted with Anti Bee Egg, Sunflower, Purple Dahlia, and 250 Honey in the crafting station.",
    "mTrivia": "Appearance\nThe Pack Bee resembles a normal Bee, but with a workers helmet and a crate hanging under it.\n\nTrait\nThe Pack Bee increases backpack size for holding fruits, plants, seeds, and tools by ~25. As it ages, the size increases for how much more the player can store. It does not increase the pet storage size, however.\n\nThe Pack Bee has an incredibly similar look to a Working Bee, yet isn't multicolored.\n\nBefore the Mega Harvest update, the Pack Bee only had a passive ability to increase item storage.",
	"mValue": "7000000000000"
  },
  {
    "mId": 63,
    "mName": "Mimic Octopus",
    "mNameIcon": "mimicoctopus.webp",
    "mTier": "Mythical",
    "mObtainable": "Yes",
    "mObtaining_method": "Paradise Egg",
    "mHatch_chance": "1%",
    "mPassive": "Mimicry: Every 20m mimics and copies an ability from another pet and performs its ability!",
    "mGeneral": "The Mimic Octopus is a mythical pet added during the Summer Harvest Event, which can be obtained from the Paradise Egg.",
    "mTrivia": "If a Mimic Octopus copies a pet with two abilities like Queen Bee, it will only perform the first ability.\nThe copied pet's cooldown doesn't continue, instead it will restart. This is a huge nerf to its mimic ability.\nDespite being an \"Octo\"pus, the Mimic octopus only has 6 tentacles.\nMimicry ability cooldown is reset upon joining a new server.\nMimicry is closely similar to Queen Bee's For The Queen Ability. The only difference is the one performing the ability.\nDespite having 1% chance from the Paradise Egg, Mimic Octopus’s tier is mythical not divine unlike raccoon, queen bee, or dragonfly.",
	"mValue": "700000000000000"
  },
  {
    "mId": 64,
    "mName": "Hyacinth Macaw",
    "mNameIcon": "hyacinthmacaw.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Oasis Egg\n149 Robux or 10 points at the Harvest Shop",
    "mHatch_chance": "5%",
    "mPassive": "Every 8:00m, 15.63% chance to mutate a nearby fruit, applying the Cloudtouched mutation!",
    "mGeneral": "The Hyacinth Macaw resembles its real-life counterpart but it's much chunkier.",
    "mTrivia": "Every 8:00m, 15.63% chance to mutate a nearby fruit, applying the Cloudtouched mutation.",
	"mValue": "4000000000000"
  },
  {
    "mId": 65,
    "mName": "Axolotl",
    "mNameIcon": "axolotl.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Oasis Egg 15%\nPremium Oasis Egg",
    "mHatch_chance": "15%",
    "mPassive": "6.76% chance Summer type fruit stays after collecting!",
    "mGeneral": "The Appearance of the Axolotl is light blue, with 6 external gills surrounding it's head, tail, 4 legs. with blush right below the eyes.",
    "mTrivia": "6.76% chance Summer type fruit stays after collecting!",
	"mValue": "1400000000000"
  },
  {
    "mId": 66,
    "mName": "Hamster",
    "mNameIcon": "hamster.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "15 Summer Coins or 449 Roblux",
    "mHatch_chance": "",
    "mPassive": "Every ~3 minutes, runs in a hamster wheel and boosts crafting speed by ~30.35% for ~19s!",
    "mGeneral": "The Hamster is a Mythic pet released in the Summer Update. It could be obtained from the harvest Shop for 15 Summer Coins or 449 Roblux. It has 15,000 Hunger.\nThe Hamster appears quite similar to the Golden (Syrian) breed of hamsters. It is very square with cartoonishly large cheek pouches and pointy ears.",
    "mTrivia": "Hamster Wheel: Every ~3 Minutes, runs in a hamster wheel and boosts crafting speed by ~30% for ~19s!",
	"mValue": "1400000000000"
  },
  {
    "mId": 67,
    "mName": "Chicken Zombie",
    "mNameIcon": "chickenzombie.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Join the game before the 1.06.0 update",
    "mHatch_chance": "",
    "mPassive": "Every 25m, 20% chance a nearby fruit becomes Zombified!\nIncreases egg hatch speed by 10%",
    "mGeneral": "The Chicken Zombie is a limited, mythical pet that was introduced in Update 1.06.0, on May 17, 2025.\n\nThe Chicken Zombie is not obtainable anymore\nPlayer had to join the game before the update released to receive it.\nThe Chicken Zombie is a drooling zombie, wearing a straw hat & blue overalls sitting on the top of a chicken.",
    "mTrivia": "Every ~25m, ~20% chance a nearby fruit becomes Zombified! Increases egg hatch speed by ~10%",
	"mValue": "60000000000000"
  },
  {
    "mId": 68,
    "mName": "Firefly",
    "mNameIcon": "firefly.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Joining a Grow A Garden Test Server",
    "mHatch_chance": "",
    "mPassive": "Every 79.12s, 3.07% chance nearby fruit becomes Shocked.",
    "mGeneral": "The Firefly is an unobtainable, unreleased, mythical pet.\nThe Firefly has a glowing transparent abdomen that emits faint light. It appears as a small, brown bug, with similar structure to that of a bee.",
    "mTrivia": "Once ~80 seconds, 3% chance the Firefly will turn a nearby crop shocked.\nObtaining the Firefly can prove difficult, having to join a Grow A Garden Test Server in order to obtain it.\nSupposedly, this pet is discontinued and will not be featured in the main game.\nHowever, this is not confirmed and is a possibility.\n",
	"mValue": "0"
  },
  {
    "mId": 69,
    "mName": "Owl",
    "mNameIcon": "owl.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "530 Luna Points",
    "mHatch_chance": "",
    "mPassive": "Boosts all the active pets XP by around 0.20 XP each second!",
    "mGeneral": "The Owl is a limited mythical Pet added in the Lunar Glow Event 2025. It could have been obtained by completing the last milestone for the Wise Old Owl.\nThe Owl resembles its nightly counterpart, but with a white-blue color scheme and a glowing white aura.",
    "mTrivia": "The Owl boosts all active pet XP by around 0.20 XP each second. When aging up, the increase goes up by 0.01 XP.\nThe Owl is one of four Owl types, the other three being the Night Owl, Cooked Owl, and Blood Owl.",
	"mValue": "1300000000000"
  },
  {
    "mId": 70,
    "mName": "Golden Bee",
    "mNameIcon": "goldenbee.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Unknown (probably by being there when an update goes live)",
    "mHatch_chance": "",
    "mPassive": "Pollinator: Occasionally pollinates fruit & Golden Harvest: Harvested fruit has a chance to turn to gold",
    "mGeneral": "The Golden Bee is an unobtainable pet of Mythical tier.\nThe Golden Bee resembles the Bee, though it is entirely covered in gold. It also looks similar to the Honey Bee.",
    "mTrivia": "The Golden Bee has the ability to occasionally pollinate fruit and there is a small chance harvested fruit will turn gold.",
	"mValue": "0"
  },
  {
    "mId": 71,
    "mName": "Echo Frog",
    "mNameIcon": "echofrog.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Night Egg 8.23%\nPremium Night Egg 10%",
    "mHatch_chance": "10%",
    "mPassive": "Every <5 minutes, croaks and causes a random nearby plant to advance growth by 24 hours.",
    "mGeneral": "The Echo Frog is a Mythical pet added in the Lunar Glow Event. It can be obtained by hatching the Night Egg with a chance of 10%. It is an alternative & better version of the Frog. It has 50,000 hunger.\nThe Echo Frog is a recolor of the Frog. It features a blue body, dark blue facial features, and black eyes. Its ventral side is a lighter shade of blue and its adorned with neon blue spots around its body.",
    "mTrivia": "Every ~5 minutes, croaks and causes a random nearby plant to advance growth by 24 hours.",
	"mValue": "600000000000"
  },
  {
    "mId": 72,
    "mName": "Cooked Owl",
    "mNameIcon": "cookedowl.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Join the game before the 1.10.0 update",
    "mHatch_chance": "",
    "mPassive": "Let Him Cook - Every 15 minutes, 15.35% chance to cook a nearby fruit. Usually Burnt, but occasionally Cooked!\nNocturnal Nursery - All active pets gain an additional 0.17 XP/s",
    "mGeneral": "The Cooked Owl is a mythical pet that was obtainable in the game during the Crafting Update, It was also only obtainable during Jandel handouts during 16M players, if players look closely at the model, they will find a hint to a \"Golden Bee\" pet.\nThe Cooked Owl bears similarities to the Owl. It uses drumsticks in place of wings and its body is entirely brown to present itself as being cooked. There are also smoke particles coming out from the Cooked Owl's head.",
    "mTrivia": "Every ~15 minutes, ~15.35% chance to cook a nearby fruit. Usually Burnt, but occasionally Cooked. All active pets gain an additional ~0.17 XP/s.\nThe Cooked Owl was teased during the release of the Cosmetics Update.\nAt the time of it being released, players online were given 2 Cooked Owls.\nThe Cooked Owl exists because of The Wise Old Owl not stocking good things causing Jandel to joke about turning the Wise Old Owl into a BBQ cosmetic.\nThe reason Cooked Owl Pet is ranked \"Mythical\" is because the Owl is ranked Mythical.\nThe Cooked Owl has 2 abilities: Let Him Cook, and Nocturnal Nursery.\nThe Cooked Owl gives 0 Coins when sold, similar to Panda and Bald Eagle.\nThe Cooked Owl has an admin mutation based on it.",
	"mValue": "8000000000000"
  },
  {
    "mId": 73,
    "mName": "Blood Kiwi",
    "mNameIcon": "bloodkiwi.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "20,000,000 Coins in Blood Moon Shop\n",
    "mHatch_chance": "",
    "mPassive": "Crimson Cradle: Every 60s, decreases hatch time of egg with the highest remaining hatch time by 45s and increases its hatch speed by 20%.",
    "mGeneral": "The Blood Kiwi is a mythical pet added in the Blood Moon Event update; one of the 9 pets added. It could be purchased in the Blood Moon Shop for  20,000,000 or obtained during the Summer Harvest Event. It has 45,000 hunger, and is another variation of the Kiwi pet.\nThe Blood Kiwi is a recolor of the Kiwi. The Kiwi is a bird with a maroon body and head, featuring an orange beak and feet, and red pupils. When singing, it produces musical notes in strong hues of red, orange, and yellow.",
    "mTrivia": "The Blood Kiwi's passive is to sit above the egg with the highest remaining hatch time, reducing its hatch time by ~45s every ~60s. It also increases its hatch speed by ~20%.\nHowever, the Kiwi remains inactive if there are no eggs on the player's plot or if all eggs have no remaining hatch.",
	"mValue": "7000000000000"
  },
  {
    "mId": 74,
    "mName": "Night Owl",
    "mNameIcon": "nightowl.webp",
    "mTier": "Mythical",
    "mObtainable": "No",
    "mObtaining_method": "Night Egg 3.53%\nPremium Night Egg 4%",
    "mHatch_chance": "N/A",
    "mPassive": "All active pets gain an additional <0.23 XP per second.",
    "mGeneral": "The Night Owl dawns the appearance of its other counterpart, but with a darker purple. It is one of the 3 Owl mutations.\nAll active pets gain an additional >0.20 XP per second.",
    "mTrivia": "Passive XP gain can be useful in attaining Pet or Egg Equip slots.\nThe Night Owl's ability is called \"Movement Variation.",
	"mValue": "1800000000000"
  },
  {
    "mId": 75,
    "mName": "Red Fox",
    "mNameIcon": "redfox.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mObtaining_method": "Mythical Egg with 8,000,000 Sheckles or 199 Roblux",
    "mHatch_chance": "1.5%",
    "mPassive": "Scoundrel: Attempts to steal (duplicate) a seed from another user's plot every ~6 minutes if it successfully steals a seed it will try to steal another one",
    "mGeneral": "The Red Fox is a divine pet added in the Blood Moon Update. It has a 1.69% chance of being hatched from a Mythical Egg.",
    "mTrivia": "Appearance\nThe Red Fox has a blocky appearance (studs) with a bright orange-red body. It has large, triangular ears with white insides, square black eyes, and a white snout. Its legs are black, and the tip of its tail is white, matching the white fur under its neck.\n\nTrait\nScoundrel: Every 6:50 minutes the Red Fox goes to a random player's garden and attempts to steal (duplicate) the seed to give to the owner. If succeeded, it will attempt to steal a seed again. It works only with Seed Shop plants and does not work on event/unobtainable plants.\n\nThe Red Fox, Kitsune, Kappa, and Queen Bee are the only pets to have a higher rarity than their eggs rarity.\n\nThe Red Fox is one of the few pets that can interact directly with players. The other pets are the Crab, the Kitsune and the Raccoon.\nThe Red Fox does not steal single-harvest plants.",
	"mValue": "58000000000000"
  },
  {
    "mId": 76,
    "mName": "T-Rex",
    "mNameIcon": "trex.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mObtaining_method": "Dinosaur Egg",
    "mHatch_chance": "0,5%",
    "mPassive": "Apex Predator: Occasionally eats a random mutation from a fruit in your garden then roars and applies that mutation to other fruits in your garden.",
    "mGeneral": "The T-Rex is a Divine pet which can be obtained from the Dinosaur Egg in the Prehistoric Event.\nThe T-Rex has a light-green body, with a light brown skin on its belly. It is much larger than the player and shares a unique holding animation having both arms carrying it. This animation is shared with all other pets coming from the Dinosaur Egg. (Not to be confused with the Raptor's appearance)",
    "mTrivia": "Apex Predator: Every ~20m eats a random mutation from a fruit in the player's garden then roars and applies that mutation to (~3) other fruits in the player's garden. (Doesn't apply to Dawnbound)\nAfter a mutation is eaten, it will be removed from the targeted fruit.\nThe T-Rex will not devour mutations from favorited fruits.\nIt does not devour and spread the Gold or Rainbow mutations.\nLike all other pets from the Dinosaur Egg, the T-Rex cannot be put into the DNA Machine.",
	"mValue": "600000000000000"
  },
  {
    "mId": 77,
    "mName": "Dragonfly",
    "mNameIcon": "dragonfly.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mObtaining_method": "Bug Egg 1%\nExotic Bug Egg 1%",
    "mHatch_chance": "Bug Egg 1%\nExotic Bug Egg 1%",
    "mPassive": "Transmutation: Every ~5 minutes, one random crop will turn gold. (Does not work on produce with existing variants. This includes weaker variants, such as Silver)",
    "mGeneral": "The Dragonfly is a divine pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a 1% chance.",
    "mTrivia": "Appearance\nThe Dragonfly is a completely golden version of a real dragonfly, but its eyes, wing tips, and tail are neon. The Dragonfly flaps its wings every client frame. It uses the same texture as the Gold mutation.\n\nTrait\nEvery ~5 minutes, turns one random fruit Gold.\nThe Dragonfly is based off the real-life dragonfly, Anisoptera, although it more closely resembles the carboniferous creature Meganeura.\nIt is the first Divine pet to be released into the game.\n\nWhen being held by the player, the Dragonfly is not in their hand, and rather few studs away from hand and has its head at ground. This is most likely due to the Dragonfly's true hitbox being placed at ground level and it's model being offset upwards for the hovering effect.\n\nThe Dragonfly is one of the only three pets that can apply growth-variant mutations to plants. The second one being the Butterfly and the third one being the Golden Bee.\n\nAs of now, the Dragonfly has the highest hunger count, with 100,000 hunger points.",
	"mValue": "580000000000000"
  },
  {
    "mId": 78,
    "mName": "Queen Bee",
    "mNameIcon": "queenbee.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "1%",
    "mPassive": "Every ~20 Minutes, a nearby fruit becomes magically pollinated, applying the Pollinated mutation.\nEvery ~23 Minutes, the pet with the highest cooldown refreshes its ability! Does not refresh pet mutation abilities.",
    "mGeneral": "The Queen Bee is a divine pet added in the Bizzy Bee Event update. It can be obtained in the Bee Egg, which can be purchased for  30,000,000 Sheckles, 18 Honey or 129 Roblux with a 1% chance. It has 65,000 hunger.",
    "mTrivia": "Appearance\nThe Queen Bee is very large, towering over the player. It has a blush on her face, a crown on her head, a huge abdomen. She is identical in appearance to the NPC Queen Bee.\n\nTrait\nQueen Pollinator: Every ~20 Minutes, a nearby fruit becomes magically pollinated, applying the Pollinated mutation.\nFor the Queen: Every ~23 Minutes, the pet with the highest cooldown will refresh its ability! Does not refresh pet mutation abilities or French Fry Ferret's ability.\n\nThe Queen Bee can refresh another Queen Bee's ability, resulting in a potentially endless loop. It can only stop when there is another pet with a higher cooldown.\n\nWhen holding the Queen Bee, the crown will occasionally sparkle with the same effect as Celestial mutation.\n\nThe Queen Bee's crown is very similar to the Coat of Arms of the New Zealand Crown, the birthplace of Jandel, one of the main developers.\n\nThis pet is one of the only pets to refresh another pet's cooldown.",
	"mValue": "460000000000000"
  },
  {
    "mId": 79,
    "mName": "Disco Bee",
    "mNameIcon": "discobee.webp",
    "mTier": "Divine",
    "mObtainable": "Yes",
    "mObtaining_method": "Anti Bee Egg\nPremium Anti Bee Egg",
    "mHatch_chance": "0.25%",
    "mPassive": "Every ~10 minutes, has a ~20% chance a nearby fruit becomes Disco!",
    "mGeneral": "The Disco Bee is a Divine Pet added inside the Friendship Update.\n\nThe Disco Bee has 25,000 hunger.",
    "mTrivia": "Obtainment\nThe Disco Bee can be obtained from the Anti Bee Egg with an hatch chance of 0.25%, which can be crafted or bought for 149 Roblux.\n\nAppearance\nThe Disco Bee has a model of the Bee with glasses on. The Disco Bee's wings flap every client frame. Disco Bee's body coloring fluctuates through the rainbow, just like the Disco mutation.\n\nTrait\nDisco Disco: Every ~15 minutes, has a 14% + weight (in kg) chance a nearby fruit becomes Disco! (As of v1706 Ability Chance and Cooldown got Buffed/9 hours before the update/admin abuse)\nAmongst all pets with ability of applying a crop mutation (Disco), The Disco Bee applies the mutation with the 2nd highest multiplier, tied with Lobster Thermidor (Meteoric) right behind HarmonisedFoxfireChackra\n\nThe Disco Bee only has 1 eye under its glasses.\nUpon being hatched from an Anti Bee Egg, the Disco Bee will fly up.",
	"mValue": "1000000000000000"
  },
  {
    "mId": 80,
    "mName": "Fennec Fox",
    "mNameIcon": "fennecfox.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mObtaining_method": "Oasis Egg 10 Summer Coins\nPremium Oasis Egg 149 Roblux",
    "mHatch_chance": "0.5%",
    "mPassive": "Sly: Every 22:12m, goes to another player's random fruit, copies 1 mutation from it and applies it to a random fruit the pet owner owns! The higher mutation multiplier the rarer chance to copy.",
    "mGeneral": "The Fennec Fox's appearance resembles that of a real-life Fennec Fox.",
    "mTrivia": "Every 22:12m, the Fennec Fox goes to a random fruit in a player's garden, copies one mutation from it, then applies it to any fruit in the pet owner's garden. The higher a mutation's multiplier is, the rarer it will be for the pet to succeed in copying said mutation. Cannot put mutations on favorited plants.",
	"mValue": "1400000000000000"
  },
  {
    "mId": 82,
    "mName": "Blood Owl",
    "mNameIcon": "bloodowl.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mObtaining_method": "60,000,000 Coins in Blood Moon Shop",
    "mHatch_chance": "",
    "mPassive": "All active pets gain >0.50 XP per second.",
    "mGeneral": "The Blood Owl is a divine pet added in the Blood Moon Event update. The Blood Owl is one of the nine pets added in the update, also known as Update 1.06.0.\nThe Blood Owl could be obtained in the Blood Moon Shop for 60,000,000 Coins. The Blood Owl has 50,000 hunger.",
    "mTrivia": "The Blood Owl shares the same model as the Owl. However, it is recolored in various shades of red. It is one of the 3 owl mutations, along with the Night Owl and Cooked Owl.\nAll active pets gain an additional >0.50 XP per second.",
	"mValue": "32000000000000"
  },
  {
    "mId": 83,
    "mName": "Raccoon",
    "mNameIcon": "raccoon.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mObtaining_method": "Night Egg",
    "mHatch_chance": "Night Egg 0.1%\nExotic Night Egg 1%",
    "mPassive": "Every ~15 minutes, goes to another player's plot and steals (duplicate) a random crop and gives it to the player!",
    "mGeneral": "The Raccoon has a slightly complex build. It has a large face with a snout, pentagonal ears, four small legs, and a small tail. Most of its body is a plain silver. It has a \"mask\" over its face that is a darker gray, similar in color to its ears and the stripes on its tail. Its inner ears, paws, and tail are a darker gray that gets fairly near black. It also has a white tuft on its chest, eyebrows, and snout. Its snout has a nose, but no visible mouth and appears expressionless.\nEvery 15 minutes, the Raccoon goes to another player's plot and duplicates their fruit, then gives it to the pet owner.",
    "mTrivia": "The Raccoon has a somewhat similar trait as the Red Fox, guaranteed to reward the player a plant, including event exclusive plants, while the Red Fox duplicates seeds from only the Seed Shop.\nThe Raccoon, Red Fox, and the Fennec Fox are the only pets to directly interact with other players' gardens.\nThe Raccoon is currently the third rarest pet in the game.\nThe Raccoon is one of the highest in-demand pets in the game.",
	"mValue": "1900000000000000"
  },
  {
    "mId": 84,
    "mName": "French Fry Ferret",
    "mNameIcon": "frenchfryferret.webp",
    "mTier": "Divine",
    "mObtainable": "No",
    "mObtaining_method": "Gourmet Egg",
    "mHatch_chance": "1%",
    "mPassive": "Friendly Frier: Every ~60:32m, increases a random pet's level by 1! Ability cannot be mimicked or refreshed.",
    "mGeneral": "The appearance of the French Fry Ferret has a French Fry on his head with the \"Letter G\" which might mean \"Gourmet\" as a reference to the event and a French Fry bag on top of their head.\nFriendly Frier: Every ~60:32m, increases a random pet's level by 1! Ability cannot be mimicked or refreshed.",
    "mTrivia": "This section is a trivia section. Please relocate any relevant information into other sections of the article.\n\nThe Mimic Octopus cannot mimic the French Fry Ferret's ability.\nPets that decrease the cooldown of abilities such as Wasp, Tarantula Hawk, Queen Bee cannot target this pets main ability.\nThe French Fry Ferret has the longest minimum cooldown cap of 20:00. Most pets has 1:00 minimum cooldown cap.",
	"mValue": "1700000000000000"
  }
]
}
