[
  {
    "mId": 1,
    "mName": "Bunny",
    "mNameIcon": "bunny.webp",
    "mTier": "Common",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
	"mPassive": "Every 40s, eats a carrot at a 1.5x value bonus.",
	"mGeneral": "The Bunny is a Common Pet added in the Animal Update. It can be obtained by hatching the Common Egg with a chance of 33.33%. The Bunny has 1,100 hunger.",
    "mTrivia": "- Every 40 seconds, the Bunny searches for a carrot or chocolate carrot on the garden and eats it, automatically selling it at a marked up price of 1.5x value. The sell value multiplier increases as the Bunny ages.\n- If no carrots are planted in the garden, Bunnies will wander around aimlessly."
  },
  {
    "mId": 2,
    "mName": "Dog",
    "mNameIcon": "dog.webp",
    "mTier": "Common",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
	"mPassive": "Every 60s, 5% chance to dig up a random seed.",
	"mGeneral": "The Dog is a Common Pet added in the Animal Update. It can be obtained by hatching the Common Egg with a chance of 33.33%.",
    "mTrivia": "Every ~60 seconds, the Dog will attempt to dig up a random seed (only Seed Shop plants), with a ~5% chance to succeed."
  },
  {
    "mId": 3,
    "mName": "Golden Lab",
    "mNameIcon": "golden_lab.webp",
    "mTier": "Common",
    "mObtaining_method": "Common Egg",
    "mHatch_chance": "33.33%",
	"mPassive": "Every 60s, 5% chance to dig up a random seed.",
	"mGeneral": "The Golden Lab is a Common Pet added in the Animal Update. It can be obtained by hatching the Common Egg with a chance of 33.33%. The Golden Lab has 1,000 hunger. Every few minutes, it naps for about 3 - 4 seconds (does nothing special while sleeping).",
    "mTrivia": "Every 60 seconds, the Golden Lab will attempt to dig up a random seed (only Seed Shop plants), with a 10% chance to succeed."
  },
  {
    "mId": 4,
    "mName": "Bee",
    "mNameIcon": "bee.webp",
    "mTier": "Common",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "65%",
	"mPassive": "Every 24:45m, flies to a nearby fruit and pollinates it, applying the Pollinated mutation. (The time is reduced when the pet is leveled up.)",
	"mGeneral": "The Bee is a common Pet added in the Bizzy Bee Event update.\nThe Bee can be obtained from the Bee Egg, which can be purchased for  18.\nThe Bee has 25,000 hunger.",
    "mTrivia": "Every 24:45m, the Bee flies to a nearby fruit and pollinates it, applying the Pollinated mutation. When pollination occurs, the following message appears: Bee applied Pollinated mutation to the [Plant]."
  },
  {
    "mId": 5,
    "mName": "Black Bunny",
    "mNameIcon": "black_bunny.webp",
    "mTier": "Uncommon",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
	"mPassive": "Every 40 seconds, the Black Bunny searches for a Carrot on the garden and eats it, automatically selling it at a marked up price of 1.5x value.",
	"mGeneral": "The Black Bunny is an Uncommon pet added in the Animal Update. It can be obtained from hatching the Uncommon Egg with a chance of 25%, and is a variant of the Bunny. The Black Bunny has 1,300 hunger.",
    "mTrivia": "- Every 40 seconds, the Black Bunny searches for a Carrot or Chocolate Carrot on the garden and eats it, automatically selling it at a marked up price of 1.5x value. The sell value multiplier increases as the Bunny ages.\n- If no Carrot is available, the Black Bunny will roam around the garden without taking action."
  },
  {
    "mId": 6,
    "mName": "Cat",
    "mNameIcon": "cat.webp",
    "mTier": "Uncommon",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
	"mPassive": "Every 80 seconds, the Cat will nap for 10 seconds. New fruit within 10 studs will be 1.25x larger.",
	"mGeneral": "The Cat has a grey body, with dark grey whiskers and markings. The inner ears and nose are both pink, and the eyes and mouth are both black. It shares the same model with the Orange Tabby.",
    "mTrivia": "Every 80 seconds, the Cat naps for 10 seconds. Nearby plants within 10 studs will have their new fruit grow 1.25x larger."
  },
  {
    "mId": 7,
    "mName": "Chicken",
    "mNameIcon": "chicken.webp",
    "mTier": "Uncommon",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
	"mPassive": "Increases egg hatch speed by 10%.",
	"mGeneral": "The Chicken is an Uncommon pet added in the Animal Update. It can be obtained from hatching the Uncommon Egg with a chance of 25%. Its maximum hunger is 3,400. When paired with a Rooster, it grants an 11.45% chance for the Chicken to lay an egg.",
    "mTrivia": "The Chicken passively increases egg hatch speed by approximately 10%. This boost can stack with other pets as well as Roosters ,kiwi or the Blood Kiwi."
  },
  {
    "mId": 8,
    "mName": "Deer",
    "mNameIcon": "deer.webp",
    "mTier": "Uncommon",
    "mObtaining_method": "Uncommon Egg",
    "mHatch_chance": "25%",
	"mPassive": "Gives a 3% chance for berry plants to stay when harvested.",
	"mGeneral": "The Deer is an Uncommon Pet added in the Animal Update. It can be obtained by hatching the Uncommon Egg with a chance of 25%. The Deer has 2,500 hunger",
    "mTrivia": "The Deer has a passive trait which gives a 3% chance for berry plants which are (Blueberries, Strawberries, Raspberries, and Celestiberries) to replant themselves when harvested."
  },
  {
    "mId": 9,
    "mName": "Monkey",
    "mNameIcon": "monkey.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "8.33%",
	"mPassive": "Selling fruit has a chance to refund it to your inventory (2.5%). Rarer fruits have a lower refund chance.",
	"mGeneral": "The Monkey is a Rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 8.33%.",
    "mTrivia": "The Monkey has a passive trait that gives a ~2.5% chance of refunding a fruit back to the player when selling it. Rarer fruits have a lower refund chance."
  },
  {
    "mId": 10,
    "mName": "Orange Tabby",
    "mNameIcon": "orange_tabby.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "33.33%",
	"mPassive": "Every 90 seconds, naps for 15 seconds and causes new fruit within 15 studs to grow 1.5x larger.",
	"mGeneral": "The Orange Tabby is a Rare pet added in the Animal Update. It can be obtained from hatching the Rare Egg with a chance of 33.33%. The Orange Tabby has 1,500 hunger.",
    "mTrivia": "Every 90 seconds, the Orange Tabby takes a 15 second nap. After the nap, any new fruit within 15 studs will grow 1.5x larger."
  },
  {
    "mId": 11,
    "mName": "Pig",
    "mNameIcon": "pig.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "16.67%",
	"mPassive": "Every 118 seconds, the pig emits a 15 second aura that grants a 2x chance for plants within 15 studs to grow variant fruits.",
	"mGeneral": "The Pig is an Uncommon pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 16.67%.",
    "mTrivia": "The Pig has a passive trait which allows it to emit a 15 second aura every 118 seconds that grants a 2x chance for the nearest plant within 15 studs to grow mutated fruits. This trait can only affect fruits that have not fully grown."
  },
  {
    "mId": 11,
    "mName": "Rooster",
    "mNameIcon": "rooster.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "16.67%",
	"mPassive": "Increases egg hatch speed by ~20%.",
	"mGeneral": "The Rooster is a Rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 16.67%.",
    "mTrivia": "The Rooster has a passive trait that increases egg hatch speed by ~20%."
  },
  {
    "mId": 12,
    "mName": "Spotted Deer",
    "mNameIcon": "spotted_deer.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "25%",
	"mPassive": "Gives a 5% chance for berry plants to stay when harvested.",
	"mGeneral": "The Spotted Deer is a Rare pet added in the Animal Update. It can be obtained by hatching the Rare Egg with a chance of 25%. The Spotted Deer has 2,500 hunger.",
    "mTrivia": "The Spotted Deer has a passive trait which gives a 5% chance for berry plants to not disappear when harvested."
  },
  {
    "mId": 13,
    "mName": "Honey Bee",
    "mNameIcon": "honey_bee.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "25%",
	"mPassive": "Every ~20 minutes flies to a nearby fruit and pollinates it, giving it a pollinated mutation",
	"mGeneral": "The Honey Bee is a rare Pet introduced in the Bizzy Bee Event update.\nThe Honey Bee can be obtained in the Bee Egg for  18.\nThe Honey Bee has 25,000 hunger.",
    "mTrivia": "Every ~20m, flies to a nearby fruit and pollinates it, applying the Pollinated mutation. This trait is exactly same with Bee, but with shorter cooldown."
  },
  {
    "mId": 14,
    "mName": "Honey Bee",
    "mNameIcon": "honey_bee.webp",
    "mTier": "Rare",
    "mObtaining_method": "Rare Egg",
    "mHatch_chance": "25%",
	"mPassive": "Every ~20 minutes flies to a nearby fruit and pollinates it, giving it a pollinated mutation",
	"mGeneral": "The Honey Bee is a rare Pet introduced in the Bizzy Bee Event update.\nThe Honey Bee can be obtained in the Bee Egg for  18.\nThe Honey Bee has 25,000 hunger.",
    "mTrivia": "Every ~20m, flies to a nearby fruit and pollinates it, applying the Pollinated mutation. This trait is exactly same with Bee, but with shorter cooldown."
  },
  {
    "mId": 15,
    "mName": "Cow",
    "mNameIcon": "cow.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "42,55%",
	"mPassive": "Causes all plants within 8 studs to grow 1.12x faster.",
	"mGeneral": "The Cow is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. The Cow has 9,500 hunger.",
    "mTrivia": "The Cow has a passive trait which causes all plants within 8 studs to grow 1.12x faster."
  },
  {
    "mId": 16,
    "mName": "Polar Bear",
    "mNameIcon": "polar_bear.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "2,13%",
	"mPassive": "Every ~90s, ~10% chance to turn a nearby crop chilled or frozen.",
	"mGeneral": "The Polar Bear is a Legendary pet added in the Animal Update. It can be obtained by hatching a Legendary Egg with a 2.13% chance.",
    "mTrivia": "Every ~90 seconds, the Polar Bear has a ~10% chance to turn a nearby crop chilled or frozen."
  },
  {
    "mId": 17,
    "mName": "Sea Otter",
    "mNameIcon": "sea_otter.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "10.64%",
	"mPassive": "Every ~15 seconds, sprays water on a nearby plant!",
	"mGeneral": "The Sea Otter is a Legendary pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 10.64%. It has 30,000 hunger.",
    "mTrivia": "Every 15 seconds, the Sea Otter sprays water on the nearest plant within at least 15 studs. The Sea Otter does not apply any mutations to the affected plant - it only speeds up growth similar to the Watering Can. The ability is completely random, there is no higher or lower chances for specific rarities."
  },
  {
    "mId": 18,
    "mName": "Silver Monkey",
    "mNameIcon": "silver_monkey.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "42.55%",
	"mPassive": "8% chance to refund crops.",
	"mGeneral": "The Silver Monkey is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. It has 8,000 hunger.",
    "mTrivia": "The Silver Monkey gives an 8% chance to refund crops back to a player's inventory. Rarer crops have a lower chance of receiving these refunds. For example, a Carrot has a higher chance of being refunded than a Beanstalk. This chance stacks with other Silver Monkeys, as well as Monkeys."
  },
  {
    "mId": 19,
    "mName": "Turtle",
    "mNameIcon": "turtle.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Legendary Egg",
    "mHatch_chance": "2.13%",
	"mPassive": "All sprinklers last ~20% longer.",
	"mGeneral": "The Silver Monkey is a Legendary Pet added in the Animal Update. It can be obtained by hatching the Legendary Egg with a chance of 42.55%. It has 8,000 hunger.",
    "mTrivia": "The Silver Monkey gives an 8% chance to refund crops back to a player's inventory. Rarer crops have a lower chance of receiving these refunds. For example, a Carrot has a higher chance of being refunded than a Beanstalk. This chance stacks with other Silver Monkeys, as well as Monkeys."
  },
  {
    "mId": 20,
    "mName": "Petal Bee",
    "mNameIcon": "petal_bee.webp",
    "mTier": "Legendary",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "4%",
	"mPassive": "Every 24:46m flies to a nearby fruit and pollinates it, applying Pollinated mutation! 1.17% chance Flower type fruit stays after harvest!",
	"mGeneral": "The Petal Bee is a Legendary Pet added in the Bizzy Bee Event update.\nThe Petal Bee can be obtained in the Bee Egg for which can be purchased for  18.\nThe Petal Bee has 25,000 hunger.",
    "mTrivia": "Every 24:46m flies to a nearby fruit and pollinates it, applying Pollinated mutation! 1.17% chance Flower type fruit stays after harvest!"
  },
  {
    "mId": 21,
    "mName": "Brown Mouse",
    "mNameIcon": "brown_mouse.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "26.79%",
	"mPassive": "Gains 750 bonus experience every 8 minutes. Increases the player's jump height by 10%.",
	"mGeneral": "The Brown Mouse is a Mythical Pet added in the Blood Moon Event Update. It can be obtained from hatching the Mythical Egg with a chance of 26.79%. It has 15,000 hunger.",
    "mTrivia": "The Brown Mouse's passive trait allows it to gain 750 bonus experience every 8 minutes and increase the player's jump height by 10%."
  },
  {
    "mId": 22,
    "mName": "Caterpillar",
    "mNameIcon": "caterpillar.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Bug Egg",
    "mHatch_chance": "25%",
	"mPassive": "Leafy plants grow 1.65x faster.",
	"mGeneral": "The Caterpillar is a Mythical Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a chance of 25%.",
    "mTrivia": "The Caterpillar has a passive trait which makes all leafy plants grow 1.65x faster."
  },
  {
    "mId": 23,
    "mName": "Giant Ant",
    "mNameIcon": "giant_ant.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Bug Egg",
    "mHatch_chance": "30%",
	"mPassive": "~10% chance for harvested crops to duplicate. +~5% chance to duplicate candy type plant. Rarer fruits duplicate less often.",
	"mGeneral": "The Caterpillar is a Mythical Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a chance of 25%.",
    "mTrivia": "The Giant Ant's first passive trait gives a 10% chance to duplicate a fruit being harvested. The more rare a fruit is, the less likely the fruit is to duplicate.\nThe Giant Ant's second passive trait gives an extra ~5% chance for candy crops to be duplicated when harvested."
  },
  {
    "mId": 24,
    "mName": "Grey Mouse",
    "mNameIcon": "grey_mouse.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "35.71%",
	"mPassive": "Gains 500 bonus experience every 10 minutes. Increases the player's movement speed by 10%.",
	"mGeneral": "The Grey Mouse is a Mythical pet added in the Blood Moon Event Update. It can be obtained from hatching the Mythical Egg with a chance of 35.71%. It has 15,000 hunger.",
    "mTrivia": "The Grey Mouse's passive trait allows it to gain 500 bonus experience every 10 minutes and increase the player's movement speed by 10%."
  },
  {
    "mId": 25,
    "mName": "Praying Mantis",
    "mNameIcon": "praying_mantis.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Bug Egg",
    "mHatch_chance": "4%",
	"mPassive": "Every 80s, prays for 10.30s granting a 1.51x variant chance to crops within 10.30 studs.",
	"mGeneral": "The Praying Mantis is a Mythical Pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a 4% chance and have 55,000 hunger bar.",
    "mTrivia": "Every ~80 seconds, the Praying Mantis will pray for ~10 seconds, granting a ~1.5x chance to mutate crops within ~10 studs of the Praying Mantis. This trait applies to already existing plants.\nIt can give any type of mutation to crops within the 10 stud range except for developer or event special mutations."
  },
  {
    "mId": 26,
    "mName": "Red Fox",
    "mNameIcon": "red_fox.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "1.79%",
	"mPassive": "Attempts to steal a seed from another user's plot every ~10 minutes. But the chance to successfully steal a seed is rarer due to the seed the fox steal's rarity.",
	"mGeneral": "The Red Fox is a Mythical Pet added in the Blood Moon Update. It has a 1.79% chance of being hatched from a Mythical Egg.",
    "mTrivia": "Every ~10 minutes the Red Fox goes to a random player's garden and attempts to steal a seed (only Seed Shop plants).\nThe Red Fox can NOT steal any event seeds, tested multiple times with only event plants in other peoples plots.\nThe Red Fox shares the same model with the Raccoon, but colored differently."
  },
  {
    "mId": 27,
    "mName": "Red Giant Ant",
    "mNameIcon": "red_giant_ant.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "8.93%",
	"mPassive": "5% chance harvested crops duplicate! Rarer crops have lower chance to duplicate. 5% extra chance for Fruit type crops to duplicate!",
	"mGeneral": "The Red Giant Ant is a Mythical pet added in the Blood Moon Event Update. It can be obtained from hatching the Mythical Egg with a chance of 8.93%. It has 15,000 hunger.",
    "mTrivia": "The Red Giant Ant's passive trait grants a 5% chance to duplicate crops when harvesting, with lower odds for rarer crops. Fruit-type crops have an extra 5% chance to duplicate."
  },
  {
    "mId": 28,
    "mName": "Snail",
    "mNameIcon": "snail.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Bug Egg",
    "mHatch_chance": "40%",
	"mPassive": "Extra 5% chance harvested plants drop seeds.",
	"mGeneral": "The Snail is a Mythical pet added in the Animal Update. It has a 40% chance of being hatched from a Bug Egg. The Snail has 12,000 hunger.",
    "mTrivia": "The Snail provides an additional 5% chance (Lower chance for rarer plants) for a harvested plant to yield a seed. Its trait can stack with other Snails."
  },
  {
    "mId": 29,
    "mName": "Squirrel",
    "mNameIcon": "squirrel.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Mythical Egg",
    "mHatch_chance": "26.79%",
	"mPassive": "Grants a 2.5% chance to keep a seed when planting.",
	"mGeneral": "The Squirrel is a Mythical Pet added in the Blood Moon Event Update. It can be obtained by hatching the Mythical Egg with a chance of 26.79%. It has 15,000 hunger.",
    "mTrivia": "The Squirrel's trait grants a 2.5% chance to keep a seed when planting, with this chance decreasing for rarer crops."
  },
  {
    "mId": 30,
    "mName": "Bear Bee",
    "mNameIcon": "bear_bee.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "5%",
	"mPassive": "Every 25 minutes it turns a crop Honey Glazed",
	"mGeneral": "The Bear Bee is a mythical Pet added in the Bizzy Bee Event update.\nThe Bear Bee can be obtained in the Bee Egg for 18 Honey.\nThe Bear Bee has 45,000 hunger.",
    "mTrivia": "Every 25:00 minutes, it approaches a nearby fruit, causing it to mutate into Honey Glazed.\nIt is a reference to the Bee Swarm Simulator Bear Bee."
  },
  {
    "mId": 31,
    "mName": "Butterfly",
    "mNameIcon": "butterfly.webp",
    "mTier": "Mythical",
    "mObtaining_method": "Anti Bee Egg",
    "mHatch_chance": "1%",
    "mPassive": "Rainbow flutter:\nEvery ~30m, flies to a nearby fruit with 5+ mutations, removes all mutations from it and turns it rainbow! Ignores favorited fruit.",
    "mGeneral": "The Butterfly can be obtained from the Anti Bee Egg, which can be bought from the Limited Time Shop for  149 or crafted at the Bizzy Bear for:\n5 Honey + 0.36kg Pollinated Strawberry: 1x Egg\n13 Honey + 3.6kg Pollinated Nectarine: 1x Egg\n28 Honey + 1.65kg HoneyGlazed Rose: 1x Egg\n37 Honey + 15.8kg HoneyGlazed Beanstalk: 2x Egg",
    "mTrivia": "Every ~30m, flies to a nearby fruit with 5+ mutations, removes all mutations from it and turns it rainbow! Ignores favorited fruit.\nGold is a variation not a mutation so it won't work if it has only 4 mutations and 1 variation."
  },
  {
    "mId": 32,
    "mName": "Dragonfly",
    "mNameIcon": "dragonfly.webp",
    "mTier": "Divine",
    "mObtaining_method": "Bug Egg",
    "mHatch_chance": "1%",
	"mPassive": "Every ~5 minutes, one random crop will turn gold.",
	"mGeneral": "The Dragonfly is a Divine pet added in the Animal Update. It can be obtained by hatching the Bug Egg with a 1% chance.",
    "mTrivia": "Once every ~5 minutes, the Dragonfly will turn a random crop Gold.\nIt is the first Divine pet to be released into the game, followed by the Night Owl, Raccoon and Blood Owl.\nWhen being held by the player, the Dragonfly is not in their hand, and rather few studs away from hand and has their head at ground. This is most likely a visual bug as pet flies normally once placed."
  },
  {
    "mId": 33,
    "mName": "Queen Bee",
    "mNameIcon": "queenbee.webp",
    "mTier": "Divine",
    "mObtaining_method": "Bee Egg",
    "mHatch_chance": "1%",
	"mPassive": "Every ~25 Minutes, a nearby fruit becomes magically pollinated, applying the Pollinated mutation.\nEvery ~30 Minutes, a random pet will refresh its cooldown.",
	"mGeneral": "The Queen Bee is a Divine pet added in the Bizzy Bee Event update. It can be obtained in the Bee Egg. It has 65,000 hunger.",
    "mTrivia": "Every ~25 Minutes, a nearby fruit becomes magically pollinated, applying the Pollinated mutation.\nEvery ~30 Minutes, a random pet will refresh its cooldown."
  },
  {
    "mId": 34,
    "mName": "Disco Bee",
    "mNameIcon": "discobee.webp",
    "mTier": "Divine",
    "mObtaining_method": "Anti Bee Egg",
    "mHatch_chance": "0.25%",
    "mPassive": "Every 20m, 12% chance a nearby fruit becomes Disco!",
    "mGeneral": "The Disco Bee can be obtained from the Anti Bee Egg, which can be bought from the Limited Time Shop for  149 or crafted at the Bizzy Bear for:\n5 Honey + 0.36kg Pollinated Strawberry: 1x Egg\n13 Honey + 3.6kg Pollinated Nectarine: 1x Egg\n28 Honey + 1.65kg HoneyGlazed Rose: 1x Egg\n37 Honey + 15.8kg HoneyGlazed Beanstalk: 2x Egg",
    "mTrivia": "Once every 15 minutes, the Disco Bee will have a 12% chance to add Disco Mutations to a fruit.\nIt is the only pet that is able to give out the Disco Mutation currently, as it is not possible to get it through any other means outside of a Disco Event caused by an admin."
  }
]
